{
  "abstract" : "Enhance your iPad app’s user experience by supporting drawing, handwriting, and other features of Apple Pencil.",
  "codeExamples" : [

  ],
  "contentHash" : "d2129256b20ad221dd818315ac18877873070a1b368d65a5798ece9306effb85",
  "crawledAt" : "2025-12-03T18:35:02Z",
  "id" : "60704F15-9139-49EE-A411-92B12B4CE9FB",
  "kind" : "unknown",
  "overview" : "TechnologyApple PencilEnhance your iPad app’s user experience by supporting drawing, handwriting, and other features of Apple Pencil.OverviewApple Pencil is an input accessory for iPad that people rely on for tasks like drawing, sketching, painting, jotting notes, marking up documents, and more. In addition to drawing and handwriting, Apple Pencil can also serve as a pointer and UI interaction tool.\n\nAs you optimize your app for iPad, there are many ways you can enhance it with Apple Pencil features. Choose the features that make the most sense in the context of your app, and adopt those features using APIs from PencilKit, SwiftUI, and UIKit.",
  "rawMarkdown" : "---\nsource: https:\/\/developer.apple.com\/documentation\/applepencil\ncrawled: 2025-12-03T18:35:02Z\n---\n\n# Apple Pencil | Apple Developer Documentation\n\nTechnology# Apple Pencil\n\nEnhance your iPad app’s user experience by supporting drawing, handwriting, and other features of Apple Pencil.## [Overview](\/documentation\/applepencil#Overview)\n\nApple Pencil is an input accessory for iPad that people rely on for tasks like drawing, sketching, painting, jotting notes, marking up documents, and more. In addition to drawing and handwriting, Apple Pencil can also serve as a pointer and UI interaction tool.\n\nAs you optimize your app for iPad, there are many ways you can enhance it with Apple Pencil features. Choose the features that make the most sense in the context of your app, and adopt those features using APIs from PencilKit, SwiftUI, and UIKit.\n\n**Drawing**Apple Pencil integrates seamlessly with PencilKit, a framework that lets you incorporate hand-drawn content into your app. PencilKit provides tools for creating, erasing, and selecting pencil strokes on a drawing canvas. You can also implement drawing with high-precision touches from UIKit. Input from Apple Pencil provides data like azimuth, altitude, roll angle, and the amount of force recorded at its tip, which you can use to create rich drawing experiences.\n\n**Handwriting**With Apple Pencil, people can enter handwritten text in any text field, and Scribble automatically converts their handwriting into typed text input. Scribble is available in multiple languages and is on by default. You can also customize Scribble behavior to meet your app’s needs using the Scribble API in UIKit.\n\n**Double tap and squeeze**People can double-tap and squeeze certain models of Apple Pencil to perform actions quickly. People choose which action they want to perform in response to a double tap or squeeze in Settings, or you can implement a custom action that’s specific to your app. You handle a double tap or squeeze using SwiftUI or UIKit.\n\n**Haptics**Apple Pencil Pro can provide tactile feedback by playing haptics. Used sparingly and consistently, haptic feedback can enhance the experience of using Apple Pencil Pro to perform tasks like snapping objects to a grid. You provide haptic feedback using the sensory feedback API in SwiftUI or the feedback generators API in UIKit.\n\n**Hover**When a person holds a supported model of Apple Pencil close above the screen without touching it, the pencil can provide information about the distance of the tip from the screen. You can use this hover distance to create more expressive drawing and input experiences with Apple Pencil. You get this information using hover gestures in UIKit.\n\n**Pointers**Apple Pencil can behave similar to a pointer, like a trackpad or mouse. For example, you can configure your views to provide visual feedback when a person holds Apple Pencil over the view. Add visual feedback to your views during hover using hover events in SwiftUI or pointer interactions in UIKit.\n\nFor more details on Apple Pencil features and compatibility, see [Apple Pencil](https:\/\/www.apple.com\/apple-pencil\/).\n\n#### [Related videos](\/documentation\/applepencil#Related-videos)\n\n[ Introducing PencilKit ](https:\/\/developer.apple.com\/videos\/play\/wwdc2019\/221)[ What's new in PencilKit ](https:\/\/developer.apple.com\/videos\/play\/wwdc2020\/10107)[ Meet Scribble for iPad ](https:\/\/developer.apple.com\/videos\/play\/wwdc2020\/10106)[ Inspect, modify, and construct PencilKit drawings ](https:\/\/developer.apple.com\/videos\/play\/wwdc2020\/10148)## [Topics](\/documentation\/applepencil#topics)\n\n### [Essentials](\/documentation\/applepencil#Essentials)\n\n[Apple Pencil updates](\/documentation\/Updates\/ApplePencil)Learn about important changes to Apple Pencil.### [Drawing](\/documentation\/applepencil#Drawing)\n\n[Drawing with PencilKit](\/documentation\/PencilKit\/drawing-with-pencilkit)Add expressive, low-latency drawing to your app using PencilKit.[Inspecting, Modifying, and Constructing PencilKit Drawings](\/documentation\/PencilKit\/inspecting-modifying-and-constructing-pencilkit-drawings)Score users’ ability to match PencilKit drawings generated from text, by accessing the strokes and points inside PencilKit drawings.[Getting high-fidelity input with coalesced touches](\/documentation\/UIKit\/getting-high-fidelity-input-with-coalesced-touches)Learn how to support high-precision touches in your app.[Implementing coalesced touch support in an app](\/documentation\/UIKit\/implementing-coalesced-touch-support-in-an-app)Learn how to create a simple app that handles coalesced touches.### [Handwriting](\/documentation\/applepencil#Handwriting)\n\n[Customizing Scribble with Interactions](\/documentation\/PencilKit\/customizing-scribble-with-interactions)Enable writing on a non-text-input view by adding interactions.[Handwriting recognition](\/documentation\/UIKit\/handwriting-recognition)Configure text fields and custom views that accept text to handle input from Apple Pencil.### [Double tap and squeeze](\/documentation\/applepencil#Double-tap-and-squeeze)\n\n[Apple Pencil interactions](\/documentation\/UIKit\/apple-pencil-interactions)Handle user interactions like double tap and squeeze on Apple Pencil.[Handling squeezes from Apple Pencil](\/documentation\/applepencil\/handling-squeezes-from-apple-pencil)Detect and respond to squeezes a person makes on Apple Pencil Pro.[Handling double taps from Apple Pencil](\/documentation\/applepencil\/handling-double-taps-from-apple-pencil)Detect and respond to double taps a person makes on Apple Pencil.### [Haptics](\/documentation\/applepencil#Haptics)\n\n[Playing haptic feedback in your app](\/documentation\/applepencil\/playing-haptic-feedback-in-your-app)Provide tactile feedback when people perform certain actions in your app.### [Hover](\/documentation\/applepencil#Hover)\n\n[Adopting hover support for Apple Pencil](\/documentation\/UIKit\/adopting-hover-support-for-apple-pencil)Enhance user feedback for your iPadOS app with a hover preview for Apple Pencil input.### [Pointers](\/documentation\/applepencil#Pointers)\n\n[Input events](\/documentation\/SwiftUI\/Input-events)Respond to input from a hardware device, like a keyboard or a Touch Bar.[Pointer interactions](\/documentation\/UIKit\/pointer-interactions)Support pointer interactions in your custom controls and views.[Integrating pointer interactions into your iPad app](\/documentation\/UIKit\/integrating-pointer-interactions-into-your-ipad-app)Support touch interactions in your iPad app by adding pointer interactions to your views.### [Design](\/documentation\/applepencil#Design)\n\n[Apple Pencil and Scribble](\/design\/Human-Interface-Guidelines\/apple-pencil-and-scribble)Apple Pencil helps make drawing, handwriting, and marking effortless and natural, in addition to performing well as a pointer and UI interaction tool.[Playing haptics](\/design\/Human-Interface-Guidelines\/playing-haptics)Playing haptics can engage people’s sense of touch and bring their familiarity with the physical world into your app or game.",
  "sections" : [
    {
      "content" : "",
      "title" : "Overview"
    },
    {
      "content" : "",
      "title" : "Topics"
    }
  ],
  "source" : "appleWebKit",
  "title" : "Apple Pencil | Apple Developer Documentation",
  "url" : "https:\/\/developer.apple.com\/documentation\/applepencil"
}