{
  "abstract" : "Add a deeper level of immersion to media playback in your app with RealityKit and Reality Composer Pro.",
  "codeExamples" : [

  ],
  "contentHash" : "347f4729666c12a867c886351d3987a1fcfe1f7a45ff2a7e459e097b1d7cd5bb",
  "crawledAt" : "2025-12-02T16:23:47Z",
  "declaration" : {
    "code" : "struct ImmersiveEnvironmentPickerView: View {\n    @Environment(ImmersiveEnvironment.self) private var immersiveEnvironment\n    \n    var body: some View {\n        studioButton(state: .dark)\n        studioButton(state: .light)\n    }\n    \n    private func studioButton(state: EnvironmentStateType) -> some View {\n        Button {\n            immersiveEnvironment.requestEnvironmentState(state)\n            immersiveEnvironment.loadEnvironment()\n        } label: {\n            Label {\n                Text(\"Studio\", comment: \"Show Studio environment\")\n            } icon: {\n                Image([\"studio_thumbnail\", state.displayName.lowercased()].joined(separator: \"_\"))\n            }\n            Text(state.displayName)\n        }\n    }\n}",
    "language" : "swift"
  },
  "id" : "FAA44797-AA0C-4BF5-A135-30BFC4C13C16",
  "kind" : "unknown",
  "overview" : "visionOS  Building an immersive media viewing experience  Building an immersive media viewing experience Sample CodeBuilding an immersive media viewing experienceAdd a deeper level of immersion to media playback in your app with RealityKit and Reality Composer Pro. Download (1.2 GB) visionOS 2.0+Xcode 16.0+OverviewvisionOS provides powerful features for building immersive media playback apps. It supports playing 3D video and Spatial Audio, which helps bring the content to life and makes the viewer feel like they’re part of the action. Starting in visionOS 2, you can take your app’s playback experience even further by creating custom environments using RealityKit and Reality Composer Pro.\n\nThe Destination Video sample includes a custom environment, Studio. The Studio environment provides a large, open space that’s specifically designed to provide an optimal media viewing experience, as shown in the following image.",
  "rawMarkdown" : "---\nsource: https:\/\/developer.apple.com\/documentation\/visionos\/building-an-immersive-media-viewing-experience\ncrawled: 2025-12-02T16:23:47Z\n---\n\n# Building an immersive media viewing experience | Apple Developer Documentation\n\n- [ visionOS ](\/documentation\/visionos)\n\n- [ Building an immersive media viewing experience ](\/documentation\/visionos\/building-an-immersive-media-viewing-experience)\n\n-  Building an immersive media viewing experience \n\nSample Code# Building an immersive media viewing experience\n\nAdd a deeper level of immersion to media playback in your app with RealityKit and Reality Composer Pro.[ Download (1.2 GB) ](https:\/\/docs-assets.developer.apple.com\/published\/08bd3c5ea0b3\/DestinationVideo.zip)visionOS 2.0+Xcode 16.0+## [Overview](\/documentation\/visionos\/building-an-immersive-media-viewing-experience#Overview)\n\nvisionOS provides powerful features for building immersive media playback apps. It supports playing 3D video and Spatial Audio, which helps bring the content to life and makes the viewer feel like they’re part of the action. Starting in visionOS 2, you can take your app’s playback experience even further by creating custom environments using RealityKit and Reality Composer Pro.\n\nThe [Destination Video](\/documentation\/visionos\/destination-video) sample includes a custom environment, Studio. The Studio environment provides a large, open space that’s specifically designed to provide an optimal media viewing experience, as shown in the following image.\n\n## [Define a video docking location](\/documentation\/visionos\/building-an-immersive-media-viewing-experience#Define-a-video-docking-location)\n\nDestination Video uses [`AVPlayerViewController`](\/documentation\/AVKit\/AVPlayerViewController) to present video, which enables the app to provide a playback experience across platforms that matches system apps like TV and Music. In visionOS, `AVPlayerViewController` participates in the system docking behavior. When you play video in a full-window player then open an immersive experience, the system docks the video screen in a fixed location and presents streamlined playback controls that keep your focus on the content.\n\nThe system determines the docking location for the scene by default. In visionOS 2, you can customize this location by specifying a custom docking region.\n\nThe environment in Destination Video anchors the video player in front of the walkway at the top of the staircase. To have the video player dock to this location, the project defines a `Player` entity and adds a [`DockingRegionComponent`](\/documentation\/RealityKit\/DockingRegionComponent) to it in Reality Composer Pro’s Inspector. This component defines the bounding region for the video player, which has a depth of `0` and uses a fixed 2.4:1 aspect ratio. Because the aspect ratio is fixed, to configure the docking region’s size use the [`width`](\/documentation\/RealityKit\/DockingRegionComponent\/width) property.\n\nReality Composer Pro provides a template to set up a configuration for Docking Region and related media reflections. You can access this template from the Insert menu by selecting Insert > Environment > Video Dock.\n\nChoose a location for your docking region that provides a comfortable viewing angle to avoid causing strain or discomfort during longer viewing sessions. Avoid placing objects between the viewer and the video. Using Reality Composer Pro to define the docking region helps to visualize how it looks in context. Review your environment and docking region placement on Apple Vision Pro to get an appropriate sense of scale and layout.\n\n## [Enhance the realism of your scene with reflections](\/documentation\/visionos\/building-an-immersive-media-viewing-experience#Enhance-the-realism-of-your-scene-with-reflections)\n\nTo make your environment feel like a real, dynamic space, enable reflections from the video player on your environment surfaces. Reality Composer Pro supports two types of reflections that it exposes as Shader Graph nodes:\n\nReflection SpecularA direct reflection of media content. Apply this reflection type on glossy surfaces like metals, mirrors, and water.\n\nReflection DiffuseA softer falloff of media content. Apply this reflection type to rougher, more organic surfaces like concrete or wood floor.\n\nDestination Video uses both types of reflections in its custom environment to create a more realistic experience that better grounds the video player in the scene.\n\nTo learn more about how the custom environment uses reflections, see [Enabling video reflections in an immersive environment](\/documentation\/visionos\/enabling-video-reflections-in-an-immersive-environment).\n\n## [Define the virtual scene lighting](\/documentation\/visionos\/building-an-immersive-media-viewing-experience#Define-the-virtual-scene-lighting)\n\nWhen Destination Video presents the Studio environment in a progressive immersion style, the scene provides a source of indirect lighting to the system. RealityKit represents this light source using an instance of [`VirtualEnvironmentProbeComponent`](\/documentation\/RealityKit\/VirtualEnvironmentProbeComponent). To configure this lighting, the Studio scene defines an `EnvironmentProbe` entity and adds a Virtual Environment Probe component to it in Reality Composer Pro’s Inspector. It defines the source as a blend between the project’s light and dark image-based lighting (IBL) files, as shown below.\n\nWhen the app presents the light or dark variant, it looks up the probe and configures the source with an appropriate blend value. The app passes a value of `0.0` for the light variant and `1.0` for the dark, which effectively toggles which image the component uses as its source.\n\n\n\n```\nprivate func setVirtualEnvironmentProbeComponent(blendParam: Float) {\n    let virtualEnvironmentProbeEntityName = \"EnvironmentProbe\"\n\n\n    guard let virtualEnvironmentProbeEntity = findCommonEntityByName(virtualEnvironmentProbeEntityName) else {\n        logger.warning(\"(virtualEnvironmentProbeEntityName) not found.\")\n        return\n    }\n\n\n    if var probeComponent = virtualEnvironmentProbeEntity.components[VirtualEnvironmentProbeComponent.self] {\n        if case VirtualEnvironmentProbeComponent.Source.blend(let firstProbe, let secondProbe, _) = probeComponent.source {\n            probeComponent.source = .blend(from: firstProbe, to: secondProbe, t: blendParam)\n            virtualEnvironmentProbeEntity.components[VirtualEnvironmentProbeComponent.self] = probeComponent\n        }\n    }\n}\n\n```\n\n## [Enhance audio immersion](\/documentation\/visionos\/building-an-immersive-media-viewing-experience#Enhance-audio-immersion)\n\nBy default, visionOS reverberates spatial audio sources by simulating the acoustics of the user’s real environment. When you present a custom environment in a progressive or fully immersive space, you can enhance the level of immersion by applying reverb that matches the visuals of your scene.\n\nNote\n\nWhen your app presents an environment in an immersive space using the [`progressive`](\/documentation\/SwiftUI\/ImmersionStyle\/progressive) immersion style, turning the Digital Crown blends the acoustics of the real and virtual spaces to match the visual level of immersion.\n\nThe Studio environment defines a `Reverb` entity and adds a [`ReverbComponent`](\/documentation\/RealityKit\/ReverbComponent) to it in Reality Composer Pro’s Inspector. The component defines a single [`reverb`](\/documentation\/RealityKit\/ReverbComponent\/reverb) property to indicate a specific preset to apply. There are several high-quality reverb presets to choose from including various rooms, hall, and outside spaces. The app uses the `Very Large Room` preset, which best fits the environment’s visuals.\n\nDefine a reverb component in your scene even if it doesn’t provide custom audio. The system still uses the reverb preset to spatialize system sounds such as UI interactions.\n\nNote\n\nTo optimize the viewing experience, in most cases lower the volume of environment sounds, or stop their playback altogether, when video playback begins.\n\n## [Specify content brightness and surroundings effects](\/documentation\/visionos\/building-an-immersive-media-viewing-experience#Specify-content-brightness-and-surroundings-effects)\n\nDestination Video presents the Studio environment by opening an immersive space in the [`progressive`](\/documentation\/SwiftUI\/ImmersionStyle\/progressive) immersion style. This style works well for media apps because people can customize their level of immersion by turning the Digital Crown - from no immersion to fully immersive.\n\nTo enhance the media presentation and create a more immersive experience when presenting the Studio environment, the app customizes the space in the following ways:\n\n- It specifies a content brightness value for the immersive space, which indicates the overall brightness of the scene. The system uses this value to tailor the video presentation to best fit its surroundings.\n\n- It sets a custom tint color for the video passthrough of the user’s hands and surroundings. The app defines tint color that matches the light or dark variant of the environment, and sets the appropriate tint color using the [`preferredSurroundingsEffect(_:)`](\/documentation\/SwiftUI\/View\/preferredSurroundingsEffect(_:)) view modifier.\n\n\n\n```\n\/\/ Defines an immersive space to present an environment in which to watch the video.\nImmersiveSpace(id: ImmersiveEnvironmentView.id) {\n    ImmersiveEnvironmentView()\n        .environment(immersiveEnvironment)\n        .onAppear {\n            contentBrightness = immersiveEnvironment.contentBrightness\n            surroundingsEffect = immersiveEnvironment.surroundingsEffect\n        }\n        .onDisappear {\n            contentBrightness = .automatic\n            surroundingsEffect = nil\n        }\n        \/\/ Set the surroundings effect for the immersive space.\n        .preferredSurroundingsEffect(surroundingsEffect)\n}\n\/\/ Set the content brightness for the immersive space.\n.immersiveContentBrightness(contentBrightness)\n.immersionStyle(selection: .constant(.progressive), in: .progressive)\n\n```\n\n## [Present a custom scene in the environment picker](\/documentation\/visionos\/building-an-immersive-media-viewing-experience#Present-a-custom-scene-in-the-environment-picker)\n\nIn visionOS 2, [`AVPlayerViewController`](\/documentation\/AVKit\/AVPlayerViewController) automatically displays a button for a person to pick an environment. When a person presses the button, the system displays a list of viewing environments in which they can watch the video. Selecting an item from the list opens the environment, and docks the player into its ideal viewing location within the scene. By default, the environment picker lists the most recently used system environments, but you can configure the list to show your custom environments as well.\n\nDestination Video adds the Studio environment’s light and dark variants to the list by attaching the new [`immersiveEnvironmentPicker(content:)`](\/documentation\/SwiftUI\/View\/immersiveEnvironmentPicker(content:)) view modifier to the player view. This modifier takes a [`ViewBuilder`](\/documentation\/SwiftUI\/ViewBuilder) that defines a button for each environment entry you’re adding.\n\n\n\n```\nPlayerView()\n    .immersiveEnvironmentPicker {\n        ImmersiveEnvironmentPickerView()\n    }\n\n```\n\nThis sample passes the modifier a custom view that defines two buttons: one for the light variant and one for the dark. Each button displays a title, thumbnail image, and subtitle that indicates which variant it is.\n\n\n\n```\nstruct ImmersiveEnvironmentPickerView: View {\n    @Environment(ImmersiveEnvironment.self) private var immersiveEnvironment\n    \n    var body: some View {\n        studioButton(state: .dark)\n        studioButton(state: .light)\n    }\n    \n    private func studioButton(state: EnvironmentStateType) -> some View {\n        Button {\n            immersiveEnvironment.requestEnvironmentState(state)\n            immersiveEnvironment.loadEnvironment()\n        } label: {\n            Label {\n                Text(\"Studio\", comment: \"Show Studio environment\")\n            } icon: {\n                Image([\"studio_thumbnail\", state.displayName.lowercased()].joined(separator: \"_\"))\n            }\n            Text(state.displayName)\n        }\n    }\n}\n\n```\n\nAfter adding these buttons to the environment picker, they appear alongside the system environments:\n\n## [See Also](\/documentation\/visionos\/building-an-immersive-media-viewing-experience#See-Also)\n\n#### [Related samples](\/documentation\/visionos\/building-an-immersive-media-viewing-experience#Related-samples)\n\n[Destination Video](\/documentation\/visionos\/destination-video)Leverage SwiftUI to build an immersive media experience in a multiplatform app.#### [Related articles](\/documentation\/visionos\/building-an-immersive-media-viewing-experience#Related-articles)\n\n[Enabling video reflections in an immersive environment](\/documentation\/visionos\/enabling-video-reflections-in-an-immersive-environment)Create a more immersive experience by adding video reflections in a custom environment.#### [Related videos](\/documentation\/visionos\/building-an-immersive-media-viewing-experience#Related-videos)\n\n[ Enhance the immersion of media viewing in custom environments ](https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10115)[ Create custom environments for your immersive apps in visionOS ](https:\/\/developer.apple.com\/videos\/play\/wwdc2024\/10087)",
  "sections" : [
    {
      "content" : "",
      "title" : "Overview"
    },
    {
      "content" : "",
      "title" : "Define a video docking location"
    },
    {
      "content" : "",
      "title" : "Enhance the realism of your scene with reflections"
    },
    {
      "content" : "",
      "title" : "Define the virtual scene lighting"
    },
    {
      "content" : "",
      "title" : "Enhance audio immersion"
    },
    {
      "content" : "",
      "title" : "Specify content brightness and surroundings effects"
    },
    {
      "content" : "",
      "title" : "Present a custom scene in the environment picker"
    },
    {
      "content" : "",
      "title" : "See Also"
    }
  ],
  "source" : "appleWebKit",
  "title" : "Building an immersive media viewing experience | Apple Developer Documentation",
  "url" : "https:\/\/developer.apple.com\/documentation\/visionos\/building-an-immersive-media-viewing-experience"
}