{
  "abstract" : "Use RealityKit to create an interactive ride in visionOS.",
  "codeExamples" : [

  ],
  "contentHash" : "588081a92d5e8adff037df1cce76fbbc0c261f41736d243983ae413e2b9c55de",
  "crawledAt" : "2025-12-02T16:02:50Z",
  "id" : "121C3903-B47C-41BA-B062-541D8B34645B",
  "kind" : "struct",
  "overview" : "visionOS  Swift Splash  Swift Splash Sample CodeSwift SplashUse RealityKit to create an interactive ride in visionOS. Download visionOS 26.0+Xcode 26.0+OverviewApple Vision Pro’s ability to combine virtual content seamlessly with the real world allows for many kinds of interactive virtual experiences. Swift Splash leverages RealityKit and Reality Composer Pro to create a virtual water slide by combining modular slide pieces. When the builder finishes their ride, they can release an adventurous goldfish to try it out.\n\nSwift Splash uses multiple Reality Composer Scenes to create prepackaged entity hierarchies that represent each of the slide pieces the player connects to construct their ride. It demonstrates how to hide and reveal sections of the entity hierarchy based on the current state of the app. For example, each slide piece contains an animated fish entity that’s hidden until the ride runs and the fish arrives at that particular piece. While Swift Splash is a fun, game-like experience, the core idea of assembling virtual objects out of predefined parts can also be used as the basis for a productivity or creation app.\n\nSwift Splash scenes include Shader Graph materials built in Reality Composer Pro to change the appearance of the ride at runtime. Each piece can be configured to display in one of three materials: metal, wood, or plastic. Other Shader Graph materials create special effects, such as the movement of the water and the flashing lights on the start and end pieces. Even particle effects are included in some of these prepackaged entities, such as the fireworks that play when the goldfish crosses the finish line.",
  "rawMarkdown" : "---\nsource: https:\/\/developer.apple.com\/documentation\/visionos\/swift-splash\ncrawled: 2025-12-02T16:02:49Z\n---\n\n# Swift Splash | Apple Developer Documentation\n\n- [ visionOS ](\/documentation\/visionos)\n\n- [ Swift Splash ](\/documentation\/visionos\/swift-splash)\n\n-  Swift Splash \n\nSample Code# Swift Splash\n\nUse RealityKit to create an interactive ride in visionOS.[ Download ](https:\/\/docs-assets.developer.apple.com\/published\/ace0eae5beca\/SwiftSplash.zip)visionOS 26.0+Xcode 26.0+## [Overview](\/documentation\/visionos\/swift-splash#Overview)\n\nApple Vision Pro’s ability to combine virtual content seamlessly with the real world allows for many kinds of interactive virtual experiences. Swift Splash leverages RealityKit and Reality Composer Pro to create a virtual water slide by combining modular slide pieces. When the builder finishes their ride, they can release an adventurous goldfish to try it out.\n\n Video with custom controls.  Content description: TBD [ Play ](#)Swift Splash uses multiple Reality Composer Scenes to create prepackaged entity hierarchies that represent each of the slide pieces the player connects to construct their ride. It demonstrates how to hide and reveal sections of the entity hierarchy based on the current state of the app. For example, each slide piece contains an animated fish entity that’s hidden until the ride runs and the fish arrives at that particular piece. While Swift Splash is a fun, game-like experience, the core idea of assembling virtual objects out of predefined parts can also be used as the basis for a productivity or creation app.\n\nSwift Splash scenes include Shader Graph materials built in Reality Composer Pro to change the appearance of the ride at runtime. Each piece can be configured to display in one of three materials: metal, wood, or plastic. Other Shader Graph materials create special effects, such as the movement of the water and the flashing lights on the start and end pieces. Even particle effects are included in some of these prepackaged entities, such as the fireworks that play when the goldfish crosses the finish line.\n\n Video with custom controls.  Content description: TBD [ Play ](#) Video with custom controls.  Content description: TBD [ Play ](#)### [Build slide pieces in Reality Composer Pro](\/documentation\/visionos\/swift-splash#Build-slide-pieces-in-Reality-Composer-Pro)\n\nSlide pieces are the building blocks of Swift Splash. The Reality Composer project contains a separate scene for each one. In addition to the 3D models that make up the slide piece, each scene contains a number of other entities the app uses to animate and place the slide piece.\n\nIn the hierarchy viewer on the left side of the screenshot above, there are two transform entities called `connect_in` and `connect_out`. These transforms mark the points where the slide piece connects to the next or previous piece. Swift Splash uses these transforms to place new pieces at the end of the existing slide, as well as to snap pieces to other slide pieces when you manually move them near each other.\n\nSlide pieces demonstrate the two primary mechanisms Swift Splash uses to find entities at runtime. For some entities, such as `connect_in`, Swift Splash uses a naming convention and retrieves the entities by name or suffix when it needs to use them. In other cases, such as when names aren’t unique or the retrieving code needs configuration values, Swift Splash uses a custom component to mark and retrieve entities.\n\nFor example, animated entities that appear when the ride runs contain a component called `RideAnimationComponent`. The app uses this component to determine if the entity is an animation that plays while the ride is running. The component also stores additional state the app needs to implement the ride animation, such as a property called `duration` that specifies when to start the animations on the next connected slide piece.\n\n`RideAnimationComponent` also includes a property called `isPersistent`. Persistent ride animations stay visible at all times but only animate when the ride is running, such as the animated door on the start piece. Nonpersistent ride animations, such as the fish swimming through a slide piece, display only while the ride is running and the fish swims through that particular piece.\n\n### [Avoid duplicate materials with material references](\/documentation\/visionos\/swift-splash#Avoid-duplicate-materials-with-material-references)\n\nMany of Swift Splash’s slide pieces use the same materials. For example, the shader graph material that changes pieces from metal to wood to plastic is shared by all but one of the slide pieces. To avoid having duplicate copies of each material, Swift Splash leverages USD *material references* to share materials between multiple entities in multiple scenes.\n\nThe Reality Composer Pro project contains a separate scene for each shared material, containing only that one material. Other track pieces create references to that material. If you change the original material, it affects all of the entities that reference it. For example, a scene called `M_RainbowLights.usda` contains the material `M_RainbowLights`, and both `StartPiece.usda` and `EndPiece.usda` reference that material.\n\n### [Parallelize the asset load](\/documentation\/visionos\/swift-splash#Parallelize-the-asset-load)\n\nTo maximize load speed and make the most efficient use of available compute resources, Swift Splash parallelizes loading scenes from the Reality Composer project using a [`TaskGroup`](\/documentation\/Swift\/TaskGroup). The app creates a separate [`Task`](\/documentation\/Swift\/Task) for each of the scenes it needs to load.\n\n\n\n```\nawait withTaskGroup(of: LoadResult.self) { taskGroup in   \n    \/\/ Load the regular slide pieces and ride animations.\n    logger.info(\"Loading slide pieces.\")\n    for piece in pieces {\n        taskGroup.addTask {\n            do {\n                guard let pieceEntity = try await self.loadFromRCPro(named: piece.key.rawValue, \n                                                       fromSceneNamed: piece.sceneName) else {\n                    fatalError(\"Attempted to load piece entity (piece.name) but failed.\")\n                }\n                return LoadResult(entity: pieceEntity, key: piece.key.rawValue)\n            } catch {\n                fatalError(\"Attempted to load (piece.name) but failed: (error.localizedDescription)\")\n            }\n        }\n    }\n    \/\/ Continue adding asset load jobs.\n    \/\/ ...\n}\n\n```\n\nThe app then uses an async iterator to wait for and receive the results.\n\n\n\n```\nfor await result in taskGroup {\n    if let pieceKey = pieces.filter({ piece in\n        piece.key.rawValue == result.key\n    }).first {\n        self.add(template: result.entity, for: pieceKey.key)\n        setupConnectible(entity: result.entity)\n        result.entity.generateCollisionShapes(recursive: true)\n        result.entity.setUpAnimationVisibility()\n    }\n    \/\/ ...\n}\n\n```\n\nFor more information on task groups, see [Concurrency](https:\/\/docs.swift.org\/swift-book\/LanguageGuide\/Concurrency.html) in [The Swift Programming Language](https:\/\/docs.swift.org\/swift-book\/).\n\nEach of these loaded pieces acts as a template. When the player adds a new piece of that type, the app clones the piece loaded from Reality Composer Pro and adds the clone to the scene.\n\n### [Specify sort ordering for transparent entities](\/documentation\/visionos\/swift-splash#Specify-sort-ordering-for-transparent-entities)\n\nWhen multiple entities have more than one overlapping, nonopaque material, RealityKit’s default depth-sorting can cause it to draw those entities in the wrong order. As a result, some entities may not be visible from certain angles or in certain positions relative to other transparent entities. The default depth sorting is based on the center of the entity’s bounding box, which may result in the incorrect drawing order when there are multiple overlapping materials with any amount of transparency. You can see an example of this by looking at the start piece in Reality Composer Pro, or by watching the video below.\n\n Video with custom controls.  Content description: A video demonstrating showing the Swift Splash start piece being pivoted up and down causing the water to disappear and reappear. [ Play ](#)The following video demonstrates the problem. If the three boxes are the bounding boxes for three different transparent entities, and the small spheres are the box centers, the sphere that’s closest to the camera changes as the camera moves around the boxes, which changes the order that RealityKit’s default depth sorting algorithm draws them.\n\n Video with custom controls.  Content description: A video showing three overlapping boxes with a dot marking their center. As they move around, which dot is closest to the viewer changes [ Play ](#) Video with custom controls.  Content description: A video showing three overlapping boxes with a dot marking their center. As they move around, which dot is closest to the viewer changes [ Play ](#)Swift Splash assigns a [`ModelSortGroupComponent`](\/documentation\/RealityKit\/ModelSortGroupComponent) to each of the transparent entities to manually specify the relative depth sorting. To fix the transparency issues in the start piece in the video above, Swift Splash instructs RealityKit to draw the opaque parts of the fish first, its transparent goggles second, the water third, the glass globe fourth, and the selection glow shell last. Swift Splash does this by assigning a [`ModelSortGroupComponent`](\/documentation\/RealityKit\/ModelSortGroupComponent) to each of the overlapping entities using the same [`ModelSortGroup`](\/documentation\/RealityKit\/ModelSortGroup), but with a different order specified.\n\n\n\n```\nfileprivate func setEntityDrawOrder(_ entity: Entity, _ sortOrder: Int32, _ sortGroup: ModelSortGroup) {\n    entity.forEachDescendant(withComponent: ModelComponent.self) { modelEntity, model in\n        logger.info(\"Setting sort order of (sortOrder) of (entity.name), child entity: (modelEntity.name)\")\n        let component = ModelSortGroupComponent(group: sortGroup, order: sortOrder)\n        modelEntity.components.set(component)\n    }\n}\n\n\n\/\/\/ Manually specify sort ordering for the transparent start piece meshes.\nfunc handleStartPieceTransparency(_ startPiece: Entity) {\n    let group = ModelSortGroup()\n    \n    \/\/ Opaque fish parts.\n    if let entity = startPiece.findEntity(named: fishIdleAnimModelName) {\n        setEntityDrawOrder(entity, 1, group)\n    }\n    if let entity = startPiece.findEntity(named: fishRideAnimModelName) {\n        setEntityDrawOrder(entity, 2, group)\n    }\n    \n    \/\/ Transparent fish parts.\n    if let entity = startPiece.findEntity(named: fishGlassIdleAnimModelName) {\n        setEntityDrawOrder(entity, 3, group)\n    }\n    if let entity = startPiece.findEntity(named: fishGlassRideAnimModelName) {\n        setEntityDrawOrder(entity, 4, group)\n    }\n    \n    \/\/ Water.\n    if let entity = startPiece.findEntity(named: sortOrderWaterName) {\n        setEntityDrawOrder(entity, 5, group)\n    }\n    \n    \/\/ Glass globe.\n    if let entity = startPiece.findEntity(named: sortOrderGlassGlobeName) {\n        setEntityDrawOrder(entity, 6, group)\n    }\n    \n    \/\/ Selection glow.\n    if let entity = startPiece.findEntity(named: startGlowName) {\n        setEntityDrawOrder(entity, 7, group)\n    }\n}\n\n```\n\n### [Traverse connected track pieces](\/documentation\/visionos\/swift-splash#Traverse-connected-track-pieces)\n\nThe root entity for all of the individual slide pieces has a `ConnectableComponent`. This custom component marks the entity as one that can be connected or snapped to other connectable entities. At runtime, the app adds a `ConnectableStateComponent` to each slide piece it adds. The component stores state information for the track piece that doesn’t need to be edited in Reality Composer Pro. Among the state information that this component stores is a reference to the next and previous piece.\n\n Video with custom controls.  Content description: TBD [ Play ](#)To iterate through the entire ride, ignoring any disconnected pieces, the app gets a reference to the start piece and then iterates until `nextPiece` is `nil`. This iteration, similar to iterating a linked list, repeats many times throughout the app. One example is the function that calculates the duration of the built ride by iterating through the individual pieces and adding up the duration of their animations.\n\n\n\n```\n\/\/\/ Calculates the duration of the built ride by summing up the individual durations.\npublic func calculateRideDuration() {\n    guard let startPiece = startPiece else { fatalError(\"No start piece found.\") }\n    var nextPiece: Entity? = startPiece\n    var duration: TimeInterval = 0\n    while nextPiece != nil {\n        \/\/ Some pieces have more than one ride animation. Use the longest one to calculate duration.\n        var longestAnimation: TimeInterval = 0\n        nextPiece?.forEachDescendant(withComponent: RideAnimationComponent.self) { entity, component in\n            longestAnimation = max(component.duration, longestAnimation)\n        }\n        duration += longestAnimation\n        nextPiece = nextPiece?.connectableStateComponent?.nextPiece\n    }\n    \/\/ Remove the part of the animation after the goal post.\n    rideDuration = duration  \/ animationSpeedMultiplier + 1.0\n}\n\n```\n\n### [Interact with the ride](\/documentation\/visionos\/swift-splash#Interact-with-the-ride)\n\nTo build and edit the ride, players interact with Swift Splash in two different ways. They interact with SwiftUI windows to perform certain tasks, such as adding a new piece or deleting an existing piece of the ride. They also manipulate slide pieces using standard visionOS gestures, including taps, double taps, drags, and rotates. The player taps on a piece to select or deselect it. When a player double taps a piece, they select that piece without deselecting any other selected pieces. When someone drags a piece, it moves around the immersive space, snapping together with other pieces if placed near one. A two-finger rotate gesture spins the selected track piece or pieces on the Z-axis.\n\n Video with custom controls.  Content description: TBD [ Play ](#)Add a ride piece Video with custom controls.  Content description: TBD [ Play ](#)Delete a ride piece Video with custom controls.  Content description: TBD [ Play ](#)Rotate a ride piece Video with custom controls.  Content description: TBD [ Play ](#)Drag a ride pieceSwift Splash handles all of these interactions using standard SwiftUI gestures targeted to an entity. To support any of these gestures at any time, the app declares them using [`SimultaneousGesture`](\/documentation\/SwiftUI\/SimultaneousGesture). The code for all of the gestures are contained in `TrackBuildingView`, which controls the app’s immersive space. Here’s how the app defines the rotation gesture:\n\n\n\n```\n.simultaneousGesture(\n    RotateGesture()\n        .targetedToAnyEntity()\n        .onChanged({ value in\n            guard appState.phase == .buildingTrack || appState.phase == .placingStartPiece || appState.phase == .draggingStartPiece else { return }\n            handleRotationChanged(value)\n        })\n        .onEnded({ value in\n            guard appState.phase == .buildingTrack || appState.phase == .placingStartPiece || appState.phase == .draggingStartPiece else { return }\n            handleRotationChanged(value, isEnded: true)\n        })\n)\n\n```\n\nBecause multiple tap gestures on the same [`RealityView`](\/documentation\/RealityKit\/RealityView) execute with a different number of taps, multiple gestures may be called at once. If a player double taps an entity, for example, both the single tap and the double tap gesture code get called, and the app has to determine which one to execute. Swift Splash makes this determination by using a Boolean state variable. If a player single taps, it sets that variable — called `shouldSingleTap` — to `true`. Then it waits for a period of time before executing the rest of its code. If `shouldSingleTap` gets set to `false` while it’s waiting, the code doesn’t execute. When SwiftSplash detects a double tap gesture, it sets `shouldSingleTap` to `false`, preventing the single-tap code from firing when it executes the double-tap code.\n\n\n\n```\n.simultaneousGesture(\n    TapGesture()\n        .targetedToAnyEntity()\n        .onEnded({ value in\n            guard appState.phase == .buildingTrack else { return }\n            Task {\n                shouldSingleTap = true\n                try? await Task.sleep(for: .seconds(doubleTapTolerance))\n                if shouldSingleTap {\n\n```\n\n## [See Also](\/documentation\/visionos\/swift-splash#See-Also)\n\n#### [Related samples](\/documentation\/visionos\/swift-splash#Related-samples)\n\n[Hello World](\/documentation\/visionos\/world)Use windows, volumes, and immersive spaces to teach people about the Earth.[Happy Beam](\/documentation\/visionos\/happybeam)Leverage a Full Space to create a fun game using ARKit.[Destination Video](\/documentation\/visionos\/destination-video)Leverage SwiftUI to build an immersive media experience in a multiplatform app.[Diorama](\/documentation\/visionos\/diorama)Design scenes for your visionOS app using Reality Composer Pro.#### [Related articles](\/documentation\/visionos\/swift-splash#Related-articles)\n\n[Adding 3D content to your app](\/documentation\/visionos\/adding-3d-content-to-your-app)Add depth and dimension to your visionOS app and discover how to incorporate your app’s content into a person’s surroundings.[Understanding the modular architecture of RealityKit](\/documentation\/visionos\/understanding-the-realitykit-modular-architecture)Learn how everything fits together in RealityKit.[Composing interactive 3D content with RealityKit and Reality Composer Pro](\/documentation\/RealityKit\/composing-interactive-3d-content-with-realitykit-and-reality-composer-pro)Build an interactive scene using an animation timeline.[Implementing systems for entities in a scene](\/documentation\/RealityKit\/implementing-systems-for-entities-in-a-scene)Apply behaviors and physical effects to the objects and characters in a RealityKit scene with the Entity Component System (ECS).[Creating USD files for Apple devices](\/documentation\/USD\/creating-usd-files-for-apple-devices)Generate 3D assets that render as expected.#### [Related videos](\/documentation\/visionos\/swift-splash#Related-videos)\n\n[ Meet Reality Composer Pro ](https:\/\/developer.apple.com\/videos\/play\/wwdc2023\/10083)[ Explore materials in Reality Composer Pro ](https:\/\/developer.apple.com\/videos\/play\/wwdc2023\/10202)[ Work with Reality Composer Pro content in Xcode ](https:\/\/developer.apple.com\/videos\/play\/wwdc2023\/10273)[ Build spatial experiences with RealityKit ](https:\/\/developer.apple.com\/videos\/play\/wwdc2023\/10080)[ Enhance your spatial computing app with RealityKit ](https:\/\/developer.apple.com\/videos\/play\/wwdc2023\/10081)[ Build great games for spatial computing ](https:\/\/developer.apple.com\/videos\/play\/wwdc2023\/10096)",
  "sections" : [
    {
      "content" : "",
      "title" : "Overview"
    },
    {
      "content" : "",
      "title" : "See Also"
    }
  ],
  "source" : "appleWebKit",
  "title" : "Swift Splash | Apple Developer Documentation",
  "url" : "https:\/\/developer.apple.com\/documentation\/visionos\/swift-splash"
}