{
  "abstract" : "Update your apps to use new features, and test your apps against changes.",
  "codeExamples" : [

  ],
  "contentHash" : "ea35168506cc23550192a88af02411389b35ef3a0ad478d8322ebe85f8fa7198",
  "crawledAt" : "2025-12-03T04:56:16Z",
  "id" : "7C5E78F7-F928-441D-851B-02651F05BED4",
  "kind" : "article",
  "language" : "swift",
  "overview" : "## Overview\n\nRead these notes when you’re building interfaces in Xcode 10.\n\n### New Features\n\n### Known Issues\n\n### Resolved Issues",
  "rawMarkdown" : "---\nsource: https:\/\/developer.apple.com\/documentation\/Xcode-Release-Notes\/interface-builder-release-notes-for-xcode-10\ncrawled: 2025-12-03T04:56:16Z\n---\n\n# Interface Builder Release Notes for Xcode 10\n\n**Article**\n\nUpdate your apps to use new features, and test your apps against changes.\n\n## Overview\n\nRead these notes when you’re building interfaces in Xcode 10.\n\n### New Features\n\n- Resizing a [doc:\/\/com.apple.documentation\/documentation\/UIKit\/UIStackView] or [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSStackView] along its distribution axis in the canvas will adjust spacing between items. (21166308)\n- Control-dragging from Interface Builder to a Swift source file defaults to creating `@IBOutlet` when the insertion point is above the first method in a class, and `@IBAction` otherwise. (36891045)\n- Notification categories now have a “Handles Grouping” property, which allows notifications to be coalesced.\n- Static notification interfaces now support connecting a subtitle label outlet.\n- The “Stack” button in the canvas bar has been replaced with a pop-up menu containing all embedding options for the selection. (38201831)\n- The default colors for [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSTextField] and [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSTextView] have been changed. The new values are still appropriate for deployment on macOS 10.13 and earlier.\n- The menu for choosing a font family in the Attributes inspector now renders a preview of each font. (37157540)\n- The [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSVisualEffectView] class’s inherited appearance inspector property has a backwards deployment option of Vibrant Light or Vibrant Dark for previous versions of macOS. (40536518)\n- [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSVisualEffectView] will backwards deploy new standard semantic 10.14 materials to appropriate materials for prior OSes. (40511407)\n- On macOS 10.14, [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSToolbarItem] can center itself in an [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSToolbar] by checking “Is Centered Item” in the Attributes inspector.\n- An [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSToolbarItem] containing an image or custom view has an Automatic size option in the Size inspector. Use this option to automatically manage the minimum and maximum width and height of the toolbar item, for example when the item contains a segmented control.\n- Support for Large Title font text style ([doc:\/\/com.apple.documentation\/documentation\/UIKit\/UIFont\/TextStyle\/largeTitle]) on iOS 11 and later, and on watchOS 5. (33150633)\n- In the Identity inspector, the localization comment field has been changed to plain text. It is still stored in the document as an attributed string to maintain compatibility with earlier versions of Xcode. (39856810)\n- The exception “Impossible to set up layout with view hierarchy unprepared for constraint.” has improved diagnostics. (42514606)\n- New [doc:\/\/com.apple.documentation\/documentation\/UIKit\/UILabel] inspector property “Marquee on Ancestor Focus” for controlling scrolling behavior.\n- On macOS 10.14, [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSButton] and [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSImage] support content color tinting in the Attributes inspector. Tinting only applies to borderless buttons and template images.\n- The Editor > Embed In menu item allows embedding in a tightly wrapped view that doesn’t add any margins to the selected content. (11515741)\n- Inspector color pickers now use a standard pop-up button. The color swatch can be dragged by holding the Option key. (38582636)\n- Designable [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSView] subclasses are rendered with the appropriate NSAppearance for their use in the canvas.\n- The macOS library now contains an “Import From Device” menu item for Continuity Camera. Its submenu will be auto-populated at runtime on macOS 10.14 and higher; on previous versions, it will be disabled and have no submenu. (41474755)\n- The new Volume control for watchOS 5 now allows setting tint color. (40830006)\n- Opening a `.nib` or `.xib` file last saved in a format prior to Xcode 5 now prompts for confirmation, and automatically upgrades the document to a modern format. (37691996)\n- Support for the new Dynamic Interactive notification interfaces.\n- Scrolling performance, especially in very large storyboards, is improved. (34904204)\n- When a Mac XIB or storyboard is opened in Xcode 10, [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSTextView] that have default colors will be changed to use new recommended colors. The text color and insertion point color change from black to [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSColor\/textColor], and the background color changes from white to [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSColor\/textBackgroundColor]. These should appear the same on earlier releases while also adapting to appearances on macOS 10.14. Editable [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSTextField] instances have their text color changed from [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSColor\/textColor] to [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSColor\/controlTextColor]. These changes only apply when opening and saving the document from within Xcode.\n- Discouraged uses of Vibrant Light and Vibrant Dark appearance are now reported. [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSPopover] and [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSVisualEffectView] are exempted. (42036478)\n- Support for the new “Now Playing” and “Volume” interface objects.\n- Controls using named colors from an asset catalog now update as the value of the color changes. (37613468)\n- Image and color inspector properties that reference an asset catalog resource have a navigation button to jump to that resource. Option + click will show the resource in the Assistant Editor. (39661055)\n- Support for new [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSVisualEffectView] materials introduced in macOS 10.14.\n- Some binaries used by Interface Builder have been renamed for better consistency. Instead of “Interface Builder Cocoa Touch Tool”, “Interface Builder WatchKit Tool”, and “IBAppleTVTool”, they are now called “IBAgent-*[platform]*”. (35400833)\n- On macOS 10.14, the Device Bar and Preview assistant editor allow designing for and previewing in Light Appearance and Dark Appearance.\n- Support for [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSGridView], which manages Auto Layout constraints for its content in a two-dimensional table layout. [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSGridView] is backward deployable to macOS 10.12, or macOS 10.13.4 when using merged cells.\n- Canvas rendering now happens in parallel, and scales based on demand and hardware to improve the performance of edit operations, particularly for large scenes. (36999759)\n- Support for setting accessibility attributes on [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSWindow].\n- [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSTextView] has multiple entries in the object library. This separates configurations appropriate for user interface elements that should adapt to the system appearance, and document content which has a fixed appearance that does not change with the system setting, including for print content.\n\n### Known Issues\n\n- Displaying `NSOpenGLView` instances in Interface Builder when running on macOS 10.13 may result in a crash. (43849153)\n\n### Resolved Issues\n\n- Fixed an issue with rendering table view cells that are scrolled out of view at design time. (41213048)\n- Fixed a problem where issues for different objects were incorrectly coalesced. (13162286)\n- Fixed an issue where clicking a build issue wouldn’t select the referenced object in the canvas. (14779509)\n- Fixed a crash when viewing the Attributes inspector for an [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSLevelIndicatorCell] in a cell-based [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSTableView]. (39231884)\n- Fixed an issue where storyboard view controllers would change their relative placement unexpectedly while navigating between code and the Interface Builder canvas. (40925441)\n- Fixed an issue that would cause the view hierarchy to not render if the canvas area was scrolled before presenting the view hierarchy. (27635197)\n- Fixed an issue where connect-to-source mistakenly allowed adding code to Swift generated interfaces. (35263074)\n- When adding constraints with the control-drag canvas menu, shift-clicking on multiple items no longer requires clicking an “Add Constraints” menu item, simply clicking outside the menu now works. (22970158)\n- Improved performance compiling documents, particularly those containing multiple [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSComboBox] controls. (30468986)\n- `@IBDesignable` views now build using the new build system when it is enabled. (31433718)\n- Typing delete (⌫) when an edge is selected in the constraint filter of the Size inspector now removes the applicable constraints, rather than the view itself. (25373426)\n- Custom fonts are supported in watchOS dynamic notifications. (35843402)\n- Fixed an issue where `@IBDesignable` views would not build when the project includes a WatchKit target. (36281806)\n- Fixed a problem with scenes drawing blank when table view cells are scrolled beyond the [doc:\/\/com.apple.documentation\/documentation\/UIKit\/UITableView] bounds. (39338152)\n- When adding constraints with the control-drag canvas menu, shift-clicking on multiple items now adds them to the canvas instantly, rather than after the menu is closed. (18991966)\n- Embedding views in macOS documents now supports [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSVisualEffectView]. (39924232)\n\n## Release Notes\n\n- **Build System Release Notes for Xcode 10**: Update your apps to use new features, and test your apps against changes.\n- **Source Editor Release Notes for Xcode 10**: Update your programming workflow to use new features, and test your workflow against changes.\n- **Swift 4.2 Release Notes for Xcode 10**: Update your code to use new language features and test your apps against changes.\n\n",
  "sections" : [
    {
      "content" : "",
      "items" : [
        {
          "description" : "Update your apps to use new features, and test your apps against changes.",
          "name" : "Build System Release Notes for Xcode 10",
          "url" : "https:\/\/developer.apple.com\/documentation\/Xcode-Release-Notes\/build-system-release-notes-for-xcode-10"
        },
        {
          "description" : "Update your programming workflow to use new features, and test your workflow against changes.",
          "name" : "Source Editor Release Notes for Xcode 10",
          "url" : "https:\/\/developer.apple.com\/documentation\/Xcode-Release-Notes\/source-editor-release-notes-for-xcode-10"
        },
        {
          "description" : "Update your code to use new language features and test your apps against changes.",
          "name" : "Swift 4.2 Release Notes for Xcode 10",
          "url" : "https:\/\/developer.apple.com\/documentation\/Xcode-Release-Notes\/swift-4_2-release-notes-for-xcode-10"
        }
      ],
      "title" : "Release Notes"
    }
  ],
  "source" : "appleJSON",
  "title" : "Interface Builder Release Notes for Xcode 10",
  "url" : "https:\/\/developer.apple.com\/documentation\/Xcode-Release-Notes\/interface-builder-release-notes-for-xcode-10"
}