{
  "abstract" : "Update your apps to use new features, and test your apps against API changes.",
  "codeExamples" : [

  ],
  "contentHash" : "15f4087766f65dfc041c56ef6f87c1e301374061be4878f9aa28edba4b91d489",
  "crawledAt" : "2025-12-02T17:09:16Z",
  "id" : "D03AA2E1-45CC-4C94-8738-FE2F32A6AE12",
  "kind" : "collection",
  "language" : "swift",
  "overview" : "## Overview\n\nXcode 10.2 includes SDKs for iOS 12.2, watchOS 5.2, macOS 10.14.4, and tvOS 12.2. Xcode 10.2 supports on-device debugging for iOS 8 and later, tvOS 9 and later, and watchOS 2 and later. Xcode 10.2 requires a Mac running macOS 10.14.3 or later.\n\n### General\n\n#### New Features\n\n#### Resolved Issues\n\n### Apple Clang Compiler\n\n#### New Features\n\n#### Resolved Issues\n\n### Asset Catalog\n\n#### Resolved Issues\n\n### Build System\n\n#### New Features\n\n#### Known Issues\n\n#### Resolved Issues\n\n### Clang Static Analyzer\n\n#### Resolved Issues\n\n### Debugging\n\n#### New Features\n\n#### Resolved Issues\n\n### Documentation Viewer\n\n#### New Features\n\n### Instruments\n\n#### Known Issues\n\n### Interface Builder\n\n#### New Features\n\n#### Resolved Issues\n\n### Linking\n\n#### Resolved Issues\n\n### LLDB Debugger\n\n#### New Features\n\n#### Resolved Issues\n\n### Localization\n\n#### New Features\n\n#### Resolved Issues\n\n### Playgrounds\n\n#### New Features\n\n#### Resolved Issues\n\n### Refactoring\n\n#### Resolved Issues\n\n### Simulator\n\n#### Resolved Issues\n\n### Source Control\n\n#### New Features\n\n#### Resolved Issues\n\n### Source Editor\n\n#### New Features\n\n#### Resolved Issues\n\n### Swift\n\nSee [doc:\/\/com.apple.Xcode-Release-Notes\/documentation\/Xcode-Release-Notes\/swift-5-release-notes-for-xcode-10_2].\n\n### Testing\n\n#### New Features\n\n#### Known Issues\n\n#### Resolved Issues",
  "rawMarkdown" : "---\nsource: https:\/\/developer.apple.com\/documentation\/Xcode-Release-Notes\/xcode-10_2-release-notes\ncrawled: 2025-12-02T17:09:16Z\n---\n\n# Xcode 10.2 Release Notes\n\nUpdate your apps to use new features, and test your apps against API changes.\n\n## Overview\n\nXcode 10.2 includes SDKs for iOS 12.2, watchOS 5.2, macOS 10.14.4, and tvOS 12.2. Xcode 10.2 supports on-device debugging for iOS 8 and later, tvOS 9 and later, and watchOS 2 and later. Xcode 10.2 requires a Mac running macOS 10.14.3 or later.\n\n### General\n\n#### New Features\n\n- Xcode now supports downloading using macOS content caching. For information about macOS content caching, see [https:\/\/support.apple.com\/guide\/mac-help\/about-content-caching-on-mac-mchl9388ba1b\/mac]. (12926899)\n\n#### Resolved Issues\n\n- Resolved an issue where uploads to the App Store wouldn’t include symbol information. (46242083)\n\n### Apple Clang Compiler\n\n#### New Features\n\n- `-Watomic-implicit-seq-cst` is a new warning, off by default, that warns when C `_Atomic` or `__sync_*` are used with the implicit, sequentially-consistent ordering. Most codebases use sequential consistency by default, but some demand that developers use explicit ordering everywhere. This warning is for the latter group. (28172966)\n- A new diagnostic identifies framework headers that use quote includes instead of framework style includes. The warning is off by default but you can enable it by passing `-Wquoted-include-in-framework-header` to `clang`. (37077034)\n- `-Wmemset-transposed-args` is a new warning that diagnoses calls to `memset` that have the second and third arguments transposed. For example, the following call is diagnosed with the new warning: `memset(buf, sizeof(buf), 0)`. (42360478)\n- The constructors for `std::pair` are now marked `noexcept` conditionally on whether the corresponding constructors of its members are `noexcept`. This is a conforming extension that has potential performance benefits in case an operation can be made faster for types that don’t throw exceptions on construction. (29537079)\n- The warning for using a non-const callable predicate in a `std::map` or a `std::set` now shows the point of instantiation of the faulty container instead of an unrelated implementation detail. (41370747)\n- The `<experimental\/any>` and `<experimental\/optional>` headers are deprecated in favor of their C++17 counterparts: `<any>` and `<optional>`. They will be removed in a future release of Xcode, and you shouldn’t rely on their presence. (46903112)\n- The usage of inlining macros to control the visibility of symbols in libc++ headers has been removed in favor of a better solution. This should result in code size and performance improvements in code that includes libc++ headers, and a dramatic improvement of the debugging experience when using libc++. (47259325)\n- Public headers in a framework might mistakenly `#import` or `#include` private headers, which causes layering violations and potential module cycles. There’s a new diagnostic that reports such violations. It’s `OFF` by default in `clang` and is controlled by the `-Wframework-include-private-from-public`  flag. (38712182)\n- The use of `@import` in framework headers prevent headers being used without modules. A new diagnostic detects the use of `@import` in framework headers when you pass the `-fmodules` flag. The diagnostic is `OFF` by default in `clang` and is controlled using the `-Watimport-in-framework-header` flag. (39192894)\n- Previously, omitting the `framework` keyword when declaring a module for a framework didn’t affect compilation but silently did the wrong thing. A new diagnostic, `-Wincomplete-framework-module-declaration`, and a new fix-it suggests adding the appropriate keyword. This warning is on by default when you pass the `-fmodules` flag to `clang`. (39193062)\n\n#### Resolved Issues\n\n- Fixed a data race condition that occurred when checking whether a future has been attached to a promise in `std::async`. The issue was resolved for `std::async` returning a non-void future, however the issue remains for calls that return `std::future<void>`. (42548261)\n- Linking is successful even if Incremental LTO is enabled using `-flto=thin` when you invoke `clang` from the command line to compile and link in a single invocation. (47297739)\n- Inverted character classes in `std::regex`, such as `[\\S]`, are now handled correctly. (43060054)\n- `dsymutil` no longer exhausts system memory on large projects. (41422573)\n\n### Asset Catalog\n\n#### Resolved Issues\n\n- Resolved an issue that affected app compatibility with iOS 9.0, 9.1, and 9.2 when distributing an app for local or enterprise distribution. App asset catalogs built using Xcode 10 with a deployment target of iOS 9.0, 9.1 or 9.2 produced content incompatible with the runtimes of those iOS versions when distributed using local or enterprise distribution. Rebuilding the app with Xcode 10.2 resolves this issue. (46893768, 44535967)\n- Image slicing mode is improved in Dark Mode. (39388416)\n\n### Build System\n\n#### New Features\n\n- Implicit Dependencies now supports finding dependencies in Other Linker Flags for linked frameworks and libraries specified with `-framework`, `-weak_framework`, `-reexport_framework`, `-lazy_framework`, `-weak-l`, `-reexport-l`, `-lazy-l`, and `-l`. (7879587)\n\n#### Known Issues\n\n- If you’re building a framework containing Swift code and using `lipo` to create a binary that supports both device and simulator platforms, you must also combine the generated `Framework-Swift.h` headers for each platform to create a header that supports both device and simulator platforms. (48635615)\n\nFor example, if you’ve built:\n\n- `iOS\/Framework.framework`\n- `iOS Simulator\/Framework.framework`\n\nTake:\n- `iOS\/Framework.framework\/Headers\/Framework-Swift.h`\n- `iOS Simulator\/Framework.framework\/Framework-Swift.h`\n\nCreate a new:\n- `iOS + iOS Simulator\/Framework.framework\/Headers\/Framework-Swift.h`\n\nThe contents of the new `Framework-Swift.h` should be:\n\n```objc\n#if TARGET_OS_SIMULATOR\n<contents of original iOS Simulator\/Framework.framework\/Framework-Swift.h>\n#else\n<contents of original iOS\/Framework.framework\/Framework-Swift.h>\n#endif\n```\n\n#### Resolved Issues\n\n- External targets are properly ordered when used as a target dependency. (44775299)\n- Resolved an issue that caused Xcode to process PNG and JPEG files as TIFF files when the `COMBINE_HIDPI_IMAGES` and `APPLY_RULES_IN_COPY_FILES` settings were enabled. (44623214)\n- The `OTHER_INPUT_FILE_FLAGS` build setting—which propagates custom flags for source files—is now available to custom rule scripts when using the new build system. (46067251)\n- A recursive inclusion cycle in `.xcconfig` files no longer crashes the build system. (42023748)\n- Per-file flags defined for Core Data model files in a target build phase are now passed to the Core Data compiler. (42919919)\n\n### Clang Static Analyzer\n\n#### Resolved Issues\n\n- The static analyzer now warns when a C++ object is used after its contents are moved unless the object is reset to a known state before it’s used. (41349073)\n- The static analyzer now checks for violations of IOKit and libkern reference counting rules. These violations can lead to leaks and use-after-free issues. (46359592)\n\n### Debugging\n\n#### New Features\n\n- [doc:\/\/com.apple.documentation\/documentation\/UIKit\/UIStackView] properties are now presented in the view debugger object inspector. (36351873)\n- Xcode can now automatically capture a memory graph if a memory resource exception is encountered while debugging. You can enable memory graph captures in the Diagnostics tab of the scheme’s run settings. (45285932)\n- On iOS and watchOS, Xcode shows the memory limit for running apps in the Memory Report as you approach the limit. Use Instruments and Xcode Memory Debugging to optimize your app to have the smallest possible memory footprint. (40556954)\n- The view debugger presents a more compact 3D layout. (43523921)\n\n#### Resolved Issues\n\n- The speed of showing disassembly in the Assistant Editor is improved. (31633031)\n\n### Documentation Viewer\n\n#### New Features\n\n- Documentation for symbols can be filtered by SDK availability, introduced version, and deprecation. Documentation can also be filtered to show only articles or sample code. For example, you can filter the documentation to show all of the sample code in a framework like UIKit. (45236860)\n\n### Instruments\n\n#### Known Issues\n\n- Instruments may crash when you profile Swift code in a watchOS app. (47368181)\n\n### Interface Builder\n\n#### New Features\n\n- Double-clicking in a storyboard no longer zooms. Instead, zoom using a pinch gesture on the trackpad or hold Option and scroll. (29139870)\n- Interface Builder for Apple TV supports user interface elements exposed by the [doc:\/\/com.apple.documentation\/documentation\/TVUIKit] framework. (35868606)\n\n#### Resolved Issues\n\n- Fixed a crash that could occur when checking the “Bind to” checkbox in the Bindings inspector after reopening a storyboard. (33348238)\n- The rotate button in the Interface Builder preview is visible in Dark Mode. (42396497)\n- Actions in Swift files are now correctly parsed by Interface Builder when annotated with `@objc @IBAction`. (25465675)\n- Images with an alignment rectangle specified in the asset catalog correctly render in the Interface Builder canvas. (46595020)\n- Improved the intrinsic size of images in 2x and 3x slots in the Interface Builder canvas if the file name inside the asset catalog doesn’t end in `@2x` or `@3x`. (44759471)\n- Changes to [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSImageView] made using the inspector are now reliably reflected in the canvas without a delay. (30196881)\n- `ibtool --export-string-file` includes localizer hints that are specified on controls with instances of [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSCell]. (24421623)\n- Resolved an issue that caused images to display as question marks in storyboards. (42475635)\n- Images rendered in the Interface Builder canvas render with the scale factor matching the chosen device. (18703159)\n- Images marked with the template rendering mode in the asset catalog correctly render in the Interface Builder canvas. (29049562)\n\n### Linking\n\n#### Resolved Issues\n\n- Swift libraries are now found in the `dyld` cache when the main project isn’t written in Swift. (48385698)\n- Resolved an issue that caused linker errors to display in the issue navigator as “Linker command failed with exit code 1” rather than displaying the actual error message. (39141740)\n\n### LLDB Debugger\n\n#### New Features\n\n- You can now use `$0`, `$1`, … shorthands in LLDB expression evaluation inside closures. (20719448)\n- C variable length arrays are now supported in LLDB. (39606394)\n- The LLDB debugger has a new command alias, `v`, for the “frame variable” command to print variables in the current stack frame. Because it bypasses the expression evaluator, `v` can be a lot faster and should be preferred over `p` or `po`. (40066460)\n\n#### Resolved Issues\n\n- The debugger now resolves the type of generic variables that are bound to private types. (38231646)\n- Using `po` in Swift while debugging a watchOS app now returns correct results. (47162433)\n- Generic variables in inlined generic contexts are now correctly supported by the debugger. (28859432)\n- Data formatters for Swift dictionaries and sets are more reliable. (43045289)\n\n### Localization\n\n#### New Features\n\n- Opening a project that uses any deprecated localization identifiers now produces a warning for each one used. Selecting one of these warnings presents an assistant for migrating files in the associated legacy “lproj” directories to “lproj” directories named for the equivalent modern identifier. If necessary, this process also updates the project’s development region to a modern identifier. Migrated projects are compatible with older versions of Xcode. (9777671)\n- You can now export and import localizations for a project’s development region. (41878212)\n\n#### Resolved Issues\n\n- Xcode now more carefully distinguishes between legacy localization identifiers such as “English” and modern localization identifiers such as “en” and represents them both in both project files and the user interface. (45469882)\n- Enabling Base Internationalization is recommended for all projects, and any projects that don’t currently use Base Internationalization are offered an upgrade even if they only have a single localization. The upgraded projects are backward-compatible with previous releases of Xcode. (15160454)\n- You can now add localizations to a project that doesn’t have any localizable files, and you aren’t prompted for files to copy to the new localization. (42771349)\n\n### Playgrounds\n\n#### New Features\n\n- Playgrounds now perform memory safety checks at runtime. Code that violates exclusive access to memory traps with the diagnostic message: “Simultaneous accesses to […], but modification requires exclusive access.” ([https:\/\/bugs.swift.org\/browse\/SR-8126]) (33820622)\n\nFor more information, see [https:\/\/docs.swift.org\/swift-book\/LanguageGuide\/MemorySafety.html] in [https:\/\/docs.swift.org\/swift-book].\n\n#### Resolved Issues\n\n- Resolved an issue that prevented playgrounds from executing. (47226381)\n- Fixed a crash that could occur when editing playgrounds that use auxiliary sources. (42097728)\n- Fixed a crash that could occur when editing snippets that contain placeholders. (43242401)\n- Fixed an issue that could prevent changes in Interface Builder documents from being reflected in a playground without closing the workspace window. (46830864)\n\n### Refactoring\n\n#### Resolved Issues\n\n- The rename refactoring now correctly renames functions that take a single parameter with an external argument label, and that have a call site that passes the corresponding argument as a trailing closure. (42162571)\n- Using Refactoring > Rename to rename a document now updates the app’s `Info.plist` file to match. (41327509)\n\n### Simulator\n\n#### Resolved Issues\n\n- Improved the performance and responsiveness of interactions with simulated devices. (47864185)\n- Resolved an issue that prevented booting a simulated device on a Mac with a large number of simulated devices. (47712686)\n- Resolved a failure that occurred when dragging multiple contact, photo, or video items onto a simulated device window at the same time. (46736098)\n- Pasteboard synchronization between macOS and simulated iOS devices is more reliable. (46817121)\n- You’re now only prompted once to authorize microphone access to all simulator devices. (45715977)\n- Performance and responsiveness when interacting with simulated iPhone XR devices has been improved. (44657262)\n\n### Source Control\n\n#### New Features\n\n- Xcode uses SSH configuration output to determine which SSH key pair should be used for authenticating a given remote repository. (47302670)\n\n#### Resolved Issues\n\n- Xcode now supports the use of SSH private keys in the OpenSSH format in addition to the PEM format for connecting to Git servers. (40867126)\n- Resolved an issue that caused keychain lookups for an SSH key passphrase to fail. (47578552)\n\n### Source Editor\n\n#### New Features\n\n- The “Fold Methods & Functions” editor menu item folds computed properties in Swift. (43428274)\n- Code completion offers `get`, `set`, `didSet`, and `willSet` as possible completions inside computed property declarations. (20957182)\n- In the context of an optional enumeration type, code completion suggests the enumeration’s cases in addition to [doc:\/\/com.apple.documentation\/documentation\/Swift\/Optional\/none] and [doc:\/\/com.apple.documentation\/documentation\/Swift\/Optional\/some(_:)]. (23549753)\n\n#### Resolved Issues\n\n- Code completion doesn’t suggest duplicated delegate method names when overriding [doc:\/\/com.apple.documentation\/documentation\/UIKit\/UITableViewController] methods. (21161476)\n- Fix-its that reference different files won’t apply to the current file. (31371021)\n- Text being dragged is shown as a transparent image. (31890166)\n- The source editor now uses the system accent color for placeholders. (32307338)\n- The editor won’t fill in a placeholder when typing a newline character directly before the placeholder. (32853933)\n- Fixed a crash in Swap with Mark if the line containing the mark had been edited. (41874263)\n- Improved typing and scrolling performance in the editor when the folding ribbon is turned on. (42941556)\n- Fixed the consistency of line wrapping. (44520372)\n- Fixed a crash that occurred when showing three assistant editors. (45230485)\n- Fixed a crash that occurred when entering a newline with multiple cursors. (45601228)\n- Improved the speed of scrolling a source file with folded code when line wrapping is turned off. (45712602)\n- Improved the display of warnings and issues when using dark themes. (44925116)\n- Find and Replace using a pattern token replaces the matched text with the replacement text instead of the regular expression of the pattern token. (35439088)\n- Resolved issue that caused a text find to also perform the same find in background windows. (38269600)\n- Jump to Definition now navigates to the definition of a symbol when the cursor is at the end of that symbol. (33203746)\n- Highlighting many instances of the same symbol is faster. (40698496)\n- Fixed a crash in Redo with whitespace trimming enabled. (41519769)\n- Resolved an issue that caused source code colors to flash during a build. (42749446)\n- Jump to Definition displays the file name when listing items from generated system headers. (43581521)\n- Fixed crash when that occurred when editing code during the code folding animation. (44555624)\n- Resolved a crash that occurred when using Behaviors > File > Unlock > Run script. (44826462)\n\n### Swift\n\nSee [doc:\/\/com.apple.Xcode-Release-Notes\/documentation\/Xcode-Release-Notes\/swift-5-release-notes-for-xcode-10_2].\n\n### Testing\n\n#### New Features\n\n- `xccov` supports merging multiple coverage reports—and their associated archives—together into an aggregate report and archive. When merging reports together, the aggregate report may be inaccurate for source files that changed in between the time that the original reports were generated. If there were no source changes, the aggregate report and archive will be accurate. For more information, see the `xccov` manual page. (38050969)\n- `xccov` now supports diffing Xcode coverage reports, which can be used to calculate coverage changes over time. For example, to diff the coverage reports `before.xccovreport` and `after.xccovreport`, invoke `xccov` as follows: `xccov diff --json before.xccovreport after.xccovreport`. For more information about the format of the diff, see the `xccov` manual page. (43439165)\n- Static library and framework targets now appear in the coverage report as top-level entries, with line coverage values that are aggregated across all targets that include the static library or framework. This also resolves an issue where the source files for a static library or framework target would be included in the coverage report even if the target itself was excluded from code coverage in the scheme. (22578123)\n\n#### Known Issues\n\n- Swift initializers appear in the coverage report with no name. (47467864)\n- Recording doesn’t work from Clones when Parallelization is on. (43699252)\n- The wrong test host app is chosen for a test target when there are multiple test host targets with the same `PRODUCT_NAME`. (46475115)\n- Profiling tests don’t behave correctly when test parallelization is enabled. (44836817)\n\n**Workaround:** Disable parallel testing while profiling by navigating to Product > Scheme > Edit Scheme > Test > Info, selecting Options next to your test target, and disabling “Execute in parallel”.\n\n#### Resolved Issues\n\n- Resolved an issue that caused methods in a Swift source file to be named “Definition at **:**” in the coverage report. (46432533)\n- [doc:\/\/com.apple.documentation\/documentation\/XCTest\/XCUIScreen] now properly implements `isEqual:` and `hash`. (32179407)\n- When clicking the source editor gem for a test method or class that’s present in more than one test target, or for a test method that’s inherited by subclasses, Xcode now shows a menu that allows choosing an individual target or class (or all) to run the selected tests in. (45975871)\n- Resolved an issue that could prevent expanding a file in the coverage report view. (44458167)\n- If a test bundle can’t be loaded during testing for some reason—such as a runtime linking failure—Xcode now reports a descriptive error message that describes the cause of the failure. This failure is present in the test activity log and appears in `stdout` if you’re using `xcodebuild`. The error is also present in the structured logs contained in the result bundle. (45242409)\n- If testing fails due to the test runner crashing on launch, Xcode attempts to generate a rich error message that describes the failure. This failure is present in the test activity log and appears in `stdout` if you’re using `xcodebuild`. The error is also present in the structured logs contained in the result bundle. (29148418)\n- If `xcodebuild` is terminated by a `SIGINT` signal while tests are running, a valid result bundle is written to disk and contains the results from the tests that completed before the termination. Similarly, if you cancel running tests in Xcode, a valid result bundle is generated that contains the results of the already-completed tests. (45022325)\n- Second instances of `xcodebuild` or Xcode don’t delete simulator clones created during parallel distributed testing. (40738122)\n- Test targets that don’t specify a test host app and use the `xctest` command line tool to run tests now honor customized language and region settings in a scheme’s Test action. (43139603)\n- Resolved an issue that could cause incorrect code coverage for a file included in multiple targets. (40409346)\n- Crash reports collected during testing no longer omit important fields such as the termination reason and description. (44405884)\n- Headers that aren’t explicitly included in a target’s Headers Build Phase no longer appear in the target’s entry in the coverage report. This resolves an issue where unwanted headers could appear in the coverage report for a target—such as from a linked framework or library. If you notice that a coverage report is missing headers, make sure they’re included in the corresponding target’s Headers Build Phase. (36187447)\n- Projects with multiple test targets that each contain a test class that inherits from a shared [doc:\/\/com.apple.documentation\/documentation\/XCTest\/XCTestCase] subclass no longer show nonexistent runtime (“rT”) tests for test methods from other targets. (46042417)\n\n## Release Notes\n\n- **Swift 5 Release Notes for Xcode 10.2**: Update your code to use new language features and test your apps against changes.\n\n## Xcode 10\n\n- **Xcode 10.3 Release Notes**: Update your apps to use new features, and test your apps against API changes.\n- **Xcode 10.2.1 Release Notes**: Update your apps to use new features, and test your apps against API changes.\n- **Xcode 10.1 Release Notes**: Update your apps to use new features, and test your apps against API changes.\n- **Xcode 10 Release Notes**: Update your apps to use new features, and test your apps against API changes.\n\n",
  "sections" : [
    {
      "content" : "",
      "items" : [
        {
          "description" : "Update your code to use new language features and test your apps against changes.",
          "name" : "Swift 5 Release Notes for Xcode 10.2",
          "url" : "https:\/\/developer.apple.com\/documentation\/Xcode-Release-Notes\/swift-5-release-notes-for-xcode-10_2"
        }
      ],
      "title" : "Release Notes"
    },
    {
      "content" : "",
      "items" : [
        {
          "description" : "Update your apps to use new features, and test your apps against API changes.",
          "name" : "Xcode 10.3 Release Notes",
          "url" : "https:\/\/developer.apple.com\/documentation\/Xcode-Release-Notes\/xcode-10_3-release-notes"
        },
        {
          "description" : "Update your apps to use new features, and test your apps against API changes.",
          "name" : "Xcode 10.2.1 Release Notes",
          "url" : "https:\/\/developer.apple.com\/documentation\/Xcode-Release-Notes\/xcode-10_2_1-release-notes"
        },
        {
          "description" : "Update your apps to use new features, and test your apps against API changes.",
          "name" : "Xcode 10.1 Release Notes",
          "url" : "https:\/\/developer.apple.com\/documentation\/Xcode-Release-Notes\/xcode-10_1-release-notes"
        },
        {
          "description" : "Update your apps to use new features, and test your apps against API changes.",
          "name" : "Xcode 10 Release Notes",
          "url" : "https:\/\/developer.apple.com\/documentation\/Xcode-Release-Notes\/xcode-10-release-notes"
        }
      ],
      "title" : "Xcode 10"
    }
  ],
  "source" : "appleJSON",
  "title" : "Xcode 10.2 Release Notes",
  "url" : "https:\/\/developer.apple.com\/documentation\/Xcode-Release-Notes\/xcode-10_2-release-notes"
}