{
  "abstract" : "Respond to and recover from errors.",
  "codeExamples" : [

  ],
  "contentHash" : "c481fc7967cf22ffbaa8abd9c701ab33a5bb3a03ac50c3c8ec9224ad2afcf0ac",
  "crawledAt" : "2025-12-02T19:37:49Z",
  "declaration" : {
    "code" : "enum VendingMachineError: Error {\n    case invalidSelection\n    case insufficientFunds(coinsNeeded: Int)\n    case outOfStock\n}",
    "language" : "swift"
  },
  "id" : "A1E7B4B6-3043-4F77-AEC0-03340539B3D8",
  "kind" : "protocol",
  "overview" : "The Swift Programming Language (6.2.1)  Error Handling  Error Handling Error HandlingRespond to and recover from errors.Error handling is the process of responding to and recovering from error conditions in your program. Swift provides first-class support for throwing, catching, propagating, and manipulating recoverable errors at runtime.\n\nSome operations aren’t guaranteed to always complete execution or produce a useful output. Optionals are used to represent the absence of a value, but when an operation fails, it’s often useful to understand what caused the failure, so that your code can respond accordingly.\n\nAs an example, consider the task of reading and processing data from a file on disk. There are a number of ways this task can fail, including the file not existing at the specified path, the file not having read permissions, or the file not being encoded in a compatible format. Distinguishing among these different situations allows a program to resolve some errors and to communicate to the user any errors it can’t resolve.",
  "rawMarkdown" : "---\nsource: https:\/\/docs.swift.org\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/\ncrawled: 2025-12-02T19:37:49Z\n---\n\n# Error Handling | Documentation\n\n- [ The Swift Programming Language (6.2.1) ](\/swift-book\/documentation\/the-swift-programming-language)\n\n- [ Error Handling ](\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/)\n\n- [ Error Handling ](\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/)\n\n# Error Handling\n\nRespond to and recover from errors.*Error handling* is the process of responding to and recovering from error conditions in your program. Swift provides first-class support for throwing, catching, propagating, and manipulating recoverable errors at runtime.\n\nSome operations aren’t guaranteed to always complete execution or produce a useful output. Optionals are used to represent the absence of a value, but when an operation fails, it’s often useful to understand what caused the failure, so that your code can respond accordingly.\n\nAs an example, consider the task of reading and processing data from a file on disk. There are a number of ways this task can fail, including the file not existing at the specified path, the file not having read permissions, or the file not being encoded in a compatible format. Distinguishing among these different situations allows a program to resolve some errors and to communicate to the user any errors it can’t resolve.\n\nNote\n\nError handling in Swift interoperates with error handling patterns that use the `NSError` class in Cocoa and Objective-C. For more information about this class, see [Handling Cocoa Errors in Swift](https:\/\/developer.apple.com\/documentation\/swift\/cocoa_design_patterns\/handling_cocoa_errors_in_swift).\n\n## [Representing and Throwing Errors](\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/#Representing-and-Throwing-Errors)\n\nIn Swift, errors are represented by values of types that conform to the `Error` protocol. This empty protocol indicates that a type can be used for error handling.\n\nSwift enumerations are particularly well suited to modeling a group of related error conditions, with associated values allowing for additional information about the nature of an error to be communicated. For example, here’s how you might represent the error conditions of operating a vending machine inside a game:\n\n\n\n```\nenum VendingMachineError: Error {\n    case invalidSelection\n    case insufficientFunds(coinsNeeded: Int)\n    case outOfStock\n}\n\n```\n\nThrowing an error lets you indicate that something unexpected happened and the normal flow of execution can’t continue. You use a `throw` statement to throw an error. For example, the following code throws an error to indicate that five additional coins are needed by the vending machine:\n\n\n\n```\nthrow VendingMachineError.insufficientFunds(coinsNeeded: 5)\n\n```\n\n## [Handling Errors](\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/#Handling-Errors)\n\nWhen an error is thrown, some surrounding piece of code must be responsible for handling the error — for example, by correcting the problem, trying an alternative approach, or informing the user of the failure.\n\nThere are four ways to handle errors in Swift. You can propagate the error from a function to the code that calls that function, handle the error using a `do`-`catch` statement, handle the error as an optional value, or assert that the error will not occur. Each approach is described in a section below.\n\nWhen a function throws an error, it changes the flow of your program, so it’s important that you can quickly identify places in your code that can throw errors. To identify these places in your code, write the `try` keyword — or the `try?` or `try!` variation — before a piece of code that calls a function, method, or initializer that can throw an error. These keywords are described in the sections below.\n\nNote\n\nError handling in Swift resembles exception handling in other languages, with the use of the `try`, `catch` and `throw` keywords. Unlike exception handling in many languages — including Objective-C — error handling in Swift doesn’t involve unwinding the call stack, a process that can be computationally expensive. As such, the performance characteristics of a `throw` statement are comparable to those of a `return` statement.\n\n### [Propagating Errors Using Throwing Functions](\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/#Propagating-Errors-Using-Throwing-Functions)\n\nTo indicate that a function, method, or initializer can throw an error, you write the `throws` keyword in the function’s declaration after its parameters. A function marked with `throws` is called a *throwing function*. If the function specifies a return type, you write the `throws` keyword before the return arrow (`->`).\n\n\n\n```\nfunc canThrowErrors() throws -> String\n\n\nfunc cannotThrowErrors() -> String\n\n```\n\nA throwing function propagates errors that are thrown inside of it to the scope from which it’s called.\n\nNote\n\nOnly throwing functions can propagate errors. Any errors thrown inside a nonthrowing function must be handled inside the function.\n\nIn the example below, the `VendingMachine` class has a `vend(itemNamed:)` method that throws an appropriate `VendingMachineError` if the requested item isn’t available, is out of stock, or has a cost that exceeds the current deposited amount:\n\n\n\n```\nstruct Item {\n    var price: Int\n    var count: Int\n}\n\n\nclass VendingMachine {\n    var inventory = [\n        \"Candy Bar\": Item(price: 12, count: 7),\n        \"Chips\": Item(price: 10, count: 4),\n        \"Pretzels\": Item(price: 7, count: 11)\n    ]\n    var coinsDeposited = 0\n\n\n    func vend(itemNamed name: String) throws {\n        guard let item = inventory[name] else {\n            throw VendingMachineError.invalidSelection\n        }\n\n\n        guard item.count > 0 else {\n            throw VendingMachineError.outOfStock\n        }\n\n\n        guard item.price <= coinsDeposited else {\n            throw VendingMachineError.insufficientFunds(coinsNeeded: item.price - coinsDeposited)\n        }\n\n\n        coinsDeposited -= item.price\n\n\n        var newItem = item\n        newItem.count -= 1\n        inventory[name] = newItem\n\n\n        print(\"Dispensing (name)\")\n    }\n}\n\n```\n\nThe implementation of the `vend(itemNamed:)` method uses `guard` statements to exit the method early and throw appropriate errors if any of the requirements for purchasing a snack aren’t met. Because a `throw` statement immediately transfers program control, an item will be vended only if all of these requirements are met.\n\nBecause the `vend(itemNamed:)` method propagates any errors it throws, any code that calls this method must either handle the errors — using a `do`-`catch` statement, `try?`, or `try!` — or continue to propagate them. For example, the `buyFavoriteSnack(person:vendingMachine:)` in the example below is also a throwing function, and any errors that the `vend(itemNamed:)` method throws will propagate up to the point where the `buyFavoriteSnack(person:vendingMachine:)` function is called.\n\n\n\n```\nlet favoriteSnacks = [\n    \"Alice\": \"Chips\",\n    \"Bob\": \"Licorice\",\n    \"Eve\": \"Pretzels\",\n]\nfunc buyFavoriteSnack(person: String, vendingMachine: VendingMachine) throws {\n    let snackName = favoriteSnacks[person] ?? \"Candy Bar\"\n    try vendingMachine.vend(itemNamed: snackName)\n}\n\n```\n\nIn this example, the `buyFavoriteSnack(person: vendingMachine:)` function looks up a given person’s favorite snack and tries to buy it for them by calling the `vend(itemNamed:)` method. Because the `vend(itemNamed:)` method can throw an error, it’s called with the `try` keyword in front of it.\n\nThrowing initializers can propagate errors in the same way as throwing functions. For example, the initializer for the `PurchasedSnack` structure in the listing below calls a throwing function as part of the initialization process, and it handles any errors that it encounters by propagating them to its caller.\n\n\n\n```\nstruct PurchasedSnack {\n    let name: String\n    init(name: String, vendingMachine: VendingMachine) throws {\n        try vendingMachine.vend(itemNamed: name)\n        self.name = name\n    }\n}\n\n```\n\n### [Handling Errors Using Do-Catch](\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/#Handling-Errors-Using-Do-Catch)\n\nYou use a `do`-`catch` statement to handle errors by running a block of code. If an error is thrown by the code in the `do` clause, it’s matched against the `catch` clauses to determine which one of them can handle the error.\n\nHere is the general form of a `do`-`catch` statement:\n\n\n\n```\ndo {\n    try <#expression#>\n    <#statements#>\n} catch <#pattern 1#> {\n    <#statements#>\n} catch <#pattern 2#> where <#condition#> {\n    <#statements#>\n} catch <#pattern 3#>, <#pattern 4#> where <#condition#> {\n    <#statements#>\n} catch {\n    <#statements#>\n}\n\n```\n\nYou write a pattern after `catch` to indicate what errors that clause can handle. If a `catch` clause doesn’t have a pattern, the clause matches any error and binds the error to a local constant named `error`. For more information about pattern matching, see [Patterns](\/swift-book\/documentation\/the-swift-programming-language\/patterns).\n\nFor example, the following code matches against all three cases of the `VendingMachineError` enumeration.\n\n\n\n```\nvar vendingMachine = VendingMachine()\nvendingMachine.coinsDeposited = 8\ndo {\n    try buyFavoriteSnack(person: \"Alice\", vendingMachine: vendingMachine)\n    print(\"Success! Yum.\")\n} catch VendingMachineError.invalidSelection {\n    print(\"Invalid Selection.\")\n} catch VendingMachineError.outOfStock {\n    print(\"Out of Stock.\")\n} catch VendingMachineError.insufficientFunds(let coinsNeeded) {\n    print(\"Insufficient funds. Please insert an additional (coinsNeeded) coins.\")\n} catch {\n    print(\"Unexpected error: (error).\")\n}\n\/\/ Prints \"Insufficient funds. Please insert an additional 2 coins.\"\n\n```\n\nIn the above example, the `buyFavoriteSnack(person:vendingMachine:)` function is called in a `try` expression, because it can throw an error. If an error is thrown, execution immediately transfers to the `catch` clauses, which decide whether to allow propagation to continue. If no pattern is matched, the error gets caught by the final `catch` clause and is bound to a local `error` constant. If no error is thrown, the remaining statements in the `do` statement are executed.\n\nThe `catch` clauses don’t have to handle every possible error that the code in the `do` clause can throw. If none of the `catch` clauses handle the error, the error propagates to the surrounding scope. However, the propagated error must be handled by *some* surrounding scope. In a nonthrowing function, an enclosing `do`-`catch` statement must handle the error. In a throwing function, either an enclosing `do`-`catch` statement or the caller must handle the error. If the error propagates to the top-level scope without being handled, you’ll get a runtime error.\n\nFor example, the above example can be written so any error that isn’t a `VendingMachineError` is instead caught by the calling function:\n\n\n\n```\nfunc nourish(with item: String) throws {\n    do {\n        try vendingMachine.vend(itemNamed: item)\n    } catch is VendingMachineError {\n        print(\"Couldn't buy that from the vending machine.\")\n    }\n}\n\n\ndo {\n    try nourish(with: \"Beet-Flavored Chips\")\n} catch {\n    print(\"Unexpected non-vending-machine-related error: (error)\")\n}\n\/\/ Prints \"Couldn't buy that from the vending machine.\"\n\n```\n\nIn the `nourish(with:)` function, if `vend(itemNamed:)` throws an error that’s one of the cases of the `VendingMachineError` enumeration, `nourish(with:)` handles the error by printing a message. Otherwise, `nourish(with:)` propagates the error to its call site. The error is then caught by the general `catch` clause.\n\nAnother way to catch several related errors is to list them after `catch`, separated by commas. For example:\n\n\n\n```\nfunc eat(item: String) throws {\n    do {\n        try vendingMachine.vend(itemNamed: item)\n    } catch VendingMachineError.invalidSelection, VendingMachineError.insufficientFunds, VendingMachineError.outOfStock {\n        print(\"Invalid selection, out of stock, or not enough money.\")\n    }\n}\n\n```\n\nThe `eat(item:)` function lists the vending machine errors to catch, and its error text corresponds to the items in that list. If any of the three listed errors are thrown, this `catch` clause handles them by printing a message. Any other errors are propagated to the surrounding scope, including any vending-machine errors that might be added later.\n\n### [Converting Errors to Optional Values](\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/#Converting-Errors-to-Optional-Values)\n\nYou use `try?` to handle an error by converting it to an optional value. If an error is thrown while evaluating the `try?` expression, the value of the expression is `nil`. For example, in the following code `x` and `y` have the same value and behavior:\n\n\n\n```\nfunc someThrowingFunction() throws -> Int {\n    \/\/ ...\n}\n\n\nlet x = try? someThrowingFunction()\n\n\nlet y: Int?\ndo {\n    y = try someThrowingFunction()\n} catch {\n    y = nil\n}\n\n```\n\nIf `someThrowingFunction()` throws an error, the value of `x` and `y` is `nil`. Otherwise, the value of `x` and `y` is the value that the function returned. Note that `x` and `y` are an optional of whatever type `someThrowingFunction()` returns. Here the function returns an integer, so `x` and `y` are optional integers.\n\nUsing `try?` lets you write concise error handling code when you want to handle all errors in the same way. For example, the following code uses several approaches to fetch data, or returns `nil` if all of the approaches fail.\n\n\n\n```\nfunc fetchData() -> Data? {\n    if let data = try? fetchDataFromDisk() { return data }\n    if let data = try? fetchDataFromServer() { return data }\n    return nil\n}\n\n```\n\n### [Disabling Error Propagation](\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/#Disabling-Error-Propagation)\n\nSometimes you know a throwing function or method won’t, in fact, throw an error at runtime. On those occasions, you can write `try!` before the expression to disable error propagation and wrap the call in a runtime assertion that no error will be thrown. If an error actually is thrown, you’ll get a runtime error.\n\nFor example, the following code uses a `loadImage(atPath:)` function, which loads the image resource at a given path or throws an error if the image can’t be loaded. In this case, because the image is shipped with the application, no error will be thrown at runtime, so it’s appropriate to disable error propagation.\n\n\n\n```\nlet photo = try! loadImage(atPath: \".\/Resources\/John Appleseed.jpg\")\n\n```\n\n## [Specifying the Error Type](\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/#Specifying-the-Error-Type)\n\nAll of the examples above use the most common kind of error handling, where the errors that your code throws can be values of any type that conforms to the `Error` protocol. This approach matches the reality that you don’t know ahead of time every error that could happen while the code is running, especially when propagating errors thrown somewhere else. It also reflects the fact that errors can change over time. New versions of a library — including libraries that your dependencies use — can throw new errors, and the rich complexity of real-world user configurations can expose failure modes that weren’t visible during development or testing. The error handling code in the examples above always includes a default case to handle errors that don’t have a specific `catch` clause.\n\nMost Swift code doesn’t specify the type for the errors it throws. However, you might limit code to throwing errors of only one specific type in the following special cases:\n\n- When running code on an embedded system that doesn’t support dynamic allocation of memory. Throwing an instance of `any Error` or another boxed protocol type requires allocating memory at runtime to store the error. In contrast, throwing an error of a specific type lets Swift avoid heap allocation for errors.\n\n- When the errors are an implementation detail of some unit of code, like a library, and aren’t part of the interface to that code. Because the errors come from only the library, and not from other dependencies or the library’s clients, you can make an exhaustive list of all possible failures. And because these errors are an implementation detail of the library, they’re always handled within that library.\n\n- In code that only propagates errors described by generic parameters, like a function that takes a closure argument and propagates any errors from that closure. For a comparison between propagating a specific error type and using `rethrows`, see [Rethrowing Functions and Methods](\/swift-book\/documentation\/the-swift-programming-language\/declarations#Rethrowing-Functions-and-Methods).\n\nFor example, consider code that summarizes ratings and uses the following error type:\n\n\n\n```\nenum StatisticsError: Error {\n    case noRatings\n    case invalidRating(Int)\n}\n\n```\n\nTo specify that a function throws only `StatisticsError` values as its errors, you write `throws(StatisticsError)` instead of only `throws` when declaring the function. This syntax is also called *typed throws* because you write the error type after `throws` in the declaration. For example, the function below throws `StatisticsError` values as its errors.\n\n\n\n```\nfunc summarize(_ ratings: [Int]) throws(StatisticsError) {\n    guard !ratings.isEmpty else { throw .noRatings }\n\n\n    var counts = [1: 0, 2: 0, 3: 0]\n    for rating in ratings {\n        guard rating > 0 && rating <= 3 else { throw .invalidRating(rating) }\n        counts[rating]! += 1\n    }\n\n\n    print(\"*\", counts[1]!, \"-- **\", counts[2]!, \"-- ***\", counts[3]!)\n}\n\n```\n\nIn the code above, the `summarize(_:)` function summarizes a list of ratings expressed on a scale of 1 to 3. This function throws an instance of `StatisticsError` if the input isn’t valid. Both places in the code above that throw an error omit the type of the error because the function’s error type is already defined. You can use the short form, `throw .noRatings`, instead of writing `throw StatisticsError.noRatings` when throwing an error in a function like this.\n\nWhen you write a specific error type at the start of the function, Swift checks that you don’t throw any other errors. For example, if you tried to use `VendingMachineError` from examples earlier in this chapter in the `summarize(_:)` function above, that code would produce an error at compile time.\n\nYou can call a function that uses typed throws from within a regular throwing function:\n\n\n\n```\nfunc someThrowingFunction() throws {\n    let ratings = [1, 2, 3, 2, 2, 1]\n    try summarize(ratings)\n}\n\n```\n\nThe code above doesn’t specify an error type for `someThrowingFunction()`, so it throws `any Error`. You could also write the error type explicitly as `throws(any Error)`; the code below is equivalent to the code above:\n\n\n\n```\nfunc someThrowingFunction() throws(any Error) {\n    let ratings = [1, 2, 3, 2, 2, 1]\n    try summarize(ratings)\n}\n\n```\n\nIn this code, `someThrowingFunction()` propagates any errors that `summarize(_:)` throws. The errors from `summarize(_:)` are always `StatisticsError` values, which is also a valid error for `someThrowingFunction()` to throw.\n\nJust like you can write a function that never returns with a return type of `Never`, you can write a function that never throws with `throws(Never)`:\n\n\n\n```\nfunc nonThrowingFunction() throws(Never) {\n  \/\/ ...\n}\n\n```\n\nThis function can’t throw because it’s impossible to create a value of type `Never` to throw.\n\nIn addition to specifying a function’s error type, you can also write a specific error type for a `do`-`catch` statement. For example:\n\n\n\n```\nlet ratings = []\ndo throws(StatisticsError) {\n    try summarize(ratings)\n} catch {\n    switch error {\n    case .noRatings:\n        print(\"No ratings available\")\n    case .invalidRating(let rating):\n        print(\"Invalid rating: (rating)\")\n    }\n}\n\/\/ Prints \"No ratings available\".\n\n```\n\nIn this code, writing `do throws(StatisticsError)` indicates that the `do`-`catch` statement throws `StatisticsError` values as its errors. Like other `do`-`catch` statements, the `catch` clause can either handle every possible error or propagate unhandled errors for some surrounding scope to handle. This code handles all of the errors, using a `switch` statement with one case for each enumeration value. Like other `catch` clauses that don’t have a pattern, the clause matches any error and binds the error to a local constant named `error`. Because the `do`-`catch` statement throws `StatisticsError` values, `error` is a value of type `StatisticsError`.\n\nThe `catch` clause above uses a `switch` statement to match and handle each possible error. If you tried to add a new case to `StatisticsError` without updating the error-handling code, Swift would give you an error because the `switch` statement wouldn’t be exhaustive anymore. For a library that catches all of its own errors, you could use this approach to ensure any new errors get corresponding new code to handle them.\n\nIf a function or `do` block throws errors of only a single type, Swift infers that this code is using typed throws. Using this shorter syntax, you could write the `do`-`catch` example above as follows:\n\n\n\n```\nlet ratings = []\ndo {\n    try summarize(ratings)\n} catch {\n    switch error {\n    case .noRatings:\n        print(\"No ratings available\")\n    case .invalidRating(let rating):\n        print(\"Invalid rating: (rating)\")\n    }\n}\n\/\/ Prints \"No ratings available\".\n\n```\n\nEven though the `do`-`catch` block above doesn’t specify what type of error it throws, Swift infers that it throws `StatisticsError`. You can explicitly write `throws(any Error)` to avoid letting Swift infer typed throws.\n\n## [Specifying Cleanup Actions](\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/#Specifying-Cleanup-Actions)\n\nYou use a `defer` statement to execute a set of statements just before code execution leaves the current block of code. This statement lets you do any necessary cleanup that should be performed regardless of *how* execution leaves the current block of code — whether it leaves because an error was thrown or because of a statement such as `return` or `break`. For example, you can use a `defer` statement to ensure that file descriptors are closed and manually allocated memory is freed.\n\nA `defer` statement defers execution until the current scope is exited. This statement consists of the `defer` keyword and the statements to be executed later. The deferred statements may not contain any code that would transfer control out of the statements, such as a `break` or a `return` statement, or by throwing an error. Deferred actions are executed in the reverse of the order that they’re written in your source code. That is, the code in the first `defer` statement executes last, the code in the second `defer` statement executes second to last, and so on. The last `defer` statement in source code order executes first.\n\n\n\n```\nfunc processFile(filename: String) throws {\n    if exists(filename) {\n        let file = open(filename)\n        defer {\n            close(file)\n        }\n        while let line = try file.readline() {\n            \/\/ Work with the file.\n        }\n        \/\/ close(file) is called here, at the end of the scope.\n    }\n}\n\n```\n\nThe above example uses a `defer` statement to ensure that the `open(_:)` function has a corresponding call to `close(_:)`.\n\nYou can use a `defer` statement even when no error handling code is involved. For more information, see [Deferred Actions](\/swift-book\/documentation\/the-swift-programming-language\/controlflow#Deferred-Actions).\n\n- [ Error Handling ](\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/#app-top)\n\n- [ Representing and Throwing Errors ](\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/#Representing-and-Throwing-Errors)\n\n- [ Handling Errors ](\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/#Handling-Errors)\n\n- [ Propagating Errors Using Throwing Functions ](\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/#Propagating-Errors-Using-Throwing-Functions)\n\n- [ Handling Errors Using Do-Catch ](\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/#Handling-Errors-Using-Do-Catch)\n\n- [ Converting Errors to Optional Values ](\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/#Converting-Errors-to-Optional-Values)\n\n- [ Disabling Error Propagation ](\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/#Disabling-Error-Propagation)\n\n- [ Specifying the Error Type ](\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/#Specifying-the-Error-Type)\n\n- [ Specifying Cleanup Actions ](\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/#Specifying-Cleanup-Actions)",
  "sections" : [
    {
      "content" : "",
      "title" : "Representing and Throwing Errors"
    },
    {
      "content" : "",
      "title" : "Handling Errors"
    },
    {
      "content" : "",
      "title" : "Specifying the Error Type"
    },
    {
      "content" : "",
      "title" : "Specifying Cleanup Actions"
    }
  ],
  "source" : "swiftOrg",
  "title" : "Error Handling | Documentation",
  "url" : "https:\/\/docs.swift.org\/swift-book\/documentation\/the-swift-programming-language\/errorhandling\/"
}