{
  "abstract" : "Work with common kinds of data and write basic syntax.",
  "codeExamples" : [

  ],
  "contentHash" : "1d26f7505dd5934adec627031576053edc302b90407bd008bde2d0fa6be01e91",
  "crawledAt" : "2025-12-02T19:36:15Z",
  "declaration" : {
    "code" : "let maximumNumberOfLoginAttempts = 10\nvar currentLoginAttempt = 0",
    "language" : "swift"
  },
  "id" : "9F165CF1-BC7A-445F-B045-31E9E04F2D0F",
  "kind" : "class",
  "overview" : "The Swift Programming Language (6.2.1)  The Basics  The Basics The BasicsWork with common kinds of data and write basic syntax.Swift provides many fundamental data types, including Int for integers, Double for floating-point values, Bool for Boolean values, and String for text. Swift also provides powerful versions of the three primary collection types, Array, Set, and Dictionary, as described in Collection Types.\n\nSwift uses variables to store and refer to values by an identifying name. Swift also makes extensive use of variables whose values can’t be changed. These are known as constants, and are used throughout Swift to make code safer and clearer in intent when you work with values that don’t need to change.\n\nIn addition to familiar types, Swift introduces advanced types such as tuples. Tuples enable you to create and pass around groupings of values. You can use a tuple to return multiple values from a function as a single compound value.",
  "rawMarkdown" : "---\nsource: https:\/\/docs.swift.org\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/\ncrawled: 2025-12-02T19:36:15Z\n---\n\n# The Basics | Documentation\n\n- [ The Swift Programming Language (6.2.1) ](\/swift-book\/documentation\/the-swift-programming-language)\n\n- [ The Basics ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/)\n\n- [ The Basics ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/)\n\n# The Basics\n\nWork with common kinds of data and write basic syntax.Swift provides many fundamental data types, including `Int` for integers, `Double` for floating-point values, `Bool` for Boolean values, and `String` for text. Swift also provides powerful versions of the three primary collection types, `Array`, `Set`, and `Dictionary`, as described in [Collection Types](\/swift-book\/documentation\/the-swift-programming-language\/collectiontypes).\n\nSwift uses variables to store and refer to values by an identifying name. Swift also makes extensive use of variables whose values can’t be changed. These are known as constants, and are used throughout Swift to make code safer and clearer in intent when you work with values that don’t need to change.\n\nIn addition to familiar types, Swift introduces advanced types such as tuples. Tuples enable you to create and pass around groupings of values. You can use a tuple to return multiple values from a function as a single compound value.\n\nSwift handles the absence of a value using optional types. Optionals say either “there *is* a value, which is *x*” or “there *isn’t* a value at all”. Optionals ensure that code always checks whether a value is missing before using the value, and non-optional values are guaranteed to never be missing.\n\nSwift is a safe language, which means it makes it easier for you find and fix several categories of bugs as early as possible during the development process, and lets you guarantee that certain kinds of bugs can’t happen. Type safety enables you to be clear about the types of values your code works with. If part of your code requires a `String`, type safety prevents you from passing it an `Int` by mistake. Memory safety ensures that you work with valid data only, not uninitialized memory or deinitialized objects, and ensures that you work with that data in safe ways — even in programs that run multiple pieces of code at the same time. Swift performs most of its safety checks while building your code, and in some cases performs additional checks while your code is running.\n\n## [Constants and Variables](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Constants-and-Variables)\n\nConstants and variables associate a name (such as `maximumNumberOfLoginAttempts` or `welcomeMessage`) with a value of a particular type (such as the number `10` or the string `\"Hello\"`). The value of a *constant* can’t be changed once it’s set, whereas a *variable* can be set to a different value in the future.\n\n### [Declaring Constants and Variables](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Declaring-Constants-and-Variables)\n\nConstants and variables must be declared before they’re used. You declare constants with the `let` keyword and variables with the `var` keyword. Here’s an example of how constants and variables can be used to track the number of login attempts a user has made:\n\n\n\n```\nlet maximumNumberOfLoginAttempts = 10\nvar currentLoginAttempt = 0\n\n```\n\nThis code can be read as:\n\n“Declare a new constant called `maximumNumberOfLoginAttempts`, and give it a value of `10`. Then, declare a new variable called `currentLoginAttempt`, and give it an initial value of `0`.”\n\nIn this example, the maximum number of allowed login attempts is declared as a constant, because the maximum value never changes. The current login attempt counter is declared as a variable, because this value must be incremented after each failed login attempt.\n\nIf a stored value in your code won’t change, always declare it as a constant with the `let` keyword. Use variables only for storing values that change.\n\nWhen you declare a constant or a variable, you can give it a value as part of that declaration, like the examples above. Alternatively, you can assign its initial value later in the program, as long as it’s guaranteed to have a value before the first time you read from it.\n\n\n\n```\nvar environment = \"development\"\nlet maximumNumberOfLoginAttempts: Int\n\/\/ maximumNumberOfLoginAttempts has no value yet.\n\n\nif environment == \"development\" {\n    maximumNumberOfLoginAttempts = 100\n} else {\n    maximumNumberOfLoginAttempts = 10\n}\n\/\/ Now maximumNumberOfLoginAttempts has a value, and can be read.\n\n```\n\nIn this example, the maximum number of login attempts is constant, and its value depends on the environment. In the development environment, it has a value of 100; in any other environment, its value is 10. Both branches of the `if` statement initialize `maximumNumberOfLoginAttempts` with some value, guaranteeing that the constant always gets a value. For information about how Swift checks your code when you set an initial value this way, see [Constant Declaration](\/swift-book\/documentation\/the-swift-programming-language\/declarations#Constant-Declaration).\n\nYou can declare multiple constants or multiple variables on a single line, separated by commas:\n\n\n\n```\nvar x = 0.0, y = 0.0, z = 0.0\n\n```\n\n### [Type Annotations](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Type-Annotations)\n\nYou can provide a *type annotation* when you declare a constant or variable, to be clear about the kind of values the constant or variable can store. Write a type annotation by placing a colon after the constant or variable name, followed by a space, followed by the name of the type to use.\n\nThis example provides a type annotation for a variable called `welcomeMessage`, to indicate that the variable can store `String` values:\n\n\n\n```\nvar welcomeMessage: String\n\n```\n\nThe colon in the declaration means “…of type…,” so the code above can be read as:\n\n“Declare a variable called `welcomeMessage` that’s of type `String`.”\n\nThe phrase “of type `String`” means “can store any `String` value.” Think of it as meaning “the type of thing” (or “the kind of thing”) that can be stored.\n\nThe `welcomeMessage` variable can now be set to any string value without error:\n\n\n\n```\nwelcomeMessage = \"Hello\"\n\n```\n\nYou can define multiple related variables of the same type on a single line, separated by commas, with a single type annotation after the final variable name:\n\n\n\n```\nvar red, green, blue: Double\n\n```\n\nNote\n\nIt’s rare that you need to write type annotations in practice. If you provide an initial value for a constant or variable at the point that it’s defined, Swift can almost always infer the type to be used for that constant or variable, as described in [Type Safety and Type Inference](\/swift-book\/documentation\/the-swift-programming-language\/thebasics#Type-Safety-and-Type-Inference). In the `welcomeMessage` example above, no initial value is provided, and so the type of the `welcomeMessage` variable is specified with a type annotation rather than being inferred from an initial value.\n\n### [Naming Constants and Variables](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Naming-Constants-and-Variables)\n\nConstant and variable names can contain almost any character, including Unicode characters:\n\n\n\n```\nlet π = 3.14159\nlet 你好 = \"你好世界\"\nlet 🐶🐮 = \"dogcow\"\n\n```\n\nConstant and variable names can’t contain whitespace characters, mathematical symbols, arrows, private-use Unicode scalar values, or line- and box-drawing characters. Nor can they begin with a number, although numbers may be included elsewhere within the name.\n\nOnce you’ve declared a constant or variable of a certain type, you can’t declare it again with the same name, or change it to store values of a different type. Nor can you change a constant into a variable or a variable into a constant.\n\nNote\n\nIf you need to give a constant or variable the same name as a reserved Swift keyword, surround the keyword with backticks (```) when using it as a name. However, avoid using keywords as names unless you have absolutely no choice.\n\nYou can change the value of an existing variable to another value of a compatible type. In this example, the value of `friendlyWelcome` is changed from `\"Hello!\"` to `\"Bonjour!\"`:\n\n\n\n```\nvar friendlyWelcome = \"Hello!\"\nfriendlyWelcome = \"Bonjour!\"\n\/\/ friendlyWelcome is now \"Bonjour!\"\n\n```\n\nUnlike a variable, the value of a constant can’t be changed after it’s set. Attempting to do so is reported as an error when your code is compiled:\n\n\n\n```\nlet languageName = \"Swift\"\nlanguageName = \"Swift++\"\n\/\/ This is a compile-time error: languageName cannot be changed.\n\n```\n\n### [Printing Constants and Variables](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Printing-Constants-and-Variables)\n\nYou can print the current value of a constant or variable with the `print(_:separator:terminator:)` function:\n\n\n\n```\nprint(friendlyWelcome)\n\/\/ Prints \"Bonjour!\"\n\n```\n\nThe `print(_:separator:terminator:)` function is a global function that prints one or more values to an appropriate output. In Xcode, for example, the `print(_:separator:terminator:)` function prints its output in Xcode’s “console” pane. The `separator` and `terminator` parameter have default values, so you can omit them when you call this function. By default, the function terminates the line it prints by adding a line break. To print a value without a line break after it, pass an empty string as the terminator — for example, `print(someValue, terminator: \"\")`. For information about parameters with default values, see [Default Parameter Values](\/swift-book\/documentation\/the-swift-programming-language\/functions#Default-Parameter-Values).\n\nSwift uses *string interpolation* to include the name of a constant or variable as a placeholder in a longer string, and to prompt Swift to replace it with the current value of that constant or variable. Wrap the name in parentheses and escape it with a backslash before the opening parenthesis:\n\n\n\n```\nprint(\"The current value of friendlyWelcome is (friendlyWelcome)\")\n\/\/ Prints \"The current value of friendlyWelcome is Bonjour!\"\n\n```\n\nNote\n\nAll options you can use with string interpolation are described in [String Interpolation](\/swift-book\/documentation\/the-swift-programming-language\/stringsandcharacters#String-Interpolation).\n\n## [Comments](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Comments)\n\nUse comments to include nonexecutable text in your code, as a note or reminder to yourself. Comments are ignored by the Swift compiler when your code is compiled.\n\nComments in Swift are very similar to comments in C. Single-line comments begin with two forward-slashes (`\/\/`):\n\n\n\n```\n\/\/ This is a comment.\n\n```\n\nMultiline comments start with a forward-slash followed by an asterisk (`\/*`) and end with an asterisk followed by a forward-slash (`*\/`):\n\n\n\n```\n\/* This is also a comment\nbut is written over multiple lines. *\/\n\n```\n\nUnlike multiline comments in C, multiline comments in Swift can be nested inside other multiline comments. You write nested comments by starting a multiline comment block and then starting a second multiline comment within the first block. The second block is then closed, followed by the first block:\n\n\n\n```\n\/* This is the start of the first multiline comment.\n    \/* This is the second, nested multiline comment. *\/\nThis is the end of the first multiline comment. *\/\n\n```\n\nNested multiline comments enable you to comment out large blocks of code quickly and easily, even if the code already contains multiline comments.\n\n## [Semicolons](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Semicolons)\n\nUnlike many other languages, Swift doesn’t require you to write a semicolon (`;`) after each statement in your code, although you can do so if you wish. However, semicolons *are* required if you want to write multiple separate statements on a single line:\n\n\n\n```\nlet cat = \"🐱\"; print(cat)\n\/\/ Prints \"🐱\".\n\n```\n\n## [Integers](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Integers)\n\n*Integers* are whole numbers with no fractional component, such as `42` and `-23`. Integers are either *signed* (positive, zero, or negative) or *unsigned* (positive or zero), and their maximum and minimum value depends on their *size* (the number of bits used to store values). The integer types include their size and sign in their names — for example, an 8-bit unsigned integer is of type `UInt8`, and a 32-bit signed integer is of type `Int32`. Like all types in Swift, these integer types have capitalized names. In most cases, when you don’t need to specify the exact integer size, you use the `Int` type described below.\n\nInteger types behave like most arithmetic you do by hand; integer math produces results without approximating. These characteristics make integers suitable for counting and other calculations that represent exact amounts — for example, finding the longest line in a text file, applying a score multiplier in a game, or totaling prices on a receipt.\n\nAlthough integers don’t have a fractional component, you can use integers to represent quantities with fractions by counting a fractional part. For example, you can represent $1.23 by storing the number `123` in an integer that counts cents. This approach is known as *fixed-point math* because the decimal point is at a fixed position in the number. In the example above, the number `123` is understood to have a decimal point before the last two digits.\n\nNote\n\n For calculations in a regulated area like finance or construction, or in a domain that has an expectation of high-precision results, you might need a special-purpose numeric type that implements behaviors such as rounding and truncation, according to that area’s requirements.\n\n### [Integer Bounds](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Integer-Bounds)\n\nYou can access the minimum and maximum values of each integer type with its `min` and `max` properties:\n\n\n\n```\nlet minValue = UInt8.min  \/\/ minValue is equal to 0, and is of type UInt8\nlet maxValue = UInt8.max  \/\/ maxValue is equal to 255, and is of type UInt8\n\n```\n\nThe values of these properties are of the appropriate-sized number type (such as `UInt8` in the example above) and can therefore be used in expressions alongside other values of the same type.\n\nCalculations that produce out-of-bounds results, like a number larger that the `max` property, stop the program’s execution instead of storing an invalid result. You can explicitly make the operation overflow instead, as described in [Overflow Operators](\/swift-book\/documentation\/the-swift-programming-language\/advancedoperators#Overflow-Operators).\n\n### [Int](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Int)\n\nIn most cases, you don’t need to pick a specific size of integer to use in your code. Swift provides an additional integer type, `Int`, which has the same size as the current platform’s native word size:\n\n- On a 32-bit platform, `Int` is the same size as `Int32`.\n\n- On a 64-bit platform, `Int` is the same size as `Int64`.\n\nUnless you need to work with a specific size of integer, always use `Int` for integer values in your code. This aids code consistency and interoperability. Even on 32-bit platforms, `Int` can store any value between `-2,147,483,648` and `2,147,483,647`, and is large enough for many integer ranges.\n\n### [UInt](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#UInt)\n\nSwift also provides an unsigned integer type, `UInt`, which has the same size as the current platform’s native word size:\n\n- On a 32-bit platform, `UInt` is the same size as `UInt32`.\n\n- On a 64-bit platform, `UInt` is the same size as `UInt64`.\n\nNote\n\nUse `UInt` only when you specifically need an unsigned integer type with the same size as the platform’s native word size. If this isn’t the case, `Int` is preferred, even when the values to be stored are known to be nonnegative. A consistent use of `Int` for integer values aids code interoperability, avoids the need to convert between different number types, and matches integer type inference, as described in [Type Safety and Type Inference](\/swift-book\/documentation\/the-swift-programming-language\/thebasics#Type-Safety-and-Type-Inference).\n\n## [Floating-Point Numbers](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Floating-Point-Numbers)\n\n*Floating-point numbers* have a fractional component, such as `3.14159`, `0.1`, and `-273.15`. Swift provides a variety of floating-point types that support different sizes of numbers, just like it has different sizes of integers. If you don’t need to specify an exact size, use `Double`. Otherwise, use the type that includes the needed size in its name, such as `Float16` or `Float80`. Following common terminology for floating-point math, `Float` uses 32 bits and `Double` uses 64 bits. You can also write these types as `Float32` or `Float64`. For example, graphics code often uses `Float` to match the GPU’s fastest data type. Some floating-point types are supported only by certain platforms, but `Float` and `Double` are available on all platforms.\n\nFloating-point numbers let you work with very small and very large numbers, but can’t represent every possible value in that range. Unlike integer calculations, which always produce an exact result, floating-point math rounds results to the nearest representable number. For example, when storing the number 10,000 as a `Float`, the next largest number you can represent is 10,000.001 –– values between these two numbers round to one or the other. The space between numbers is also variable; there are larger spaces between large numbers than between small numbers. For example, the next `Float` value after 0.001 is 0.0010000002, which is smaller than the spacing after 10,000.\n\nFloating-point numbers have values for negative zero, infinity, and negative infinity, which represent overflow and underflow in calculations. They also have include not-a-number (NaN) values to represent an invalid or undefined result, such as dividing zero by zero. This behavior is different from integers, which stop the program if they can’t represent the result.\n\nIf you need the same spacing between all possible values, or if the calculations you’re doing require exact results and don’t call for the special values listed above, a floating-point number might not be the right data type. Consider using fixed-point numbers instead, as described in [Integers](\/swift-book\/documentation\/the-swift-programming-language\/thebasics#Integers).\n\n## [Type Safety and Type Inference](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Type-Safety-and-Type-Inference)\n\nEvery value in a Swift program has a type. Every place you store a value — including constants, variables, and properties — also has a type. You might write the type explicitly using a type annotation, or Swift might infer the type from an initial value. Every place in your code where you provide a value, that value’s type must match the place you use it. For example, if part of your code requires a `String`, you can’t pass it an `Int` by mistake. This kind of checking makes Swift a *type-safe* language.\n\nA type safe language encourages you to be clear about the types of values your code works with. Values of one type are never implicitly converted to another type. However, some types can be explicitly converted. When building code, Swift checks the code for type safety and flags any mismatched types as errors.\n\nType checking helps you avoid errors when you’re working with different types of values. However, this doesn’t mean that you have to specify the type of every constant and variable that you declare. If you don’t specify the type of value you need, Swift uses *type inference* to work out the appropriate type. Type inference enables a compiler to deduce the type of a particular expression automatically when it compiles your code, simply by examining the values you provide.\n\nBecause of type inference, Swift requires far fewer type declarations than languages such as C or Objective-C. Constants and variables are still explicitly typed, but much of the work of specifying their type is done for you.\n\nType inference is particularly useful when you declare a constant or variable with an initial value. This is often done by assigning a *literal value* (or *literal*) to the constant or variable at the point that you declare it. (A literal value is a value that appears directly in your source code, such as `42` and `3.14159` in the examples below.)\n\nFor example, if you assign a literal value of `42` to a new constant without saying what type it is, Swift infers that you want the constant to be an `Int`, because you have initialized it with a number that looks like an integer:\n\n\n\n```\nlet meaningOfLife = 42\n\/\/ meaningOfLife is inferred to be of type Int\n\n```\n\nLikewise, if you don’t specify a type for a floating-point literal, Swift infers that you want to create a `Double`:\n\n\n\n```\nlet pi = 3.14159\n\/\/ pi is inferred to be of type Double\n\n```\n\nSwift always chooses `Double` (rather than `Float`) when inferring the type of floating-point numbers.\n\nIf you combine integer and floating-point literals in an expression, a type of `Double` will be inferred from the context:\n\n\n\n```\nlet anotherPi = 3 + 0.14159\n\/\/ anotherPi is also inferred to be of type Double\n\n```\n\nThe literal value of `3` has no explicit type in and of itself, and so an appropriate output type of `Double` is inferred from the presence of a floating-point literal as part of the addition.\n\n## [Numeric Literals](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Numeric-Literals)\n\nInteger literals can be written as:\n\n- A *decimal* number, with no prefix\n\n- A *binary* number, with a `0b` prefix\n\n- An *octal* number, with a `0o` prefix\n\n- A *hexadecimal* number, with a `0x` prefix\n\nAll of these integer literals have a decimal value of `17`:\n\n\n\n```\nlet decimalInteger = 17\nlet binaryInteger = 0b10001       \/\/ 17 in binary notation\nlet octalInteger = 0o21           \/\/ 17 in octal notation\nlet hexadecimalInteger = 0x11     \/\/ 17 in hexadecimal notation\n\n```\n\nFloating-point literals can be decimal (with no prefix), or hexadecimal (with a `0x` prefix). They must always have a number (or hexadecimal number) on both sides of the decimal point. Decimal floats can also have an optional *exponent*, indicated by an uppercase or lowercase `e`; hexadecimal floats must have an exponent, indicated by an uppercase or lowercase `p`.\n\nFor decimal numbers with an exponent of `x`, the base number is multiplied by 10ˣ:\n\n- `1.25e2` means 1.25 x 10², or `125.0`.\n\n- `1.25e-2` means 1.25 x 10⁻², or `0.0125`.\n\nFor hexadecimal numbers with an exponent of `x`, the base number is multiplied by 2ˣ:\n\n- `0xFp2` means 15 x 2², or `60.0`.\n\n- `0xFp-2` means 15 x 2⁻², or `3.75`.\n\nAll of these floating-point literals have a decimal value of `12.1875`:\n\n\n\n```\nlet decimalDouble = 12.1875\nlet exponentDouble = 1.21875e1\nlet hexadecimalDouble = 0xC.3p0\n\n```\n\nNumeric literals can contain extra formatting to make them easier to read. Both integers and floats can be padded with extra zeros and can contain underscores to help with readability. Neither type of formatting affects the underlying value of the literal:\n\n\n\n```\nlet paddedDouble = 000123.456\nlet oneMillion = 1_000_000\nlet justOverOneMillion = 1_000_000.000_000_1\n\n```\n\n## [Numeric Type Conversion](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Numeric-Type-Conversion)\n\nUse the `Int` type for all general-purpose integer constants and variables in your code, even if they’re known to be nonnegative. Using the default integer type in everyday situations means that integer constants and variables are immediately interoperable in your code and will match the inferred type for integer literal values.\n\nUse other integer types only when they’re specifically needed for the task at hand, because of explicitly sized data from an external source, or for performance, memory usage, or other necessary optimization. Using explicitly sized types in these situations helps to catch any accidental value overflows and implicitly documents the nature of the data being used.\n\n### [Integer Conversion](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Integer-Conversion)\n\nThe range of numbers that can be stored in an integer constant or variable is different for each numeric type. An `Int8` constant or variable can store numbers between `-128` and `127`, whereas a `UInt8` constant or variable can store numbers between `0` and `255`. A number that won’t fit into a constant or variable of a sized integer type is reported as an error when your code is compiled:\n\n\n\n```\nlet cannotBeNegative: UInt8 = -1\n\/\/ UInt8 can't store negative numbers, and so this will report an error\nlet tooBig: Int8 = Int8.max + 1\n\/\/ Int8 can't store a number larger than its maximum value,\n\/\/ and so this will also report an error\n\n```\n\nBecause each numeric type can store a different range of values, you must opt in to numeric type conversion on a case-by-case basis. This opt-in approach prevents hidden conversion errors and helps make type conversion intentions explicit in your code.\n\nTo convert one specific number type to another, you initialize a new number of the desired type with the existing value. In the example below, the constant `twoThousand` is of type `UInt16`, whereas the constant `one` is of type `UInt8`. They can’t be added together directly, because they’re not of the same type. Instead, this example calls `UInt16(one)` to create a new `UInt16` initialized with the value of `one`, and uses this value in place of the original:\n\n\n\n```\nlet twoThousand: UInt16 = 2_000\nlet one: UInt8 = 1\nlet twoThousandAndOne = twoThousand + UInt16(one)\n\n```\n\nBecause both sides of the addition are now of type `UInt16`, the addition is allowed. The output constant (`twoThousandAndOne`) is inferred to be of type `UInt16`, because it’s the sum of two `UInt16` values.\n\n`SomeType(ofInitialValue)` is the default way to call the initializer of a Swift type and pass in an initial value. Behind the scenes, `UInt16` has an initializer that accepts a `UInt8` value, and so this initializer is used to make a new `UInt16` from an existing `UInt8`. You can’t pass in *any* type here, however — it has to be a type for which `UInt16` provides an initializer. Extending existing types to provide initializers that accept new types (including your own type definitions) is covered in [Extensions](\/swift-book\/documentation\/the-swift-programming-language\/extensions).\n\n### [Integer and Floating-Point Conversion](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Integer-and-Floating-Point-Conversion)\n\nConversions between integer and floating-point numeric types must be made explicit:\n\n\n\n```\nlet three = 3\nlet pointOneFourOneFiveNine = 0.14159\nlet pi = Double(three) + pointOneFourOneFiveNine\n\/\/ pi equals 3.14159, and is inferred to be of type Double\n\n```\n\nHere, the value of the constant `three` is used to create a new value of type `Double`, so that both sides of the addition are of the same type. Without this conversion in place, the addition would not be allowed.\n\nFloating-point to integer conversion must also be made explicit. An integer type can be initialized with a `Double` or `Float` value:\n\n\n\n```\nlet integerPi = Int(pi)\n\/\/ integerPi equals 3, and is inferred to be of type Int\n\n```\n\nFloating-point values are always truncated when used to initialize a new integer value in this way. This means that `4.75` becomes `4`, and `-3.9` becomes `-3`.\n\nNote\n\nThe rules for combining numeric constants and variables are different from the rules for numeric literals. The literal value `3` can be added directly to the literal value `0.14159`, because number literals don’t have an explicit type in and of themselves. Their type is inferred only at the point that they’re evaluated by the compiler.\n\n## [Type Aliases](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Type-Aliases)\n\n*Type aliases* define an alternative name for an existing type. You define type aliases with the `typealias` keyword.\n\nType aliases are useful when you want to refer to an existing type by a name that’s contextually more appropriate, such as when working with data of a specific size from an external source:\n\n\n\n```\ntypealias AudioSample = UInt16\n\n```\n\nOnce you define a type alias, you can use the alias anywhere you might use the original name:\n\n\n\n```\nvar maxAmplitudeFound = AudioSample.min\n\/\/ maxAmplitudeFound is now 0\n\n```\n\nHere, `AudioSample` is defined as an alias for `UInt16`. Because it’s an alias, the call to `AudioSample.min` actually calls `UInt16.min`, which provides an initial value of `0` for the `maxAmplitudeFound` variable.\n\n## [Booleans](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Booleans)\n\nSwift has a basic *Boolean* type, called `Bool`. Boolean values are referred to as *logical*, because they can only ever be true or false. Swift provides two Boolean constant values, `true` and `false`:\n\n\n\n```\nlet orangesAreOrange = true\nlet turnipsAreDelicious = false\n\n```\n\nThe types of `orangesAreOrange` and `turnipsAreDelicious` have been inferred as `Bool` from the fact that they were initialized with Boolean literal values. As with `Int` and `Double` above, you don’t need to declare constants or variables as `Bool` if you set them to `true` or `false` as soon as you create them.\n\nBoolean values are particularly useful when you work with conditional statements such as the `if` statement:\n\n\n\n```\nif turnipsAreDelicious {\n    print(\"Mmm, tasty turnips!\")\n} else {\n    print(\"Eww, turnips are horrible.\")\n}\n\/\/ Prints \"Eww, turnips are horrible.\"\n\n```\n\nConditional statements such as the `if` statement are covered in more detail in [Control Flow](\/swift-book\/documentation\/the-swift-programming-language\/controlflow).\n\nSwift’s type safety prevents non-Boolean values from being substituted for `Bool`. The following example reports a compile-time error:\n\n\n\n```\nlet i = 1\nif i {\n    \/\/ this example will not compile, and will report an error\n}\n\n```\n\nHowever, the alternative example below is valid:\n\n\n\n```\nlet i = 1\nif i == 1 {\n    \/\/ this example will compile successfully\n}\n\n```\n\nThe result of the `i == 1` comparison is of type `Bool`, and so this second example passes the type checking. Comparisons like `i == 1` are discussed in [Basic Operators](\/swift-book\/documentation\/the-swift-programming-language\/basicoperators).\n\nAs with other examples of type safety in Swift, this approach avoids accidental errors and ensures that the intention of a particular section of code is always clear.\n\n## [Tuples](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Tuples)\n\n*Tuples* group multiple values into a single compound value. The values within a tuple can be of any type and don’t have to be of the same type as each other.\n\nIn this example, `(404, \"Not Found\")` is a tuple that describes an *HTTP status code*. An HTTP status code is a special value returned by a web server whenever you request a web page. A status code of `404 Not Found` is returned if you request a webpage that doesn’t exist.\n\n\n\n```\nlet http404Error = (404, \"Not Found\")\n\/\/ http404Error is of type (Int, String), and equals (404, \"Not Found\")\n\n```\n\nThe `(404, \"Not Found\")` tuple groups together an `Int` and a `String` to give the HTTP status code two separate values: a number and a human-readable description. It can be described as “a tuple of type `(Int, String)`”.\n\nYou can create tuples from any permutation of types, and they can contain as many different types as you like. There’s nothing stopping you from having a tuple of type `(Int, Int, Int)`, or `(String, Bool)`, or indeed any other permutation you require.\n\nYou can *decompose* a tuple’s contents into separate constants or variables, which you then access as usual:\n\n\n\n```\nlet (statusCode, statusMessage) = http404Error\nprint(\"The status code is (statusCode)\")\n\/\/ Prints \"The status code is 404\".\nprint(\"The status message is (statusMessage)\")\n\/\/ Prints \"The status message is Not Found\".\n\n```\n\nIf you only need some of the tuple’s values, ignore parts of the tuple with an underscore (`_`) when you decompose the tuple:\n\n\n\n```\nlet (justTheStatusCode, _) = http404Error\nprint(\"The status code is (justTheStatusCode)\")\n\/\/ Prints \"The status code is 404\".\n\n```\n\nAlternatively, access the individual element values in a tuple using index numbers starting at zero:\n\n\n\n```\nprint(\"The status code is (http404Error.0)\")\n\/\/ Prints \"The status code is 404\".\nprint(\"The status message is (http404Error.1)\")\n\/\/ Prints \"The status message is Not Found\".\n\n```\n\nYou can name the individual elements in a tuple when the tuple is defined:\n\n\n\n```\nlet http200Status = (statusCode: 200, description: \"OK\")\n\n```\n\nIf you name the elements in a tuple, you can use the element names to access the values of those elements:\n\n\n\n```\nprint(\"The status code is (http200Status.statusCode)\")\n\/\/ Prints \"The status code is 200\".\nprint(\"The status message is (http200Status.description)\")\n\/\/ Prints \"The status message is OK\".\n\n```\n\nTuples are particularly useful as the return values of functions. A function that tries to retrieve a web page might return the `(Int, String)` tuple type to describe the success or failure of the page retrieval. By returning a tuple with two distinct values, each of a different type, the function provides more useful information about its outcome than if it could only return a single value of a single type. For more information, see [Functions with Multiple Return Values](\/swift-book\/documentation\/the-swift-programming-language\/functions#Functions-with-Multiple-Return-Values).\n\nNote\n\nTuples are useful for simple groups of related values. They’re not suited to the creation of complex data structures. If your data structure is likely to be more complex, model it as a class or structure, rather than as a tuple. For more information, see [Structures and Classes](\/swift-book\/documentation\/the-swift-programming-language\/classesandstructures).\n\n## [Optionals](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Optionals)\n\nYou use *optionals* in situations where a value may be absent. An optional represents two possibilities: Either there *is* a value of a specified type, and you can unwrap the optional to access that value, or there *isn’t* a value at all.\n\nAs an example of a value that might be missing, Swift’s `Int` type has an initializer that tries to convert a `String` value into an `Int` value. However, only some strings can be converted into integers. The string `\"123\"` can be converted into the numeric value `123`, but the string `\"hello, world\"` doesn’t have a corresponding numeric value. The example below uses the initializer to try to convert a `String` into an `Int`:\n\n\n\n```\nlet possibleNumber = \"123\"\nlet convertedNumber = Int(possibleNumber)\n\/\/ The type of convertedNumber is \"optional Int\"\n\n```\n\nBecause the initializer in the code above might fail, it returns an *optional* `Int`, rather than an `Int`.\n\nTo write an optional type, you write a question mark (`?`) after the name of the type that the optional contains — for example, the type of an optional `Int` is `Int?`. An optional `Int` always contains either some `Int` value or no value at all. It can’t contain anything else, like a `Bool` or `String` value.\n\n### [nil](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#nil)\n\nYou set an optional variable to a valueless state by assigning it the special value `nil`:\n\n\n\n```\nvar serverResponseCode: Int? = 404\n\/\/ serverResponseCode contains an actual Int value of 404\nserverResponseCode = nil\n\/\/ serverResponseCode now contains no value\n\n```\n\nIf you define an optional variable without providing a default value, the variable is automatically set to `nil`:\n\n\n\n```\nvar surveyAnswer: String?\n\/\/ surveyAnswer is automatically set to nil\n\n```\n\nYou can use an `if` statement to find out whether an optional contains a value by comparing the optional against `nil`. You perform this comparison with the “equal to” operator (`==`) or the “not equal to” operator (`!=`).\n\nIf an optional has a value, it’s considered as “not equal to” `nil`:\n\n\n\n```\nlet possibleNumber = \"123\"\nlet convertedNumber = Int(possibleNumber)\n\n\nif convertedNumber != nil {\n    print(\"convertedNumber contains some integer value.\")\n}\n\/\/ Prints \"convertedNumber contains some integer value.\"\n\n```\n\nYou can’t use `nil` with non-optional constants or variables. If a constant or variable in your code needs to work with the absence of a value under certain conditions, declare it as an optional value of the appropriate type. A constant or variable that’s declared as a non-optional value is guaranteed to never contain a `nil` value. If you try to assign `nil` to a non-optional value, you’ll get a compile-time error.\n\nThis separation of optional and non-optional values lets you explicitly mark what information can be missing, and makes it easier to write code that handle missing values. You can’t accidentally treat an optional as if it were non-optional because this mistake produces an error at compile time. After you unwrap the value, none of the other code that works with that value needs to check for `nil`, so there’s no need to repeatedly check the same value in different parts of your code.\n\nWhen you access an optional value, your code always handles both the `nil` and non-`nil` case. There are several things you can do when a value is missing, as described in the following sections:\n\n- Skip the code that operates on the value when it’s `nil`.\n\n- Propagate the `nil` value, by returning `nil` or using the `?.` operator described in [Optional Chaining](\/swift-book\/documentation\/the-swift-programming-language\/optionalchaining).\n\n- Provide a fallback value, using the `??` operator.\n\n- Stop program execution, using the `!` operator.\n\nNote\n\n In Objective-C, `nil` is a pointer to a nonexistent object. In Swift, `nil` isn’t a pointer — it’s the absence of a value of a certain type. Optionals of *any* type can be set to `nil`, not just object types.\n\n### [Optional Binding](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Optional-Binding)\n\nYou use optional binding to find out whether an optional contains a value, and if so, to make that value available as a temporary constant or variable. Optional binding can be used with `if`, `guard`, and `while` statements to check for a value inside an optional, and to extract that value into a constant or variable, as part of a single action. For more information about `if`, `guard`, and `while` statements, see [Control Flow](\/swift-book\/documentation\/the-swift-programming-language\/controlflow).\n\nWrite an optional binding for an `if` statement as follows:\n\n\n\n```\nif let <#constantName#> = <#someOptional#> {\n   <#statements#>\n}\n\n```\n\nYou can rewrite the `possibleNumber` example from the [Optionals](\/swift-book\/documentation\/the-swift-programming-language\/thebasics#Optionals) section to use optional binding rather than forced unwrapping:\n\n\n\n```\nif let actualNumber = Int(possibleNumber) {\n    print(\"The string \"(possibleNumber)\" has an integer value of (actualNumber)\")\n} else {\n    print(\"The string \"(possibleNumber)\" couldn't be converted to an integer\")\n}\n\/\/ Prints \"The string \"123\" has an integer value of 123\".\n\n```\n\nThis code can be read as:\n\n“If the optional `Int` returned by `Int(possibleNumber)` contains a value, set a new constant called `actualNumber` to the value contained in the optional.”\n\nIf the conversion is successful, the `actualNumber` constant becomes available for use within the first branch of the `if` statement. It has already been initialized with the value contained within the optional, and has the corresponding non-optional type. In this case, the type of `possibleNumber` is `Int?`, so the type of `actualNumber` is `Int`.\n\nIf you don’t need to refer to the original, optional constant or variable after accessing the value it contains, you can use the same name for the new constant or variable:\n\n\n\n```\nlet myNumber = Int(possibleNumber)\n\/\/ Here, myNumber is an optional integer\nif let myNumber = myNumber {\n    \/\/ Here, myNumber is a non-optional integer\n    print(\"My number is (myNumber)\")\n}\n\/\/ Prints \"My number is 123\".\n\n```\n\nThis code starts by checking whether `myNumber` contains a value, just like the code in the previous example. If `myNumber` has a value, the value of a new constant named `myNumber` is set to that value. Inside the body of the `if` statement, writing `myNumber` refers to that new non-optional constant. Writing `myNumber` before or after the `if` statement refers to the original optional integer constant.\n\nBecause this kind of code is so common, you can use a shorter spelling to unwrap an optional value: Write just the name of the constant or variable that you’re unwrapping. The new, unwrapped constant or variable implicitly uses the same name as the optional value.\n\n\n\n```\nif let myNumber {\n    print(\"My number is (myNumber)\")\n}\n\/\/ Prints \"My number is 123\".\n\n```\n\nYou can use both constants and variables with optional binding. If you wanted to manipulate the value of `myNumber` within the first branch of the `if` statement, you could write `if var myNumber` instead, and the value contained within the optional would be made available as a variable rather than a constant. Changes you make to `myNumber` inside the body of the `if` statement apply only to that local variable, *not* to the original, optional constant or variable that you unwrapped.\n\nYou can include as many optional bindings and Boolean conditions in a single `if` statement as you need to, separated by commas. If any of the values in the optional bindings are `nil` or any Boolean condition evaluates to `false`, the whole `if` statement’s condition is considered to be `false`. The following `if` statements are equivalent:\n\n\n\n```\nif let firstNumber = Int(\"4\"), let secondNumber = Int(\"42\"), firstNumber < secondNumber && secondNumber < 100 {\n    print(\"(firstNumber) < (secondNumber) < 100\")\n}\n\/\/ Prints \"4 < 42 < 100\".\n\n\nif let firstNumber = Int(\"4\") {\n    if let secondNumber = Int(\"42\") {\n        if firstNumber < secondNumber && secondNumber < 100 {\n            print(\"(firstNumber) < (secondNumber) < 100\")\n        }\n    }\n}\n\/\/ Prints \"4 < 42 < 100\".\n\n```\n\nConstants and variables created with optional binding in an `if` statement are available only within the body of the `if` statement. In contrast, the constants and variables created with a `guard` statement are available in the lines of code that follow the `guard` statement, as described in [Early Exit](\/swift-book\/documentation\/the-swift-programming-language\/controlflow#Early-Exit).\n\n### [Providing a Fallback Value](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Providing-a-Fallback-Value)\n\nAnother way to handle a missing value is to supply a default value using the nil-coalescing operator (`??`). If the optional on the left of the `??` isn’t `nil`, that value is unwrapped and used. Otherwise, the value on the right of `??` is used. For example, the code below greets someone by name if one is specified, and uses a generic greeting when the name is `nil`.\n\n\n\n```\nlet name: String? = nil\nlet greeting = \"Hello, \" + (name ?? \"friend\") + \"!\"\nprint(greeting)\n\/\/ Prints \"Hello, friend!\"\n\n```\n\nFor more information about using `??` to provide a fallback value, see [Nil-Coalescing Operator](\/swift-book\/documentation\/the-swift-programming-language\/basicoperators#Nil-Coalescing-Operator).\n\n### [Force Unwrapping](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Force-Unwrapping)\n\nWhen `nil` represents an unrecoverable failure, such as a programmer error or corrupted state, you can access the underlying value by adding an exclamation mark (`!`) to the end of the optional’s name. This is known as *force unwrapping* the optional’s value. When you force unwrap a non-`nil` value, the result is its unwrapped value. Force unwrapping a `nil` value triggers a runtime error.\n\nThe `!` is, effectively, a shorter spelling of [`fatalError(_:file:line:)`](https:\/\/developer.apple.com\/documentation\/swift\/fatalerror(_:file:line:)). For example, the code below shows two equivalent approaches:\n\n\n\n```\nlet possibleNumber = \"123\"\nlet convertedNumber = Int(possibleNumber)\n\n\nlet number = convertedNumber!\n\n\nguard let number = convertedNumber else {\n    fatalError(\"The number was invalid\")\n}\n\n```\n\nBoth versions of the code above depend on `convertedNumber` always containing a value. Writing that requirement as part of the code, using either of the approaches above, lets your code check that the requirement is true at runtime.\n\nFor more information about enforcing data requirements and checking assumptions at runtime, see [Assertions and Preconditions](\/swift-book\/documentation\/the-swift-programming-language\/thebasics#Assertions-and-Preconditions).\n\n### [Implicitly Unwrapped Optionals](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Implicitly-Unwrapped-Optionals)\n\nAs described above, optionals indicate that a constant or variable is allowed to have “no value”. Optionals can be checked with an `if` statement to see if a value exists, and can be conditionally unwrapped with optional binding to access the optional’s value if it does exist.\n\nSometimes it’s clear from a program’s structure that an optional will *always* have a value, after that value is first set. In these cases, it’s useful to remove the need to check and unwrap the optional’s value every time it’s accessed, because it can be safely assumed to have a value all of the time.\n\nThese kinds of optionals are defined as *implicitly unwrapped optionals*. You write an implicitly unwrapped optional by placing an exclamation point (`String!`) rather than a question mark (`String?`) after the type that you want to make optional. Rather than placing an exclamation point after the optional’s name when you use it, you place an exclamation point after the optional’s type when you declare it.\n\nImplicitly unwrapped optionals are useful when an optional’s value is confirmed to exist immediately after the optional is first defined and can definitely be assumed to exist at every point thereafter. The primary use of implicitly unwrapped optionals in Swift is during class initialization, as described in [Unowned References and Implicitly Unwrapped Optional Properties](\/swift-book\/documentation\/the-swift-programming-language\/automaticreferencecounting#Unowned-References-and-Implicitly-Unwrapped-Optional-Properties).\n\nDon’t use an implicitly unwrapped optional when there’s a possibility of a variable becoming `nil` at a later point. Always use a normal optional type if you need to check for a `nil` value during the lifetime of a variable.\n\nAn implicitly unwrapped optional is a normal optional behind the scenes, but can also be used like a non-optional value, without the need to unwrap the optional value each time it’s accessed. The following example shows the difference in behavior between an optional string and an implicitly unwrapped optional string when accessing their wrapped value as an explicit `String`:\n\n\n\n```\nlet possibleString: String? = \"An optional string.\"\nlet forcedString: String = possibleString! \/\/ Requires explicit unwrapping\n\n\nlet assumedString: String! = \"An implicitly unwrapped optional string.\"\nlet implicitString: String = assumedString \/\/ Unwrapped automatically\n\n```\n\nYou can think of an implicitly unwrapped optional as giving permission for the optional to be force-unwrapped if needed. When you use an implicitly unwrapped optional value, Swift first tries to use it as an ordinary optional value; if it can’t be used as an optional, Swift force-unwraps the value. In the code above, the optional value `assumedString` is force-unwrapped before assigning its value to `implicitString` because `implicitString` has an explicit, non-optional type of `String`. In code below, `optionalString` doesn’t have an explicit type so it’s an ordinary optional.\n\n\n\n```\nlet optionalString = assumedString\n\/\/ The type of optionalString is \"String?\" and assumedString isn't force-unwrapped.\n\n```\n\nIf an implicitly unwrapped optional is `nil` and you try to access its wrapped value, you’ll trigger a runtime error. The result is exactly the same as if you write an exclamation point to force unwrap a normal optional that doesn’t contain a value.\n\nYou can check whether an implicitly unwrapped optional is `nil` the same way you check a normal optional:\n\n\n\n```\nif assumedString != nil {\n    print(assumedString!)\n}\n\/\/ Prints \"An implicitly unwrapped optional string.\"\n\n```\n\nYou can also use an implicitly unwrapped optional with optional binding, to check and unwrap its value in a single statement:\n\n\n\n```\nif let definiteString = assumedString {\n    print(definiteString)\n}\n\/\/ Prints \"An implicitly unwrapped optional string.\"\n\n```\n\n## [Memory Safety](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Memory-Safety)\n\nIn addition to the checks that prevent type mismatches, described above in [Type Safety and Type Inference](\/swift-book\/documentation\/the-swift-programming-language\/thebasics#Type-Safety-and-Type-Inference), Swift also protects code against working with invalid memory. This protection is known as *memory safety* and includes the following requirements:\n\n- Values are set before being read. The protection against interacting with uninitialized regions of memory is also known as *definite initialization*.\n\n- Arrays and buffers are accessed only at valid indexes. The protection against out-of-bounds access is also known as *bounds safety*.\n\n- Memory is accessed only during the value’s lifetime. The protection against use-after-free errors is also known as *lifetime safety*.\n\n- Access to memory overlaps only in provably safe ways. The protection against possible data races in concurrent code is also known as *thread safety*.\n\nIf you’ve worked in languages that don’t provide these guarantees, you may be familiar with some of the errors and bugs named in the list above. If you haven’t encountered these issues, that’s ok; safe code in Swift avoids these problems. For information about how Swift ensures you set initial values, see [Initialization](\/swift-book\/documentation\/the-swift-programming-language\/initialization), for information about how Swift checks memory safety in concurrent code, see [Concurrency](\/swift-book\/documentation\/the-swift-programming-language\/concurrency), and for information about how Swift checks overlapping accesses to memory, see [Memory Safety](\/swift-book\/documentation\/the-swift-programming-language\/memorysafety).\n\nSometimes you need to work outside of the bounds of safety — for example, because of limitations of the language or standard library — so Swift also provides unsafe versions of some APIs. When you use types or methods whose name includes words such as “unsafe”, “unchecked”, or “unmanaged”, you take on the responsibility for safety.\n\nSafe code in Swift can still encounter errors and unexpected failures, which might stop the program’s execution. Safety doesn’t ensure that your code runs to completion. Swift provides several ways to indicate and recover from errors, discussed in [Error Handling](\/swift-book\/documentation\/the-swift-programming-language\/thebasics#Error-Handling) and [Assertions and Preconditions](\/swift-book\/documentation\/the-swift-programming-language\/thebasics#Assertions-and-Preconditions) below. However, in some cases, the *only* safe way to handle an error is to stop execution. If you need to guarantee that a service never unexpected stops, incorporate fault tolerance into its overall architecture, so it can recover from any of its components stopping unexpectedly.\n\n## [Error Handling](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Error-Handling)\n\nYou use *error handling* to respond to error conditions your program may encounter during execution.\n\nIn contrast to optionals, which can use the presence or absence of a value to communicate success or failure of a function, error handling allows you to determine the underlying cause of failure, and, if necessary, propagate the error to another part of your program.\n\nWhen a function encounters an error condition, it *throws* an error. That function’s caller can then *catch* the error and respond appropriately.\n\n\n\n```\nfunc canThrowAnError() throws {\n    \/\/ this function may or may not throw an error\n}\n\n```\n\nA function indicates that it can throw an error by including the `throws` keyword in its declaration. When you call a function that can throw an error, you prepend the `try` keyword to the expression.\n\nSwift automatically propagates errors out of their current scope until they’re handled by a `catch` clause.\n\n\n\n```\ndo {\n    try canThrowAnError()\n    \/\/ no error was thrown\n} catch {\n    \/\/ an error was thrown\n}\n\n```\n\nA `do` statement creates a new containing scope, which allows errors to be propagated to one or more `catch` clauses.\n\nHere’s an example of how error handling can be used to respond to different error conditions:\n\n\n\n```\nfunc makeASandwich() throws {\n    \/\/ ...\n}\n\n\ndo {\n    try makeASandwich()\n    eatASandwich()\n} catch SandwichError.outOfCleanDishes {\n    washDishes()\n} catch SandwichError.missingIngredients(let ingredients) {\n    buyGroceries(ingredients)\n}\n\n```\n\nIn this example, the `makeASandwich()` function will throw an error if no clean dishes are available or if any ingredients are missing. Because `makeASandwich()` can throw an error, the function call is wrapped in a `try` expression. By wrapping the function call in a `do` statement, any errors that are thrown will be propagated to the provided `catch` clauses.\n\nIf no error is thrown, the `eatASandwich()` function is called. If an error is thrown and it matches the `SandwichError.outOfCleanDishes` case, then the `washDishes()` function will be called. If an error is thrown and it matches the `SandwichError.missingIngredients` case, then the `buyGroceries(_:)` function is called with the associated `[String]` value captured by the `catch` pattern.\n\nThrowing, catching, and propagating errors is covered in greater detail in [Error Handling](\/swift-book\/documentation\/the-swift-programming-language\/errorhandling).\n\n## [Assertions and Preconditions](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Assertions-and-Preconditions)\n\n*Assertions* and *preconditions* are checks that happen at runtime. You use them to make sure an essential condition is satisfied before executing any further code. If the Boolean condition in the assertion or precondition evaluates to `true`, code execution continues as usual. If the condition evaluates to `false`, the current state of the program is invalid; code execution ends, and your app is terminated.\n\nYou use assertions and preconditions to express the assumptions you make and the expectations you have while coding, so you can include them as part of your code. Assertions help you find mistakes and incorrect assumptions during development, and preconditions help you detect issues in production.\n\nIn addition to verifying your expectations at runtime, assertions and preconditions also become a useful form of documentation within the code. Unlike the error conditions discussed in [Error Handling](\/swift-book\/documentation\/the-swift-programming-language\/thebasics#Error-Handling) above, assertions and preconditions aren’t used for recoverable or expected errors. Because a failed assertion or precondition indicates an invalid program state, there’s no way to catch a failed assertion. Recovering from an invalid state is impossible. When an assertion fails, at least one piece of the program’s data is invalid — but you don’t know why it’s invalid or whether an additional state is also invalid.\n\nUsing assertions and preconditions isn’t a substitute for designing your code in such a way that invalid conditions are unlikely to arise. However, using them to enforce valid data and state causes your app to terminate more predictably if an invalid state occurs, and helps make the problem easier to debug. When assumptions aren’t checked, you might not notice this kind problem until much later when code elsewhere starts failing visibly, and after user data has been silently corrupted. Stopping execution as soon as an invalid state is detected also helps limit the damage caused by that invalid state.\n\nThe difference between assertions and preconditions is in when they’re checked: Assertions are checked only in debug builds, but preconditions are checked in both debug and production builds. In production builds, the condition inside an assertion isn’t evaluated. This means you can use as many assertions as you want during your development process, without impacting performance in production.\n\n### [Debugging with Assertions](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Debugging-with-Assertions)\n\nYou write an assertion by calling the [`assert(_:_:file:line:)`](https:\/\/developer.apple.com\/documentation\/swift\/1541112-assert) function from the Swift standard library. You pass this function an expression that evaluates to `true` or `false` and a message to display if the result of the condition is `false`. For example:\n\n\n\n```\nlet age = -3\nassert(age >= 0, \"A person's age can't be less than zero.\")\n\/\/ This assertion fails because -3 isn't >= 0.\n\n```\n\nIn this example, code execution continues if `age >= 0` evaluates to `true`, that is, if the value of `age` is nonnegative. If the value of `age` is negative, as in the code above, then `age >= 0` evaluates to `false`, and the assertion fails, terminating the application.\n\nYou can omit the assertion message — for example, when it would just repeat the condition as prose.\n\n\n\n```\nassert(age >= 0)\n\n```\n\nIf the code already checks the condition, you use the [`assertionFailure(_:file:line:)`](https:\/\/developer.apple.com\/documentation\/swift\/1539616-assertionfailure) function to indicate that an assertion has failed. For example:\n\n\n\n```\nif age > 10 {\n    print(\"You can ride the roller-coaster or the ferris wheel.\")\n} else if age >= 0 {\n    print(\"You can ride the ferris wheel.\")\n} else {\n    assertionFailure(\"A person's age can't be less than zero.\")\n}\n\n```\n\n### [Enforcing Preconditions](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Enforcing-Preconditions)\n\nUse a precondition whenever a condition has the potential to be false, but must *definitely* be true for your code to continue execution. For example, use a precondition to check that a subscript isn’t out of bounds, or to check that a function has been passed a valid value.\n\nYou write a precondition by calling the [`precondition(_:_:file:line:)`](https:\/\/developer.apple.com\/documentation\/swift\/1540960-precondition) function. You pass this function an expression that evaluates to `true` or `false` and a message to display if the result of the condition is `false`. For example:\n\n\n\n```\n\/\/ In the implementation of a subscript...\nprecondition(index > 0, \"Index must be greater than zero.\")\n\n```\n\nYou can also call the [`preconditionFailure(_:file:line:)`](https:\/\/developer.apple.com\/documentation\/swift\/1539374-preconditionfailure) function to indicate that a failure has occurred — for example, if the default case of a switch was taken, but all valid input data should have been handled by one of the switch’s other cases.\n\nNote\n\nIf you compile in unchecked mode (`-Ounchecked`), preconditions aren’t checked. The compiler assumes that preconditions are always true, and it optimizes your code accordingly. However, the `fatalError(_:file:line:)` function always halts execution, regardless of optimization settings.\n\nYou can use the `fatalError(_:file:line:)` function during prototyping and early development to create stubs for functionality that hasn’t been implemented yet, by writing `fatalError(\"Unimplemented\")` as the stub implementation. Because fatal errors are never optimized out, unlike assertions or preconditions, you can be sure that execution always halts if it encounters a stub implementation.\n\n- [ The Basics ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#app-top)\n\n- [ Constants and Variables ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Constants-and-Variables)\n\n- [ Declaring Constants and Variables ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Declaring-Constants-and-Variables)\n\n- [ Type Annotations ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Type-Annotations)\n\n- [ Naming Constants and Variables ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Naming-Constants-and-Variables)\n\n- [ Printing Constants and Variables ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Printing-Constants-and-Variables)\n\n- [ Comments ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Comments)\n\n- [ Semicolons ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Semicolons)\n\n- [ Integers ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Integers)\n\n- [ Integer Bounds ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Integer-Bounds)\n\n- [ Int ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Int)\n\n- [ UInt ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#UInt)\n\n- [ Floating-Point Numbers ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Floating-Point-Numbers)\n\n- [ Type Safety and Type Inference ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Type-Safety-and-Type-Inference)\n\n- [ Numeric Literals ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Numeric-Literals)\n\n- [ Numeric Type Conversion ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Numeric-Type-Conversion)\n\n- [ Integer Conversion ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Integer-Conversion)\n\n- [ Integer and Floating-Point Conversion ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Integer-and-Floating-Point-Conversion)\n\n- [ Type Aliases ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Type-Aliases)\n\n- [ Booleans ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Booleans)\n\n- [ Tuples ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Tuples)\n\n- [ Optionals ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Optionals)\n\n- [ nil ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#nil)\n\n- [ Optional Binding ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Optional-Binding)\n\n- [ Providing a Fallback Value ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Providing-a-Fallback-Value)\n\n- [ Force Unwrapping ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Force-Unwrapping)\n\n- [ Implicitly Unwrapped Optionals ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Implicitly-Unwrapped-Optionals)\n\n- [ Memory Safety ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Memory-Safety)\n\n- [ Error Handling ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Error-Handling)\n\n- [ Assertions and Preconditions ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Assertions-and-Preconditions)\n\n- [ Debugging with Assertions ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Debugging-with-Assertions)\n\n- [ Enforcing Preconditions ](\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/#Enforcing-Preconditions)",
  "sections" : [
    {
      "content" : "",
      "title" : "Constants and Variables"
    },
    {
      "content" : "",
      "title" : "Comments"
    },
    {
      "content" : "",
      "title" : "Semicolons"
    },
    {
      "content" : "",
      "title" : "Integers"
    },
    {
      "content" : "",
      "title" : "Floating-Point Numbers"
    },
    {
      "content" : "",
      "title" : "Type Safety and Type Inference"
    },
    {
      "content" : "",
      "title" : "Numeric Literals"
    },
    {
      "content" : "",
      "title" : "Numeric Type Conversion"
    },
    {
      "content" : "",
      "title" : "Type Aliases"
    },
    {
      "content" : "",
      "title" : "Booleans"
    },
    {
      "content" : "",
      "title" : "Tuples"
    },
    {
      "content" : "",
      "title" : "Optionals"
    },
    {
      "content" : "",
      "title" : "Memory Safety"
    },
    {
      "content" : "",
      "title" : "Error Handling"
    },
    {
      "content" : "",
      "title" : "Assertions and Preconditions"
    }
  ],
  "source" : "swiftOrg",
  "title" : "The Basics | Documentation",
  "url" : "https:\/\/docs.swift.org\/swift-book\/documentation\/the-swift-programming-language\/thebasics\/"
}