{
  "abstract" : "Set the initial values for a type’s stored properties and perform one-time setup.",
  "codeExamples" : [

  ],
  "contentHash" : "9c0f8bc9f17ecb917761fb09a5076517a7ca125bf4fcc5de0b3e0ce9bc6dd309",
  "crawledAt" : "2025-12-02T19:37:32Z",
  "declaration" : {
    "code" : "struct Fahrenheit {\n    var temperature: Double\n    init() {\n        temperature = 32.0\n    }\n}\nvar f = Fahrenheit()\nprint(\"The default temperature is \\(f.temperature)° Fahrenheit\")\n\/\/ Prints \"The default temperature is 32.0° Fahrenheit\".",
    "language" : "swift"
  },
  "id" : "3E765694-B385-4F37-B3E5-9328DA89C4BC",
  "kind" : "class",
  "overview" : "The Swift Programming Language (6.2.1)  Initialization  Initialization InitializationSet the initial values for a type’s stored properties and perform one-time setup.Initialization is the process of preparing an instance of a class, structure, or enumeration for use. This process involves setting an initial value for each stored property on that instance and performing any other setup or initialization that’s required before the new instance is ready for use.\n\nYou implement this initialization process by defining initializers, which are like special methods that can be called to create a new instance of a particular type. Unlike Objective-C initializers, Swift initializers don’t return a value. Their primary role is to ensure that new instances of a type are correctly initialized before they’re used for the first time.\n\nInstances of class types can also implement a deinitializer, which performs any custom cleanup just before an instance of that class is deallocated. For more information about deinitializers, see Deinitialization.",
  "rawMarkdown" : "---\nsource: https:\/\/docs.swift.org\/swift-book\/documentation\/the-swift-programming-language\/initialization\/\ncrawled: 2025-12-02T19:37:32Z\n---\n\n# Initialization | Documentation\n\n- [ The Swift Programming Language (6.2.1) ](\/swift-book\/documentation\/the-swift-programming-language)\n\n- [ Initialization ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/)\n\n- [ Initialization ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/)\n\n# Initialization\n\nSet the initial values for a type’s stored properties and perform one-time setup.*Initialization* is the process of preparing an instance of a class, structure, or enumeration for use. This process involves setting an initial value for each stored property on that instance and performing any other setup or initialization that’s required before the new instance is ready for use.\n\nYou implement this initialization process by defining *initializers*, which are like special methods that can be called to create a new instance of a particular type. Unlike Objective-C initializers, Swift initializers don’t return a value. Their primary role is to ensure that new instances of a type are correctly initialized before they’re used for the first time.\n\nInstances of class types can also implement a *deinitializer*, which performs any custom cleanup just before an instance of that class is deallocated. For more information about deinitializers, see [Deinitialization](\/swift-book\/documentation\/the-swift-programming-language\/deinitialization).\n\n## [Setting Initial Values for Stored Properties](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Setting-Initial-Values-for-Stored-Properties)\n\nClasses and structures *must* set all of their stored properties to an appropriate initial value by the time an instance of that class or structure is created. Stored properties can’t be left in an indeterminate state.\n\nYou can set an initial value for a stored property within an initializer, or by assigning a default property value as part of the property’s definition. These actions are described in the following sections.\n\nNote\n\nWhen you assign a default value to a stored property, or set its value within an initializer, the value of that property is set directly, without calling any property observers.\n\n### [Initializers](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Initializers)\n\n*Initializers* are called to create a new instance of a particular type. In its simplest form, an initializer is like an instance method with no parameters, written using the `init` keyword:\n\n\n\n```\ninit() {\n    \/\/ perform some initialization here\n}\n\n```\n\nThe example below defines a new structure called `Fahrenheit` to store temperatures expressed in the Fahrenheit scale. The `Fahrenheit` structure has one stored property, `temperature`, which is of type `Double`:\n\n\n\n```\nstruct Fahrenheit {\n    var temperature: Double\n    init() {\n        temperature = 32.0\n    }\n}\nvar f = Fahrenheit()\nprint(\"The default temperature is (f.temperature)° Fahrenheit\")\n\/\/ Prints \"The default temperature is 32.0° Fahrenheit\".\n\n```\n\nThe structure defines a single initializer, `init`, with no parameters, which initializes the stored temperature with a value of `32.0` (the freezing point of water in degrees Fahrenheit).\n\n### [Default Property Values](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Default-Property-Values)\n\nYou can set the initial value of a stored property from within an initializer, as shown above. Alternatively, specify a *default property value* as part of the property’s declaration. You specify a default property value by assigning an initial value to the property when it’s defined.\n\nNote\n\nIf a property always takes the same initial value, provide a default value rather than setting a value within an initializer. The end result is the same, but the default value ties the property’s initialization more closely to its declaration. It makes for shorter, clearer initializers and enables you to infer the type of the property from its default value. The default value also makes it easier for you to take advantage of default initializers and initializer inheritance, as described later in this chapter.\n\nYou can write the `Fahrenheit` structure from above in a simpler form by providing a default value for its `temperature` property at the point that the property is declared:\n\n\n\n```\nstruct Fahrenheit {\n    var temperature = 32.0\n}\n\n```\n\n## [Customizing Initialization](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Customizing-Initialization)\n\nYou can customize the initialization process with input parameters and optional property types, or by assigning constant properties during initialization, as described in the following sections.\n\n### [Initialization Parameters](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Initialization-Parameters)\n\nYou can provide *initialization parameters* as part of an initializer’s definition, to define the types and names of values that customize the initialization process. Initialization parameters have the same capabilities and syntax as function and method parameters.\n\nThe following example defines a structure called `Celsius`, which stores temperatures expressed in degrees Celsius. The `Celsius` structure implements two custom initializers called `init(fromFahrenheit:)` and `init(fromKelvin:)`, which initialize a new instance of the structure with a value from a different temperature scale:\n\n\n\n```\nstruct Celsius {\n    var temperatureInCelsius: Double\n    init(fromFahrenheit fahrenheit: Double) {\n        temperatureInCelsius = (fahrenheit - 32.0) \/ 1.8\n    }\n    init(fromKelvin kelvin: Double) {\n        temperatureInCelsius = kelvin - 273.15\n    }\n}\nlet boilingPointOfWater = Celsius(fromFahrenheit: 212.0)\n\/\/ boilingPointOfWater.temperatureInCelsius is 100.0\nlet freezingPointOfWater = Celsius(fromKelvin: 273.15)\n\/\/ freezingPointOfWater.temperatureInCelsius is 0.0\n\n```\n\nThe first initializer has a single initialization parameter with an argument label of `fromFahrenheit` and a parameter name of `fahrenheit`. The second initializer has a single initialization parameter with an argument label of `fromKelvin` and a parameter name of `kelvin`. Both initializers convert their single argument into the corresponding Celsius value and store this value in a property called `temperatureInCelsius`.\n\n### [Parameter Names and Argument Labels](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Parameter-Names-and-Argument-Labels)\n\nAs with function and method parameters, initialization parameters can have both a parameter name for use within the initializer’s body and an argument label for use when calling the initializer.\n\nHowever, initializers don’t have an identifying function name before their parentheses in the way that functions and methods do. Therefore, the names and types of an initializer’s parameters play a particularly important role in identifying which initializer should be called. Because of this, Swift provides an automatic argument label for *every* parameter in an initializer if you don’t provide one.\n\nThe following example defines a structure called `Color`, with three constant properties called `red`, `green`, and `blue`. These properties store a value between `0.0` and `1.0` to indicate the amount of red, green, and blue in the color.\n\n`Color` provides an initializer with three appropriately named parameters of type `Double` for its red, green, and blue components. `Color` also provides a second initializer with a single `white` parameter, which is used to provide the same value for all three color components.\n\n\n\n```\nstruct Color {\n    let red, green, blue: Double\n    init(red: Double, green: Double, blue: Double) {\n        self.red   = red\n        self.green = green\n        self.blue  = blue\n    }\n    init(white: Double) {\n        red   = white\n        green = white\n        blue  = white\n    }\n}\n\n```\n\nBoth initializers can be used to create a new `Color` instance, by providing named values for each initializer parameter:\n\n\n\n```\nlet magenta = Color(red: 1.0, green: 0.0, blue: 1.0)\nlet halfGray = Color(white: 0.5)\n\n```\n\nNote that it isn’t possible to call these initializers without using argument labels. Argument labels must always be used in an initializer if they’re defined, and omitting them is a compile-time error:\n\n\n\n```\nlet veryGreen = Color(0.0, 1.0, 0.0)\n\/\/ this reports a compile-time error - argument labels are required\n\n```\n\n### [Initializer Parameters Without Argument Labels](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Initializer-Parameters-Without-Argument-Labels)\n\nIf you don’t want to use an argument label for an initializer parameter, write an underscore (`_`) instead of an explicit argument label for that parameter to override the default behavior.\n\nHere’s an expanded version of the `Celsius` example from [Initialization Parameters](\/swift-book\/documentation\/the-swift-programming-language\/initialization#Initialization-Parameters) above, with an additional initializer to create a new `Celsius` instance from a `Double` value that’s already in the Celsius scale:\n\n\n\n```\nstruct Celsius {\n    var temperatureInCelsius: Double\n    init(fromFahrenheit fahrenheit: Double) {\n        temperatureInCelsius = (fahrenheit - 32.0) \/ 1.8\n    }\n    init(fromKelvin kelvin: Double) {\n        temperatureInCelsius = kelvin - 273.15\n    }\n    init(_ celsius: Double) {\n        temperatureInCelsius = celsius\n    }\n}\nlet bodyTemperature = Celsius(37.0)\n\/\/ bodyTemperature.temperatureInCelsius is 37.0\n\n```\n\nThe initializer call `Celsius(37.0)` is clear in its intent without the need for an argument label. It’s therefore appropriate to write this initializer as `init(_ celsius: Double)` so that it can be called by providing an unnamed `Double` value.\n\n### [Optional Property Types](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Optional-Property-Types)\n\nIf your custom type has a stored property that’s logically allowed to have “no value” — perhaps because its value can’t be set during initialization, or because it’s allowed to have “no value” at some later point — declare the property with an *optional* type. Properties of optional type are automatically initialized with a value of `nil`, indicating that the property is deliberately intended to have “no value yet” during initialization.\n\nThe following example defines a class called `SurveyQuestion`, with an optional `String` property called `response`:\n\n\n\n```\nclass SurveyQuestion {\n    var text: String\n    var response: String?\n    init(text: String) {\n        self.text = text\n    }\n    func ask() {\n        print(text)\n    }\n}\nlet cheeseQuestion = SurveyQuestion(text: \"Do you like cheese?\")\ncheeseQuestion.ask()\n\/\/ Prints \"Do you like cheese?\"\ncheeseQuestion.response = \"Yes, I do like cheese.\"\n\n```\n\nThe response to a survey question can’t be known until it’s asked, and so the `response` property is declared with a type of `String?`, or “optional `String`”. It’s automatically assigned a default value of `nil`, meaning “no string yet”, when a new instance of `SurveyQuestion` is initialized.\n\n### [Assigning Constant Properties During Initialization](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Assigning-Constant-Properties-During-Initialization)\n\nYou can assign a value to a constant property at any point during initialization, as long as it’s set to a definite value by the time initialization finishes. Once a constant property is assigned a value, it can’t be further modified.\n\nNote\n\nFor class instances, a constant property can be modified during initialization only by the class that introduces it. It can’t be modified by a subclass.\n\nYou can revise the `SurveyQuestion` example from above to use a constant property rather than a variable property for the `text` property of the question, to indicate that the question doesn’t change once an instance of `SurveyQuestion` is created. Even though the `text` property is now a constant, it can still be set within the class’s initializer:\n\n\n\n```\nclass SurveyQuestion {\n    let text: String\n    var response: String?\n    init(text: String) {\n        self.text = text\n    }\n    func ask() {\n        print(text)\n    }\n}\nlet beetsQuestion = SurveyQuestion(text: \"How about beets?\")\nbeetsQuestion.ask()\n\/\/ Prints \"How about beets?\"\nbeetsQuestion.response = \"I also like beets. (But not with cheese.)\"\n\n```\n\n## [Default Initializers](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Default-Initializers)\n\nSwift provides a *default initializer* for any structure or class that provides default values for all of its properties and doesn’t provide at least one initializer itself. The default initializer simply creates a new instance with all of its properties set to their default values.\n\nThis example defines a class called `ShoppingListItem`, which encapsulates the name, quantity, and purchase state of an item in a shopping list:\n\n\n\n```\nclass ShoppingListItem {\n    var name: String?\n    var quantity = 1\n    var purchased = false\n}\nvar item = ShoppingListItem()\n\n```\n\nBecause all properties of the `ShoppingListItem` class have default values, and because it’s a base class with no superclass, `ShoppingListItem` automatically gains a default initializer implementation that creates a new instance with all of its properties set to their default values. (The `name` property is an optional `String` property, and so it automatically receives a default value of `nil`, even though this value isn’t written in the code.) The example above uses the default initializer for the `ShoppingListItem` class to create a new instance of the class with initializer syntax, written as `ShoppingListItem()`, and assigns this new instance to a variable called `item`.\n\n### [Memberwise Initializers for Structure Types](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Memberwise-Initializers-for-Structure-Types)\n\nStructure types automatically receive a *memberwise initializer* if they don’t define any of their own custom initializers. Unlike a default initializer, the structure receives a memberwise initializer even if it has stored properties that don’t have default values.\n\nThe memberwise initializer is a shorthand way to initialize the member properties of new structure instances. Initial values for the properties of the new instance can be passed to the memberwise initializer by name.\n\nThe example below defines a structure called `Size` with two properties called `width` and `height`. Both properties are inferred to be of type `Double` by assigning a default value of `0.0`.\n\nThe `Size` structure automatically receives an `init(width:height:)` memberwise initializer, which you can use to initialize a new `Size` instance:\n\n\n\n```\nstruct Size {\n    var width = 0.0, height = 0.0\n}\nlet twoByTwo = Size(width: 2.0, height: 2.0)\n\n```\n\nWhen you call a memberwise initializer, you can omit values for any properties that have default values. In the example above, the `Size` structure has a default value for both its `height` and `width` properties. You can omit either property or both properties, and the initializer uses the default value for anything you omit. For example:\n\n\n\n```\nlet zeroByTwo = Size(height: 2.0)\nprint(zeroByTwo.width, zeroByTwo.height)\n\/\/ Prints \"0.0 2.0\".\n\n\nlet zeroByZero = Size()\nprint(zeroByZero.width, zeroByZero.height)\n\/\/ Prints \"0.0 0.0\".\n\n```\n\n## [Initializer Delegation for Value Types](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Initializer-Delegation-for-Value-Types)\n\nInitializers can call other initializers to perform part of an instance’s initialization. This process, known as *initializer delegation*, avoids duplicating code across multiple initializers.\n\nThe rules for how initializer delegation works, and for what forms of delegation are allowed, are different for value types and class types. Value types (structures and enumerations) don’t support inheritance, and so their initializer delegation process is relatively simple, because they can only delegate to another initializer that they provide themselves. Classes, however, can inherit from other classes, as described in [Inheritance](\/swift-book\/documentation\/the-swift-programming-language\/inheritance). This means that classes have additional responsibilities for ensuring that all stored properties they inherit are assigned a suitable value during initialization. These responsibilities are described in [Class Inheritance and Initialization](\/swift-book\/documentation\/the-swift-programming-language\/initialization#Class-Inheritance-and-Initialization) below.\n\nFor value types, you use `self.init` to refer to other initializers from the same value type when writing your own custom initializers. You can call `self.init` only from within an initializer.\n\nNote that if you define a custom initializer for a value type, you will no longer have access to the default initializer (or the memberwise initializer, if it’s a structure) for that type. This constraint prevents a situation in which additional essential setup provided in a more complex initializer is accidentally circumvented by someone using one of the automatic initializers.\n\nNote\n\nIf you want your custom value type to be initializable with the default initializer and memberwise initializer, and also with your own custom initializers, write your custom initializers in an extension rather than as part of the value type’s original implementation. For more information, see [Extensions](\/swift-book\/documentation\/the-swift-programming-language\/extensions).\n\nThe following example defines a custom `Rect` structure to represent a geometric rectangle. The example requires two supporting structures called `Size` and `Point`, both of which provide default values of `0.0` for all of their properties:\n\n\n\n```\nstruct Size {\n    var width = 0.0, height = 0.0\n}\nstruct Point {\n    var x = 0.0, y = 0.0\n}\n\n```\n\nYou can initialize the `Rect` structure below in one of three ways — by using its default zero-initialized `origin` and `size` property values, by providing a specific origin point and size, or by providing a specific center point and size. These initialization options are represented by three custom initializers that are part of the `Rect` structure’s definition:\n\n\n\n```\nstruct Rect {\n    var origin = Point()\n    var size = Size()\n    init() {}\n    init(origin: Point, size: Size) {\n        self.origin = origin\n        self.size = size\n    }\n    init(center: Point, size: Size) {\n        let originX = center.x - (size.width \/ 2)\n        let originY = center.y - (size.height \/ 2)\n        self.init(origin: Point(x: originX, y: originY), size: size)\n    }\n}\n\n```\n\nThe first `Rect` initializer, `init()`, is functionally the same as the default initializer that the structure would have received if it didn’t have its own custom initializers. This initializer has an empty body, represented by an empty pair of curly braces `{}`. Calling this initializer returns a `Rect` instance whose `origin` and `size` properties are both initialized with the default values of `Point(x: 0.0, y: 0.0)` and `Size(width: 0.0, height: 0.0)` from their property definitions:\n\n\n\n```\nlet basicRect = Rect()\n\/\/ basicRect's origin is (0.0, 0.0) and its size is (0.0, 0.0)\n\n```\n\nThe second `Rect` initializer, `init(origin:size:)`, is functionally the same as the memberwise initializer that the structure would have received if it didn’t have its own custom initializers. This initializer simply assigns the `origin` and `size` argument values to the appropriate stored properties:\n\n\n\n```\nlet originRect = Rect(origin: Point(x: 2.0, y: 2.0),\n    size: Size(width: 5.0, height: 5.0))\n\/\/ originRect's origin is (2.0, 2.0) and its size is (5.0, 5.0)\n\n```\n\nThe third `Rect` initializer, `init(center:size:)`, is slightly more complex. It starts by calculating an appropriate origin point based on a `center` point and a `size` value. It then calls (or *delegates*) to the `init(origin:size:)` initializer, which stores the new origin and size values in the appropriate properties:\n\n\n\n```\nlet centerRect = Rect(center: Point(x: 4.0, y: 4.0),\n    size: Size(width: 3.0, height: 3.0))\n\/\/ centerRect's origin is (2.5, 2.5) and its size is (3.0, 3.0)\n\n```\n\nThe `init(center:size:)` initializer could have assigned the new values of `origin` and `size` to the appropriate properties itself. However, it’s more convenient (and clearer in intent) for the `init(center:size:)` initializer to take advantage of an existing initializer that already provides exactly that functionality.\n\nNote\n\nFor an alternative way to write this example without defining the `init()` and `init(origin:size:)` initializers yourself, see [Extensions](\/swift-book\/documentation\/the-swift-programming-language\/extensions).\n\n## [Class Inheritance and Initialization](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Class-Inheritance-and-Initialization)\n\nAll of a class’s stored properties — including any properties the class inherits from its superclass — *must* be assigned an initial value during initialization.\n\nSwift defines two kinds of initializers for class types to help ensure all stored properties receive an initial value. These are known as designated initializers and convenience initializers.\n\n### [Designated Initializers and Convenience Initializers](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Designated-Initializers-and-Convenience-Initializers)\n\n*Designated initializers* are the primary initializers for a class. A designated initializer fully initializes all properties introduced by that class and calls an appropriate superclass initializer to continue the initialization process up the superclass chain.\n\nClasses tend to have very few designated initializers, and it’s quite common for a class to have only one. Designated initializers are “funnel” points through which initialization takes place, and through which the initialization process continues up the superclass chain.\n\nEvery class must have at least one designated initializer. In some cases, this requirement is satisfied by inheriting one or more designated initializers from a superclass, as described in [Automatic Initializer Inheritance](\/swift-book\/documentation\/the-swift-programming-language\/initialization#Automatic-Initializer-Inheritance) below.\n\n*Convenience initializers* are secondary, supporting initializers for a class. You can define a convenience initializer to call a designated initializer from the same class as the convenience initializer with some of the designated initializer’s parameters set to default values. You can also define a convenience initializer to create an instance of that class for a specific use case or input value type.\n\nYou don’t have to provide convenience initializers if your class doesn’t require them. Create convenience initializers whenever a shortcut to a common initialization pattern will save time or make initialization of the class clearer in intent.\n\n### [Syntax for Designated and Convenience Initializers](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Syntax-for-Designated-and-Convenience-Initializers)\n\nDesignated initializers for classes are written in the same way as simple initializers for value types:\n\n\n\n```\ninit(<#parameters#>) {\n   <#statements#>\n}\n\n```\n\nConvenience initializers are written in the same style, but with the `convenience` modifier placed before the `init` keyword, separated by a space:\n\n\n\n```\nconvenience init(<#parameters#>) {\n   <#statements#>\n}\n\n```\n\n### [Initializer Delegation for Class Types](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Initializer-Delegation-for-Class-Types)\n\nTo simplify the relationships between designated and convenience initializers, Swift applies the following three rules for delegation calls between initializers:\n\n**Rule 1**A designated initializer must call a designated initializer from its immediate superclass.\n\n**Rule 2**A convenience initializer must call another initializer from the *same* class.\n\n**Rule 3**A convenience initializer must ultimately call a designated initializer.\n\nA simple way to remember this is:\n\n- Designated initializers must always delegate *up*.\n\n- Convenience initializers must always delegate *across*.\n\nThese rules are illustrated in the figure below:\n\nHere, the superclass has a single designated initializer and two convenience initializers. One convenience initializer calls another convenience initializer, which in turn calls the single designated initializer. This satisfies rules 2 and 3 from above. The superclass doesn’t itself have a further superclass, and so rule 1 doesn’t apply.\n\nThe subclass in this figure has two designated initializers and one convenience initializer. The convenience initializer must call one of the two designated initializers, because it can only call another initializer from the same class. This satisfies rules 2 and 3 from above. Both designated initializers must call the single designated initializer from the superclass, to satisfy rule 1 from above.\n\nNote\n\nThese rules don’t affect how users of your classes *create* instances of each class. Any initializer in the diagram above can be used to create a fully initialized instance of the class they belong to. The rules only affect how you write the implementation of the class’s initializers.\n\nThe figure below shows a more complex class hierarchy for four classes. It illustrates how the designated initializers in this hierarchy act as “funnel” points for class initialization, simplifying the interrelationships among classes in the chain:\n\n### [Two-Phase Initialization](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Two-Phase-Initialization)\n\nClass initialization in Swift is a two-phase process. In the first phase, each stored property is assigned an initial value by the class that introduced it. Once the initial state for every stored property has been determined, the second phase begins, and each class is given the opportunity to customize its stored properties further before the new instance is considered ready for use.\n\nThe use of a two-phase initialization process makes initialization safe, while still giving complete flexibility to each class in a class hierarchy. Two-phase initialization prevents property values from being accessed before they’re initialized, and prevents property values from being set to a different value by another initializer unexpectedly.\n\nNote\n\nSwift’s two-phase initialization process is similar to initialization in Objective-C. The main difference is that during phase 1, Objective-C assigns zero or null values (such as `0` or `nil`) to every property. Swift’s initialization flow is more flexible in that it lets you set custom initial values, and can cope with types for which `0` or `nil` isn’t a valid default value.\n\nSwift’s compiler performs four helpful safety-checks to make sure that two-phase initialization is completed without error:\n\n**Safety check 1**A designated initializer must ensure that all of the properties introduced by its class are initialized before it delegates up to a superclass initializer.\n\nAs mentioned above, the memory for an object is only considered fully initialized once the initial state of all of its stored properties is known. In order for this rule to be satisfied, a designated initializer must make sure that all of its own properties are initialized before it hands off up the chain.\n\n**Safety check 2**A designated initializer must delegate up to a superclass initializer before assigning a value to an inherited property. If it doesn’t, the new value the designated initializer assigns will be overwritten by the superclass as part of its own initialization.\n\n**Safety check 3**A convenience initializer must delegate to another initializer before assigning a value to *any* property (including properties defined by the same class). If it doesn’t, the new value the convenience initializer assigns will be overwritten by its own class’s designated initializer.\n\n**Safety check 4**An initializer can’t call any instance methods, read the values of any instance properties, or refer to `self` as a value until after the first phase of initialization is complete.\n\nThe class instance isn’t fully valid until the first phase ends. Properties can only be accessed, and methods can only be called, once the class instance is known to be valid at the end of the first phase.\n\nHere’s how two-phase initialization plays out, based on the four safety checks above:\n\n**Phase 1**\n\n- A designated or convenience initializer is called on a class.\n\n- Memory for a new instance of that class is allocated. The memory isn’t yet initialized.\n\n- A designated initializer for that class confirms that all stored properties introduced by that class have a value. The memory for these stored properties is now initialized.\n\n- The designated initializer hands off to a superclass initializer to perform the same task for its own stored properties.\n\n- This continues up the class inheritance chain until the top of the chain is reached.\n\n- Once the top of the chain is reached, and the final class in the chain has ensured that all of its stored properties have a value, the instance’s memory is considered to be fully initialized, and phase 1 is complete.\n\n**Phase 2**\n\n- Working back down from the top of the chain, each designated initializer in the chain has the option to customize the instance further. Initializers are now able to access `self` and can modify its properties, call its instance methods, and so on.\n\n- Finally, any convenience initializers in the chain have the option to customize the instance and to work with `self`.\n\nHere’s how phase 1 looks for an initialization call for a hypothetical subclass and superclass:\n\nIn this example, initialization begins with a call to a convenience initializer on the subclass. This convenience initializer can’t yet modify any properties. It delegates across to a designated initializer from the same class.\n\nThe designated initializer makes sure that all of the subclass’s properties have a value, as per safety check 1. It then calls a designated initializer on its superclass to continue the initialization up the chain.\n\nThe superclass’s designated initializer makes sure that all of the superclass properties have a value. There are no further superclasses to initialize, and so no further delegation is needed.\n\nAs soon as all properties of the superclass have an initial value, its memory is considered fully initialized, and phase 1 is complete.\n\nHere’s how phase 2 looks for the same initialization call:\n\nThe superclass’s designated initializer now has an opportunity to customize the instance further (although it doesn’t have to).\n\nOnce the superclass’s designated initializer is finished, the subclass’s designated initializer can perform additional customization (although again, it doesn’t have to).\n\nFinally, once the subclass’s designated initializer is finished, the convenience initializer that was originally called can perform additional customization.\n\n### [Initializer Inheritance and Overriding](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Initializer-Inheritance-and-Overriding)\n\nUnlike subclasses in Objective-C, Swift subclasses don’t inherit their superclass initializers by default. Swift’s approach prevents a situation in which a simple initializer from a superclass is inherited by a more specialized subclass and is used to create a new instance of the subclass that isn’t fully or correctly initialized.\n\nNote\n\nSuperclass initializers *are* inherited in certain circumstances, but only when it’s safe and appropriate to do so. For more information, see [Automatic Initializer Inheritance](\/swift-book\/documentation\/the-swift-programming-language\/initialization#Automatic-Initializer-Inheritance) below.\n\nIf you want a custom subclass to present one or more of the same initializers as its superclass, you can provide a custom implementation of those initializers within the subclass.\n\nWhen you write a subclass initializer that matches a superclass *designated* initializer, you are effectively providing an override of that designated initializer. Therefore, you must write the `override` modifier before the subclass’s initializer definition. This is true even if you are overriding an automatically provided default initializer, as described in [Default Initializers](\/swift-book\/documentation\/the-swift-programming-language\/initialization#Default-Initializers).\n\nAs with an overridden property, method or subscript, the presence of the `override` modifier prompts Swift to check that the superclass has a matching designated initializer to be overridden, and validates that the parameters for your overriding initializer have been specified as intended.\n\nNote\n\nYou always write the `override` modifier when overriding a superclass designated initializer, even if your subclass’s implementation of the initializer is a convenience initializer.\n\nConversely, if you write a subclass initializer that matches a superclass *convenience* initializer, that superclass convenience initializer can never be called directly by your subclass, as per the rules described above in [Initializer Delegation for Class Types](\/swift-book\/documentation\/the-swift-programming-language\/initialization#Initializer-Delegation-for-Class-Types). Therefore, your subclass is not (strictly speaking) providing an override of the superclass initializer. As a result, you don’t write the `override` modifier when providing a matching implementation of a superclass convenience initializer.\n\nThe example below defines a base class called `Vehicle`. This base class declares a stored property called `numberOfWheels`, with a default `Int` value of `0`. The `numberOfWheels` property is used by a computed property called `description` to create a `String` description of the vehicle’s characteristics:\n\n\n\n```\nclass Vehicle {\n    var numberOfWheels = 0\n    var description: String {\n        return \"(numberOfWheels) wheel(s)\"\n    }\n}\n\n```\n\nThe `Vehicle` class provides a default value for its only stored property, and doesn’t provide any custom initializers itself. As a result, it automatically receives a default initializer, as described in [Default Initializers](\/swift-book\/documentation\/the-swift-programming-language\/initialization#Default-Initializers). The default initializer (when available) is always a designated initializer for a class, and can be used to create a new `Vehicle` instance with a `numberOfWheels` of `0`:\n\n\n\n```\nlet vehicle = Vehicle()\nprint(\"Vehicle: (vehicle.description)\")\n\/\/ Vehicle: 0 wheel(s)\n\n```\n\nThe next example defines a subclass of `Vehicle` called `Bicycle`:\n\n\n\n```\nclass Bicycle: Vehicle {\n    override init() {\n        super.init()\n        numberOfWheels = 2\n    }\n}\n\n```\n\nThe `Bicycle` subclass defines a custom designated initializer, `init()`. This designated initializer matches a designated initializer from the superclass of `Bicycle`, and so the `Bicycle` version of this initializer is marked with the `override` modifier.\n\nThe `init()` initializer for `Bicycle` starts by calling `super.init()`, which calls the default initializer for the `Bicycle` class’s superclass, `Vehicle`. This ensures that the `numberOfWheels` inherited property is initialized by `Vehicle` before `Bicycle` has the opportunity to modify the property. After calling `super.init()`, the original value of `numberOfWheels` is replaced with a new value of `2`.\n\nIf you create an instance of `Bicycle`, you can call its inherited `description` computed property to see how its `numberOfWheels` property has been updated:\n\n\n\n```\nlet bicycle = Bicycle()\nprint(\"Bicycle: (bicycle.description)\")\n\/\/ Bicycle: 2 wheel(s)\n\n```\n\nIf a subclass initializer performs no customization in phase 2 of the initialization process, and the superclass has a synchronous, zero-argument designated initializer, you can omit a call to `super.init()` after assigning values to all of the subclass’s stored properties. If the superclass’s initializer is asynchronous, you need to write `await super.init()` explicitly.\n\nThis example defines another subclass of `Vehicle`, called `Hoverboard`. In its initializer, the `Hoverboard` class sets only its `color` property. Instead of making an explicit call to `super.init()`, this initializer relies on an implicit call to its superclass’s initializer to complete the process.\n\n\n\n```\nclass Hoverboard: Vehicle {\n    var color: String\n    init(color: String) {\n        self.color = color\n        \/\/ super.init() implicitly called here\n    }\n    override var description: String {\n        return \"(super.description) in a beautiful (color)\"\n    }\n}\n\n```\n\nAn instance of `Hoverboard` uses the default number of wheels supplied by the `Vehicle` initializer.\n\n\n\n```\nlet hoverboard = Hoverboard(color: \"silver\")\nprint(\"Hoverboard: (hoverboard.description)\")\n\/\/ Hoverboard: 0 wheel(s) in a beautiful silver\n\n```\n\nNote\n\nSubclasses can modify inherited variable properties during initialization, but can’t modify inherited constant properties.\n\n### [Automatic Initializer Inheritance](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Automatic-Initializer-Inheritance)\n\nAs mentioned above, subclasses don’t inherit their superclass initializers by default. However, superclass initializers *are* automatically inherited if certain conditions are met. In practice, this means that you don’t need to write initializer overrides in many common scenarios, and can inherit your superclass initializers with minimal effort whenever it’s safe to do so.\n\nAssuming that you provide default values for any new properties you introduce in a subclass, the following two rules apply:\n\n**Rule 1**If your subclass doesn’t define any designated initializers, it automatically inherits all of its superclass designated initializers.\n\n**Rule 2**If your subclass provides an implementation of *all* of its superclass designated initializers — either by inheriting them as per rule 1, or by providing a custom implementation as part of its definition — then it automatically inherits all of the superclass convenience initializers.\n\nThese rules apply even if your subclass adds further convenience initializers.\n\nNote\n\nA subclass can implement a superclass designated initializer as a subclass convenience initializer as part of satisfying rule 2.\n\n### [Designated and Convenience Initializers in Action](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Designated-and-Convenience-Initializers-in-Action)\n\nThe following example shows designated initializers, convenience initializers, and automatic initializer inheritance in action. This example defines a hierarchy of three classes called `Food`, `RecipeIngredient`, and `ShoppingListItem`, and demonstrates how their initializers interact.\n\nThe base class in the hierarchy is called `Food`, which is a simple class to encapsulate the name of a foodstuff. The `Food` class introduces a single `String` property called `name` and provides two initializers for creating `Food` instances:\n\n\n\n```\nclass Food {\n    var name: String\n    init(name: String) {\n        self.name = name\n    }\n    convenience init() {\n        self.init(name: \"[Unnamed]\")\n    }\n}\n\n```\n\nThe figure below shows the initializer chain for the `Food` class:\n\nClasses don’t have a default memberwise initializer, and so the `Food` class provides a designated initializer that takes a single argument called `name`. This initializer can be used to create a new `Food` instance with a specific name:\n\n\n\n```\nlet namedMeat = Food(name: \"Bacon\")\n\/\/ namedMeat's name is \"Bacon\"\n\n```\n\nThe `init(name: String)` initializer from the `Food` class is provided as a *designated* initializer, because it ensures that all stored properties of a new `Food` instance are fully initialized. The `Food` class doesn’t have a superclass, and so the `init(name: String)` initializer doesn’t need to call `super.init()` to complete its initialization.\n\nThe `Food` class also provides a *convenience* initializer, `init()`, with no arguments. The `init()` initializer provides a default placeholder name for a new food by delegating across to the `Food` class’s `init(name: String)` with a `name` value of `[Unnamed]`:\n\n\n\n```\nlet mysteryMeat = Food()\n\/\/ mysteryMeat's name is \"[Unnamed]\"\n\n```\n\nThe second class in the hierarchy is a subclass of `Food` called `RecipeIngredient`. The `RecipeIngredient` class models an ingredient in a cooking recipe. It introduces an `Int` property called `quantity` (in addition to the `name` property it inherits from `Food`) and defines two initializers for creating `RecipeIngredient` instances:\n\n\n\n```\nclass RecipeIngredient: Food {\n    var quantity: Int\n    init(name: String, quantity: Int) {\n        self.quantity = quantity\n        super.init(name: name)\n    }\n    override convenience init(name: String) {\n        self.init(name: name, quantity: 1)\n    }\n}\n\n```\n\nThe figure below shows the initializer chain for the `RecipeIngredient` class:\n\nThe `RecipeIngredient` class has a single designated initializer, `init(name: String, quantity: Int)`, which can be used to populate all of the properties of a new `RecipeIngredient` instance. This initializer starts by assigning the passed `quantity` argument to the `quantity` property, which is the only new property introduced by `RecipeIngredient`. After doing so, the initializer delegates up to the `init(name: String)` initializer of the `Food` class. This process satisfies safety check 1 from [Two-Phase Initialization](\/swift-book\/documentation\/the-swift-programming-language\/initialization#Two-Phase-Initialization) above.\n\n`RecipeIngredient` also defines a convenience initializer, `init(name: String)`, which is used to create a `RecipeIngredient` instance by name alone. This convenience initializer assumes a quantity of `1` for any `RecipeIngredient` instance that’s created without an explicit quantity. The definition of this convenience initializer makes `RecipeIngredient` instances quicker and more convenient to create, and avoids code duplication when creating several single-quantity `RecipeIngredient` instances. This convenience initializer simply delegates across to the class’s designated initializer, passing in a `quantity` value of `1`.\n\nThe `init(name: String)` convenience initializer provided by `RecipeIngredient` takes the same parameters as the `init(name: String)` *designated* initializer from `Food`. Because this convenience initializer overrides a designated initializer from its superclass, it must be marked with the `override` modifier (as described in [Initializer Inheritance and Overriding](\/swift-book\/documentation\/the-swift-programming-language\/initialization#Initializer-Inheritance-and-Overriding)).\n\nEven though `RecipeIngredient` provides the `init(name: String)` initializer as a convenience initializer, `RecipeIngredient` has nonetheless provided an implementation of all of its superclass’s designated initializers. Therefore, `RecipeIngredient` automatically inherits all of its superclass’s convenience initializers too.\n\nIn this example, the superclass for `RecipeIngredient` is `Food`, which has a single convenience initializer called `init()`. This initializer is therefore inherited by `RecipeIngredient`. The inherited version of `init()` functions in exactly the same way as the `Food` version, except that it delegates to the `RecipeIngredient` version of `init(name: String)` rather than the `Food` version.\n\nAll three of these initializers can be used to create new `RecipeIngredient` instances:\n\n\n\n```\nlet oneMysteryItem = RecipeIngredient()\nlet oneBacon = RecipeIngredient(name: \"Bacon\")\nlet sixEggs = RecipeIngredient(name: \"Eggs\", quantity: 6)\n\n```\n\nThe third and final class in the hierarchy is a subclass of `RecipeIngredient` called `ShoppingListItem`. The `ShoppingListItem` class models a recipe ingredient as it appears in a shopping list.\n\nEvery item in the shopping list starts out as “unpurchased”. To represent this fact, `ShoppingListItem` introduces a Boolean property called `purchased`, with a default value of `false`. `ShoppingListItem` also adds a computed `description` property, which provides a textual description of a `ShoppingListItem` instance:\n\n\n\n```\nclass ShoppingListItem: RecipeIngredient {\n    var purchased = false\n    var description: String {\n        var output = \"(quantity) x (name)\"\n        output += purchased ? \" ✔\" : \" ✘\"\n        return output\n    }\n}\n\n```\n\nNote\n\n`ShoppingListItem` doesn’t define an initializer to provide an initial value for `purchased`, because items in a shopping list (as modeled here) always start out unpurchased.\n\nBecause it provides a default value for all of the properties it introduces and doesn’t define any initializers itself, `ShoppingListItem` automatically inherits *all* of the designated and convenience initializers from its superclass.\n\nThe figure below shows the overall initializer chain for all three classes:\n\nYou can use all three of the inherited initializers to create a new `ShoppingListItem` instance:\n\n\n\n```\nvar breakfastList = [\n    ShoppingListItem(),\n    ShoppingListItem(name: \"Bacon\"),\n    ShoppingListItem(name: \"Eggs\", quantity: 6),\n]\nbreakfastList[0].name = \"Orange juice\"\nbreakfastList[0].purchased = true\nfor item in breakfastList {\n    print(item.description)\n}\n\/\/ 1 x Orange juice ✔\n\/\/ 1 x Bacon ✘\n\/\/ 6 x Eggs ✘\n\n```\n\nHere, a new array called `breakfastList` is created from an array literal containing three new `ShoppingListItem` instances. The type of the array is inferred to be `[ShoppingListItem]`. After the array is created, the name of the `ShoppingListItem` at the start of the array is changed from `\"[Unnamed]\"` to `\"Orange juice\"` and it’s marked as having been purchased. Printing the description of each item in the array shows that their default states have been set as expected.\n\n## [Failable Initializers](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Failable-Initializers)\n\nIt’s sometimes useful to define a class, structure, or enumeration for which initialization can fail. This failure might be triggered by invalid initialization parameter values, the absence of a required external resource, or some other condition that prevents initialization from succeeding.\n\nTo cope with initialization conditions that can fail, define one or more failable initializers as part of a class, structure, or enumeration definition. You write a failable initializer by placing a question mark after the `init` keyword (`init?`).\n\nNote\n\nYou can’t define a failable and a nonfailable initializer with the same parameter types and names.\n\nA failable initializer creates an *optional* value of the type it initializes. You write `return nil` within a failable initializer to indicate a point at which initialization failure can be triggered.\n\nNote\n\nStrictly speaking, initializers don’t return a value. Rather, their role is to ensure that `self` is fully and correctly initialized by the time that initialization ends. Although you write `return nil` to trigger an initialization failure, you don’t use the `return` keyword to indicate initialization success.\n\nFor instance, failable initializers are implemented for numeric type conversions. To ensure conversion between numeric types maintains the value exactly, use the `init(exactly:)` initializer. If the type conversion can’t maintain the value, the initializer fails.\n\n\n\n```\nlet wholeNumber: Double = 12345.0\nlet pi = 3.14159\n\n\nif let valueMaintained = Int(exactly: wholeNumber) {\n    print(\"(wholeNumber) conversion to Int maintains value of (valueMaintained)\")\n}\n\/\/ Prints \"12345.0 conversion to Int maintains value of 12345\".\n\n\nlet valueChanged = Int(exactly: pi)\n\/\/ valueChanged is of type Int?, not Int\n\n\nif valueChanged == nil {\n    print(\"(pi) conversion to Int doesn't maintain value\")\n}\n\/\/ Prints \"3.14159 conversion to Int doesn't maintain value\".\n\n```\n\nThe example below defines a structure called `Animal`, with a constant `String` property called `species`. The `Animal` structure also defines a failable initializer with a single parameter called `species`. This initializer checks if the `species` value passed to the initializer is an empty string. If an empty string is found, an initialization failure is triggered. Otherwise, the `species` property’s value is set, and initialization succeeds:\n\n\n\n```\nstruct Animal {\n    let species: String\n    init?(species: String) {\n        if species.isEmpty { return nil }\n        self.species = species\n    }\n}\n\n```\n\nYou can use this failable initializer to try to initialize a new `Animal` instance and to check if initialization succeeded:\n\n\n\n```\nlet someCreature = Animal(species: \"Giraffe\")\n\/\/ someCreature is of type Animal?, not Animal\n\n\nif let giraffe = someCreature {\n    print(\"An animal was initialized with a species of (giraffe.species)\")\n}\n\/\/ Prints \"An animal was initialized with a species of Giraffe\".\n\n```\n\nIf you pass an empty string value to the failable initializer’s `species` parameter, the initializer triggers an initialization failure:\n\n\n\n```\nlet anonymousCreature = Animal(species: \"\")\n\/\/ anonymousCreature is of type Animal?, not Animal\n\n\nif anonymousCreature == nil {\n    print(\"The anonymous creature couldn't be initialized\")\n}\n\/\/ Prints \"The anonymous creature couldn't be initialized\".\n\n```\n\nNote\n\nChecking for an empty string value (such as `\"\"` rather than `\"Giraffe\"`) isn’t the same as checking for `nil` to indicate the absence of an *optional* `String` value. In the example above, an empty string (`\"\"`) is a valid, non-optional `String`. However, it’s not appropriate for an animal to have an empty string as the value of its `species` property. To model this restriction, the failable initializer triggers an initialization failure if an empty string is found.\n\n### [Failable Initializers for Enumerations](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Failable-Initializers-for-Enumerations)\n\nYou can use a failable initializer to select an appropriate enumeration case based on one or more parameters. The initializer can then fail if the provided parameters don’t match an appropriate enumeration case.\n\nThe example below defines an enumeration called `TemperatureUnit`, with three possible states (`kelvin`, `celsius`, and `fahrenheit`). A failable initializer is used to find an appropriate enumeration case for a `Character` value representing a temperature symbol:\n\n\n\n```\nenum TemperatureUnit {\n    case kelvin, celsius, fahrenheit\n    init?(symbol: Character) {\n        switch symbol {\n        case \"K\":\n            self = .kelvin\n        case \"C\":\n            self = .celsius\n        case \"F\":\n            self = .fahrenheit\n        default:\n            return nil\n        }\n    }\n}\n\n```\n\nYou can use this failable initializer to choose an appropriate enumeration case for the three possible states and to cause initialization to fail if the parameter doesn’t match one of these states:\n\n\n\n```\nlet fahrenheitUnit = TemperatureUnit(symbol: \"F\")\nif fahrenheitUnit != nil {\n    print(\"This is a defined temperature unit, so initialization succeeded.\")\n}\n\/\/ Prints \"This is a defined temperature unit, so initialization succeeded.\"\n\n\nlet unknownUnit = TemperatureUnit(symbol: \"X\")\nif unknownUnit == nil {\n    print(\"This isn't a defined temperature unit, so initialization failed.\")\n}\n\/\/ Prints \"This isn't a defined temperature unit, so initialization failed.\"\n\n```\n\n### [Failable Initializers for Enumerations with Raw Values](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Failable-Initializers-for-Enumerations-with-Raw-Values)\n\nEnumerations with raw values automatically receive a failable initializer, `init?(rawValue:)`, that takes a parameter called `rawValue` of the appropriate raw-value type and selects a matching enumeration case if one is found, or triggers an initialization failure if no matching value exists.\n\nYou can rewrite the `TemperatureUnit` example from above to use raw values of type `Character` and to take advantage of the `init?(rawValue:)` initializer:\n\n\n\n```\nenum TemperatureUnit: Character {\n    case kelvin = \"K\", celsius = \"C\", fahrenheit = \"F\"\n}\n\n\nlet fahrenheitUnit = TemperatureUnit(rawValue: \"F\")\nif fahrenheitUnit != nil {\n    print(\"This is a defined temperature unit, so initialization succeeded.\")\n}\n\/\/ Prints \"This is a defined temperature unit, so initialization succeeded.\"\n\n\nlet unknownUnit = TemperatureUnit(rawValue: \"X\")\nif unknownUnit == nil {\n    print(\"This isn't a defined temperature unit, so initialization failed.\")\n}\n\/\/ Prints \"This isn't a defined temperature unit, so initialization failed.\"\n\n```\n\n### [Propagation of Initialization Failure](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Propagation-of-Initialization-Failure)\n\nA failable initializer of a class, structure, or enumeration can delegate across to another failable initializer from the same class, structure, or enumeration. Similarly, a subclass failable initializer can delegate up to a superclass failable initializer.\n\nIn either case, if you delegate to another initializer that causes initialization to fail, the entire initialization process fails immediately, and no further initialization code is executed.\n\nNote\n\nA failable initializer can also delegate to a nonfailable initializer. Use this approach if you need to add a potential failure state to an existing initialization process that doesn’t otherwise fail.\n\nThe example below defines a subclass of `Product` called `CartItem`. The `CartItem` class models an item in an online shopping cart. `CartItem` introduces a stored constant property called `quantity` and ensures that this property always has a value of at least `1`:\n\n\n\n```\nclass Product {\n    let name: String\n    init?(name: String) {\n        if name.isEmpty { return nil }\n        self.name = name\n    }\n}\n\n\nclass CartItem: Product {\n    let quantity: Int\n    init?(name: String, quantity: Int) {\n        if quantity < 1 { return nil }\n        self.quantity = quantity\n        super.init(name: name)\n    }\n}\n\n```\n\nThe failable initializer for `CartItem` starts by validating that it has received a `quantity` value of `1` or more. If the `quantity` is invalid, the entire initialization process fails immediately and no further initialization code is executed. Likewise, the failable initializer for `Product` checks the `name` value, and the initializer process fails immediately if `name` is the empty string.\n\nIf you create a `CartItem` instance with a nonempty name and a quantity of `1` or more, initialization succeeds:\n\n\n\n```\nif let twoSocks = CartItem(name: \"sock\", quantity: 2) {\n    print(\"Item: (twoSocks.name), quantity: (twoSocks.quantity)\")\n}\n\/\/ Prints \"Item: sock, quantity: 2\".\n\n```\n\nIf you try to create a `CartItem` instance with a `quantity` value of `0`, the `CartItem` initializer causes initialization to fail:\n\n\n\n```\nif let zeroShirts = CartItem(name: \"shirt\", quantity: 0) {\n    print(\"Item: (zeroShirts.name), quantity: (zeroShirts.quantity)\")\n} else {\n    print(\"Unable to initialize zero shirts\")\n}\n\/\/ Prints \"Unable to initialize zero shirts\".\n\n```\n\nSimilarly, if you try to create a `CartItem` instance with an empty `name` value, the superclass `Product` initializer causes initialization to fail:\n\n\n\n```\nif let oneUnnamed = CartItem(name: \"\", quantity: 1) {\n    print(\"Item: (oneUnnamed.name), quantity: (oneUnnamed.quantity)\")\n} else {\n    print(\"Unable to initialize one unnamed product\")\n}\n\/\/ Prints \"Unable to initialize one unnamed product\".\n\n```\n\n### [Overriding a Failable Initializer](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Overriding-a-Failable-Initializer)\n\nYou can override a superclass failable initializer in a subclass, just like any other initializer. Alternatively, you can override a superclass failable initializer with a subclass *nonfailable* initializer. This enables you to define a subclass for which initialization can’t fail, even though initialization of the superclass is allowed to fail.\n\nNote that if you override a failable superclass initializer with a nonfailable subclass initializer, the only way to delegate up to the superclass initializer is to force-unwrap the result of the failable superclass initializer.\n\nNote\n\nYou can override a failable initializer with a nonfailable initializer but not the other way around.\n\nThe example below defines a class called `Document`. This class models a document that can be initialized with a `name` property that’s either a nonempty string value or `nil`, but can’t be an empty string:\n\n\n\n```\nclass Document {\n    var name: String?\n    \/\/ this initializer creates a document with a nil name value\n    init() {}\n    \/\/ this initializer creates a document with a nonempty name value\n    init?(name: String) {\n        if name.isEmpty { return nil }\n        self.name = name\n    }\n}\n\n```\n\nThe next example defines a subclass of `Document` called `AutomaticallyNamedDocument`. The `AutomaticallyNamedDocument` subclass overrides both of the designated initializers introduced by `Document`. These overrides ensure that an `AutomaticallyNamedDocument` instance has an initial `name` value of `\"[Untitled]\"` if the instance is initialized without a name, or if an empty string is passed to the `init(name:)` initializer:\n\n\n\n```\nclass AutomaticallyNamedDocument: Document {\n    override init() {\n        super.init()\n        self.name = \"[Untitled]\"\n    }\n    override init(name: String) {\n        super.init()\n        if name.isEmpty {\n            self.name = \"[Untitled]\"\n        } else {\n            self.name = name\n        }\n    }\n}\n\n```\n\nThe `AutomaticallyNamedDocument` overrides its superclass’s failable `init?(name:)` initializer with a nonfailable `init(name:)` initializer. Because `AutomaticallyNamedDocument` copes with the empty string case in a different way than its superclass, its initializer doesn’t need to fail, and so it provides a nonfailable version of the initializer instead.\n\nYou can use forced unwrapping in an initializer to call a failable initializer from the superclass as part of the implementation of a subclass’s nonfailable initializer. For example, the `UntitledDocument` subclass below is always named `\"[Untitled]\"`, and it uses the failable `init(name:)` initializer from its superclass during initialization.\n\n\n\n```\nclass UntitledDocument: Document {\n    override init() {\n        super.init(name: \"[Untitled]\")!\n    }\n}\n\n```\n\nIn this case, if the `init(name:)` initializer of the superclass were ever called with an empty string as the name, the forced unwrapping operation would result in a runtime error. However, because it’s called with a string literal, you can see that the initializer won’t fail, so no runtime error can occur in this case.\n\n### [The init! Failable Initializer](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#The-init-Failable-Initializer)\n\nYou typically define a failable initializer that creates an optional instance of the appropriate type by placing a question mark after the `init` keyword (`init?`). Alternatively, you can define a failable initializer that creates an implicitly unwrapped optional instance of the appropriate type. Do this by placing an exclamation point after the `init` keyword (`init!`) instead of a question mark.\n\nYou can delegate from `init?` to `init!` and vice versa, and you can override `init?` with `init!` and vice versa. You can also delegate from `init` to `init!`, although doing so will trigger an assertion if the `init!` initializer causes initialization to fail.\n\n## [Required Initializers](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Required-Initializers)\n\nWrite the `required` modifier before the definition of a class initializer to indicate that every subclass of the class must implement that initializer:\n\n\n\n```\nclass SomeClass {\n    required init() {\n        \/\/ initializer implementation goes here\n    }\n}\n\n```\n\nYou must also write the `required` modifier before every subclass implementation of a required initializer, to indicate that the initializer requirement applies to further subclasses in the chain. You don’t write the `override` modifier when overriding a required designated initializer:\n\n\n\n```\nclass SomeSubclass: SomeClass {\n    required init() {\n        \/\/ subclass implementation of the required initializer goes here\n    }\n}\n\n```\n\nNote\n\nYou don’t have to provide an explicit implementation of a required initializer if you can satisfy the requirement with an inherited initializer.\n\n## [Setting a Default Property Value with a Closure or Function](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Setting-a-Default-Property-Value-with-a-Closure-or-Function)\n\nIf a stored property’s default value requires some customization or setup, you can use a closure or global function to provide a customized default value for that property. Whenever a new instance of the type that the property belongs to is initialized, the closure or function is called, and its return value is assigned as the property’s default value.\n\nThese kinds of closures or functions typically create a temporary value of the same type as the property, tailor that value to represent the desired initial state, and then return that temporary value to be used as the property’s default value.\n\nHere’s a skeleton outline of how a closure can be used to provide a default property value:\n\n\n\n```\nclass SomeClass {\n    let someProperty: SomeType = {\n        \/\/ create a default value for someProperty inside this closure\n        \/\/ someValue must be of the same type as SomeType\n        return someValue\n    }()\n}\n\n```\n\nNote that the closure’s end curly brace is followed by an empty pair of parentheses. This tells Swift to execute the closure immediately. If you omit these parentheses, you are trying to assign the closure itself to the property, and not the return value of the closure.\n\nNote\n\nIf you use a closure to initialize a property, remember that the rest of the instance hasn’t yet been initialized at the point that the closure is executed. This means that you can’t access any other property values from within your closure, even if those properties have default values. You also can’t use the implicit `self` property, or call any of the instance’s methods.\n\nThe example below defines a structure called `Chessboard`, which models a board for the game of chess. Chess is played on an 8 x 8 board, with alternating black and white squares.\n\nTo represent this game board, the `Chessboard` structure has a single property called `boardColors`, which is an array of 64 `Bool` values. A value of `true` in the array represents a black square and a value of `false` represents a white square. The first item in the array represents the top left square on the board and the last item in the array represents the bottom right square on the board.\n\nThe `boardColors` array is initialized with a closure to set up its color values:\n\n\n\n```\nstruct Chessboard {\n    let boardColors: [Bool] = {\n        var temporaryBoard: [Bool] = []\n        var isBlack = false\n        for i in 1...8 {\n            for j in 1...8 {\n                temporaryBoard.append(isBlack)\n                isBlack = !isBlack\n            }\n            isBlack = !isBlack\n        }\n        return temporaryBoard\n    }()\n    func squareIsBlackAt(row: Int, column: Int) -> Bool {\n        return boardColors[(row * 8) + column]\n    }\n}\n\n```\n\nWhenever a new `Chessboard` instance is created, the closure is executed, and the default value of `boardColors` is calculated and returned. The closure in the example above calculates and sets the appropriate color for each square on the board in a temporary array called `temporaryBoard`, and returns this temporary array as the closure’s return value once its setup is complete. The returned array value is stored in `boardColors` and can be queried with the `squareIsBlackAt(row:column:)` utility function:\n\n\n\n```\nlet board = Chessboard()\nprint(board.squareIsBlackAt(row: 0, column: 1))\n\/\/ Prints \"true\".\nprint(board.squareIsBlackAt(row: 7, column: 7))\n\/\/ Prints \"false\".\n\n```\n\n\n- [ Initialization ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#app-top)\n\n- [ Setting Initial Values for Stored Properties ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Setting-Initial-Values-for-Stored-Properties)\n\n- [ Initializers ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Initializers)\n\n- [ Default Property Values ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Default-Property-Values)\n\n- [ Customizing Initialization ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Customizing-Initialization)\n\n- [ Initialization Parameters ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Initialization-Parameters)\n\n- [ Parameter Names and Argument Labels ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Parameter-Names-and-Argument-Labels)\n\n- [ Initializer Parameters Without Argument Labels ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Initializer-Parameters-Without-Argument-Labels)\n\n- [ Optional Property Types ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Optional-Property-Types)\n\n- [ Assigning Constant Properties During Initialization ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Assigning-Constant-Properties-During-Initialization)\n\n- [ Default Initializers ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Default-Initializers)\n\n- [ Memberwise Initializers for Structure Types ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Memberwise-Initializers-for-Structure-Types)\n\n- [ Initializer Delegation for Value Types ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Initializer-Delegation-for-Value-Types)\n\n- [ Class Inheritance and Initialization ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Class-Inheritance-and-Initialization)\n\n- [ Designated Initializers and Convenience Initializers ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Designated-Initializers-and-Convenience-Initializers)\n\n- [ Syntax for Designated and Convenience Initializers ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Syntax-for-Designated-and-Convenience-Initializers)\n\n- [ Initializer Delegation for Class Types ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Initializer-Delegation-for-Class-Types)\n\n- [ Two-Phase Initialization ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Two-Phase-Initialization)\n\n- [ Initializer Inheritance and Overriding ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Initializer-Inheritance-and-Overriding)\n\n- [ Automatic Initializer Inheritance ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Automatic-Initializer-Inheritance)\n\n- [ Designated and Convenience Initializers in Action ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Designated-and-Convenience-Initializers-in-Action)\n\n- [ Failable Initializers ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Failable-Initializers)\n\n- [ Failable Initializers for Enumerations ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Failable-Initializers-for-Enumerations)\n\n- [ Failable Initializers for Enumerations with Raw Values ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Failable-Initializers-for-Enumerations-with-Raw-Values)\n\n- [ Propagation of Initialization Failure ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Propagation-of-Initialization-Failure)\n\n- [ Overriding a Failable Initializer ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Overriding-a-Failable-Initializer)\n\n- [ The init! Failable Initializer ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#The-init-Failable-Initializer)\n\n- [ Required Initializers ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Required-Initializers)\n\n- [ Setting a Default Property Value with a Closure or Function ](\/swift-book\/documentation\/the-swift-programming-language\/initialization\/#Setting-a-Default-Property-Value-with-a-Closure-or-Function)",
  "sections" : [
    {
      "content" : "",
      "title" : "Setting Initial Values for Stored Properties"
    },
    {
      "content" : "",
      "title" : "Customizing Initialization"
    },
    {
      "content" : "",
      "title" : "Default Initializers"
    },
    {
      "content" : "",
      "title" : "Initializer Delegation for Value Types"
    },
    {
      "content" : "",
      "title" : "Class Inheritance and Initialization"
    },
    {
      "content" : "",
      "title" : "Failable Initializers"
    },
    {
      "content" : "",
      "title" : "Required Initializers"
    },
    {
      "content" : "",
      "title" : "Setting a Default Property Value with a Closure or Function"
    }
  ],
  "source" : "swiftOrg",
  "title" : "Initialization | Documentation",
  "url" : "https:\/\/docs.swift.org\/swift-book\/documentation\/the-swift-programming-language\/initialization\/"
}