{
  "abstract" : "NSOpenGLPFAMultisample Global VariableNSOpenGLPFAMultisamplemacOS 10.0–10.14Deprecatedvar NSOpenGLPFAMultisample: Int { get }Deprecated",
  "codeExamples" : [

  ],
  "contentHash" : "2b6698b7a4ce4ebd6505a0cfb0457431220008c3167fd32584552812d2ac08f4",
  "crawledAt" : "2025-12-05T22:15:07Z",
  "declaration" : {
    "code" : "var NSOpenGLPFAMultisample: Int { get }",
    "language" : "swift"
  },
  "id" : "FA8B4277-9347-4FC4-B57B-F6556895D84B",
  "kind" : "unknown",
  "overview" : "NSOpenGLPFAMultisample Global VariableNSOpenGLPFAMultisamplemacOS 10.0–10.14Deprecatedvar NSOpenGLPFAMultisample: Int { get }Deprecated\n\nOpenGL API deprecated; please use Metal and MetalKit.  (Define GL_SILENCE_DEPRECATION to silence these warnings.)\n\nA Boolean attribute. If present and used with NSOpenGLPFASampleBuffers and NSOpenGLPFASamples, this attribute hints to OpenGL to prefer multi-sampling. Multi-sampling will sample textures at the back buffer dimensions vice the multi-sample buffer dimensions and use that single sample for all fragments with coverage on the back buffer location. This means less total texture samples than with super-sampling (by a factor of the number of samples requested) and will likely be faster though less accurate (texture sample wise) than super-sampling. If the underlying video card does not have enough VRAM to support this feature, this hint does nothing.",
  "rawMarkdown" : "---\nsource: https:\/\/developer.apple.com\/documentation\/AppKit\/NSOpenGLPFAMultisample\ncrawled: 2025-12-05T22:15:07Z\n---\n\n# NSOpenGLPFAMultisample | Apple Developer Documentation\n\n- [ AppKit ](\/documentation\/appkit)\n\n- [ NSOpenGLPFAMultisample ](\/documentation\/AppKit\/NSOpenGLPFAMultisample)\n\n-  NSOpenGLPFAMultisample \n\nGlobal Variable# NSOpenGLPFAMultisample\n\nmacOS 10.0–10.14Deprecated\n\n```\nvar NSOpenGLPFAMultisample: Int { get }\n```\n\nDeprecated\n\nOpenGL API deprecated; please use Metal and MetalKit. (Define GL_SILENCE_DEPRECATION to silence these warnings.)\n\n## [Discussion](\/documentation\/AppKit\/NSOpenGLPFAMultisample#Discussion)\n\nA Boolean attribute. If present and used with `NSOpenGLPFASampleBuffers` and `NSOpenGLPFASamples`, this attribute hints to OpenGL to prefer multi-sampling. Multi-sampling will sample textures at the back buffer dimensions vice the multi-sample buffer dimensions and use that single sample for all fragments with coverage on the back buffer location. This means less total texture samples than with super-sampling (by a factor of the number of samples requested) and will likely be faster though less accurate (texture sample wise) than super-sampling. If the underlying video card does not have enough VRAM to support this feature, this hint does nothing.\n\nThe `NSOpenGLPFASampleBuffers` and `NSOpenGLPFASamples` attributes must be configured to request anti-aliasing as follows:\n\n\n\n```\nNSOpenGLPFAMultisample,\nNSOpenGLPFASampleBuffers, (NSOpenGLPixelFormatAttribute)1\nNSOpenGLPFASamples, (NSOpenGLPixelFormatAttribute)4,\n\n```\n\nIf after adding these options, multisamping still does not work, try removing the `NSOpenGLPFAPixelBuffer` attribute (if present). Some graphics cards may not support this option in specific versions of macOS. If removing the attribute still does not enable multisampling, try adding the `NSOpenGLPFANoRecovery` attribute.\n\n## [See Also](\/documentation\/AppKit\/NSOpenGLPFAMultisample#see-also)\n\n### [Constants](\/documentation\/AppKit\/NSOpenGLPFAMultisample#Constants)\n\n[`var NSOpenGLPFAAccelerated: Int`](\/documentation\/appkit\/nsopenglpfaaccelerated)A Boolean attribute. If present, this attribute indicates that only hardware-accelerated renderers are considered. If not present, accelerated renderers are still preferred.Deprecated[`var NSOpenGLPFAAcceleratedCompute: Int`](\/documentation\/appkit\/nsopenglpfaacceleratedcompute)If present, this attribute indicates that only renderers that can execute OpenCL programs should be used.Deprecated[`var NSOpenGLPFAAccumSize: Int`](\/documentation\/appkit\/nsopenglpfaaccumsize)Value is a nonnegative buffer size specification. An accumulation buffer that most closely matches the specified size is preferred.Deprecated[`var NSOpenGLPFAAllRenderers: Int`](\/documentation\/appkit\/nsopenglpfaallrenderers)A Boolean attribute. If present, this attribute indicates that the pixel format selection is open to all available renderers, including debug and special-purpose renderers that are not OpenGL compliant.Deprecated[`var NSOpenGLPFAAllowOfflineRenderers: Int`](\/documentation\/appkit\/nsopenglpfaallowofflinerenderers)A Boolean attribute. If present, this attribute indicates that offline renderers may be used.Deprecated[`var NSOpenGLPFAAlphaSize: Int`](\/documentation\/appkit\/nsopenglpfaalphasize)Value is a nonnegative buffer size specification. An alpha buffer that most closely matches the specified size is preferred.Deprecated[`var NSOpenGLPFAAuxBuffers: Int`](\/documentation\/appkit\/nsopenglpfaauxbuffers)Value is a nonnegative integer that indicates the desired number of auxiliary buffers. Pixel formats with the smallest number of auxiliary buffers that meets or exceeds the specified number are preferred.Deprecated[`var NSOpenGLPFAAuxDepthStencil: Int`](\/documentation\/appkit\/nsopenglpfaauxdepthstencil)Each auxiliary buffer has its own depth stencil.Deprecated[`var NSOpenGLPFABackingStore: Int`](\/documentation\/appkit\/nsopenglpfabackingstore)A Boolean attribute. If present, this attribute indicates that OpenGL only considers renderers that have a back color buffer the full size of the drawable (regardless of window visibility) and that guarantee the back buffer contents to be valid after a call to `NSOpenGLContext` object’s [`flushBuffer()`](\/documentation\/appkit\/nsopenglcontext\/flushbuffer()).Deprecated[`var NSOpenGLPFAClosestPolicy: Int`](\/documentation\/appkit\/nsopenglpfaclosestpolicy)A Boolean attribute. If present, this attribute indicates that the pixel format choosing policy is altered for the color buffer such that the buffer closest to the requested size is preferred, regardless of the actual color buffer depth of the supported graphics device.Deprecated[`var NSOpenGLPFAColorFloat: Int`](\/documentation\/appkit\/nsopenglpfacolorfloat)Deprecated[`var NSOpenGLPFAColorSize: Int`](\/documentation\/appkit\/nsopenglpfacolorsize)Value is a nonnegative buffer size specification. A color buffer that most closely matches the specified size is preferred. If unspecified, OpenGL chooses a color size that matches the screen.Deprecated[`var NSOpenGLPFADepthSize: Int`](\/documentation\/appkit\/nsopenglpfadepthsize)Value is a nonnegative depth buffer size specification. A depth buffer that most closely matches the specified size is preferred.Deprecated[`var NSOpenGLPFADoubleBuffer: Int`](\/documentation\/appkit\/nsopenglpfadoublebuffer)A Boolean attribute. If present, this attribute indicates that only double-buffered pixel formats are considered. Otherwise, only single-buffered pixel formats are considered.Deprecated[`var NSOpenGLPFAMaximumPolicy: Int`](\/documentation\/appkit\/nsopenglpfamaximumpolicy)A Boolean attribute. If present, this attribute indicates that the pixel format choosing policy is altered for the color, depth, and accumulation buffers such that, if a nonzero buffer size is requested, the largest available buffer is preferred.Deprecated",
  "sections" : [
    {
      "content" : "",
      "title" : "Discussion"
    },
    {
      "content" : "",
      "title" : "See Also"
    }
  ],
  "source" : "appleWebKit",
  "title" : "NSOpenGLPFAMultisample | Apple Developer Documentation",
  "url" : "https:\/\/developer.apple.com\/documentation\/AppKit\/NSOpenGLPFAMultisample"
}