{
  "abstract" : "Learn how to design and develop beautiful interfaces that leverage Liquid Glass.",
  "codeExamples" : [

  ],
  "contentHash" : "3f1024af4ef7cbbf8dea634210d88d46b97f243e09ae9811a4ae2f148a7ae6d6",
  "crawledAt" : "2025-12-02T15:40:27Z",
  "id" : "04D33542-B96D-432B-94A4-4C5595EA92F9",
  "kind" : "unknown",
  "overview" : "Technology Overviews  App design and UI  Liquid Glass  App design and UI  Liquid Glass Liquid GlassLearn how to design and develop beautiful interfaces that leverage Liquid Glass.Introduction to Liquid GlassInterfaces across Apple platforms feature a new dynamic material called Liquid Glass, which combines the optical properties of glass with a sense of fluidity. Learn how to adopt this material and embrace the design principles of Apple platforms to create beautiful interfaces that establish hierarchy, create harmony, and maintain consistency across devices and platforms.\n\nStandard components from SwiftUI, UIKit, and AppKit like controls and navigation elements pick up the appearance and behavior of this material automatically. You can also implement these effects in custom interface elements.",
  "rawMarkdown" : "---\nsource: https:\/\/developer.apple.com\/documentation\/technologyoverviews\/liquid-glass\ncrawled: 2025-12-02T15:40:27Z\n---\n\n# Liquid Glass | Apple Developer Documentation\n\n- [ Technology Overviews ](\/documentation\/technologyoverviews)\n\n- [ App design and UI ](\/documentation\/technologyoverviews\/app-design-and-ui)\n\n- [ Liquid Glass ](\/documentation\/technologyoverviews\/liquid-glass)\n\n- [ App design and UI ](\/documentation\/technologyoverviews\/app-design-and-ui)\n\n-  Liquid Glass \n\n# Liquid Glass\n\nLearn how to design and develop beautiful interfaces that leverage Liquid Glass.## [Introduction to Liquid Glass](\/documentation\/technologyoverviews\/liquid-glass#Introduction-to-Liquid-Glass)\n\nInterfaces across Apple platforms feature a new dynamic material called Liquid Glass, which combines the optical properties of glass with a sense of fluidity. Learn how to adopt this material and embrace the design principles of Apple platforms to create beautiful interfaces that establish hierarchy, create harmony, and maintain consistency across devices and platforms.\n\nStandard components from SwiftUI, UIKit, and AppKit like controls and navigation elements pick up the appearance and behavior of this material automatically. You can also implement these effects in custom interface elements.\n\n## [Adopting Liquid Glass](\/documentation\/technologyoverviews\/liquid-glass#Adopting-Liquid-Glass)\n\nIf you have an existing app, adopting Liquid Glass doesn’t mean reinventing your app from the ground up. Start by building your app in the latest version of Xcode to see the changes. Then, follow best practices in your interface to help your app look right at home on Apple platforms.\n\n- Embrace the visual refresh for materials, controls, and app icons.\n\n- Provide a universal navigation and search experience across platforms.\n\n- Ensure your interface’s organization and layout looks consistent with other apps and system experiences.\n\n- Adopt best practices for windows, modals, menus, and toolbars.\n\n- Test your app to ensure it provides a great experience across platforms.\n\nTo learn more, read [Adopting Liquid Glass](\/documentation\/technologyoverviews\/adopting-liquid-glass).\n\nBefore\n\nAfter\n\n## [Sample code](\/documentation\/technologyoverviews\/liquid-glass#Sample-code)\n\nThe Landmarks app showcases how to create a beautiful and engaging user experience using SwiftUI and Liquid Glass. Explore how the Landmarks app implements the look and feel of the Liquid Glass material throughout its interface.\n\n- Configure an app icon with Icon Composer.\n\n- Create an edge-to-edge content experience with the background extension effect.\n\n- Enhance the edge-to-edge content experience by extending horizontal scroll views under a sidebar or inspector.\n\n- Make your interface adaptable to changing window sizes.\n\n- Explore search conventions across platforms.\n\n- Apply Liquid Glass effects to custom interface elements and animations.\n\nTo learn more, see [Landmarks: Building an app with Liquid Glass](\/documentation\/SwiftUI\/Landmarks-Building-an-app-with-Liquid-Glass).\n\n## [Design principles](\/documentation\/technologyoverviews\/liquid-glass#Design-principles)\n\nThe Human Interface Guidelines contains guidance and best practices that can help you design a great experience for any Apple platform. Browse the HIG to discover more about adapting your interface for Liquid Glass.\n\n- Define a layout and choose a navigation structure that puts the most important content in focus.\n\n- Reimagine your app icon with simple, bold layers that offer dimensionality and consistency across devices and appearances.\n\n- Be judicious with your use of color in controls and navigation so they stay legible and allow your content to infuse them and shine through.\n\n- Ensure interface elements fit in with software and hardware design across devices.\n\n- Adopt standard iconography and predictable action placement across platforms.\n\nTo learn more, read the [Human Interface Guidelines](\/design\/human-interface-guidelines).\n\n## [Videos](\/documentation\/technologyoverviews\/liquid-glass#Videos)\n\n[ Meet Liquid Glass ](https:\/\/developer.apple.com\/videos\/play\/wwdc2025\/219)[ Get to know the new design system ](https:\/\/developer.apple.com\/videos\/play\/wwdc2025\/356)[ Build a SwiftUI app with the new design ](https:\/\/developer.apple.com\/videos\/play\/wwdc2025\/323)[ Build a UIKit app with the new design ](https:\/\/developer.apple.com\/videos\/play\/wwdc2025\/284)[ Build an AppKit app with the new design ](https:\/\/developer.apple.com\/videos\/play\/wwdc2025\/310)",
  "sections" : [
    {
      "content" : "",
      "title" : "Introduction to Liquid Glass"
    },
    {
      "content" : "",
      "title" : "Adopting Liquid Glass"
    },
    {
      "content" : "",
      "title" : "Sample code"
    },
    {
      "content" : "",
      "title" : "Design principles"
    },
    {
      "content" : "",
      "title" : "Videos"
    }
  ],
  "source" : "appleWebKit",
  "title" : "Liquid Glass | Apple Developer Documentation",
  "url" : "https:\/\/developer.apple.com\/documentation\/technologyoverviews\/liquid-glass"
}