{
  "abstract" : "Learn about the wide range of technologies you use to develop software for Apple platforms.",
  "codeExamples" : [

  ],
  "contentHash" : "5da0543605f3fff48c2fec9bfa7e0d63019dbcfdd380800e96c818ce5861e222",
  "crawledAt" : "2025-12-02T15:58:28Z",
  "id" : "A611E0EB-B14E-445F-A239-9B074E48407A",
  "kind" : "unknown",
  "overview" : "Technology OverviewsLearn about the wide range of technologies you use to develop software for Apple platforms.OverviewWhether you’re new to Apple platforms or you’ve been working with them for years, finding the technology you need is an important first step. With so many technologies available to you, it’s sometimes difficult to know where to start. The following topics offer a high-level view of the technologies available to you, and guidance about which technologies you might choose to solve particular problems.\n\nStart your exploration with the foundational technologies you use to build your app or game, and make your interface shine by adopting Liquid Glass.\n\nApp design and UI  Games Discover Apple technologiesExplore the technologies you use to build your app’s unique experience. Whether you’re buiding core features like your app’s data model, accessing device-specific hardware, making your app more intelligent, or adopting features unique to Apple devices, Apple frameworks help you do so easily and efficiently.",
  "rawMarkdown" : "---\nsource: https:\/\/developer.apple.com\/documentation\/technologyoverviews\ncrawled: 2025-12-02T15:58:28Z\n---\n\n# Technology Overviews | Apple Developer Documentation\n\n# Technology Overviews\n\nLearn about the wide range of technologies you use to develop software for Apple platforms.## [Overview](\/documentation\/technologyoverviews#overview)\n\nWhether you’re new to Apple platforms or you’ve been working with them for years, finding the technology you need is an important first step. With so many technologies available to you, it’s sometimes difficult to know where to start. The following topics offer a high-level view of the technologies available to you, and guidance about which technologies you might choose to solve particular problems.\n\n## [Get started](\/documentation\/technologyoverviews#Get-started)\n\nStart your exploration with the foundational technologies you use to build your app or game, and make your interface shine by adopting Liquid Glass.\n\n[ App design and UI ](\/documentation\/technologyoverviews\/app-design-and-ui)[ Games ](\/documentation\/technologyoverviews\/games)## [Discover Apple technologies](\/documentation\/technologyoverviews#Discover-Apple-technologies)\n\nExplore the technologies you use to build your app’s unique experience. Whether you’re buiding core features like your app’s data model, accessing device-specific hardware, making your app more intelligent, or adopting features unique to Apple devices, Apple frameworks help you do so easily and efficiently.\n\n[ Data management ](\/documentation\/technologyoverviews\/data-management)[ Core experiences ](\/documentation\/technologyoverviews\/core-experiences)[ Apple Intelligence and machine learning ](\/documentation\/technologyoverviews\/ai-machine-learning)[ Audio and video ](\/documentation\/technologyoverviews\/audio-and-video)## [Explore the Apple Developer Documentation](\/documentation\/technologyoverviews#Explore-the-Apple-Developer-Documentation)\n\nConsult the [Apple Developer Documentation](https:\/\/developer.apple.com\/documentation\/) for in-depth information about individual technologies. The developer documentation includes API reference, articles, sample code, and tutorials to help you learn how to use a given technology. It also offers guidance about the best way to solve specific challenges.",
  "sections" : [
    {
      "content" : "",
      "title" : "Overview"
    },
    {
      "content" : "",
      "title" : "Get started"
    },
    {
      "content" : "",
      "title" : "Discover Apple technologies"
    },
    {
      "content" : "",
      "title" : "Explore the Apple Developer Documentation"
    }
  ],
  "source" : "appleWebKit",
  "title" : "Technology Overviews | Apple Developer Documentation",
  "url" : "https:\/\/developer.apple.com\/documentation\/technologyoverviews"
}