{
  "abstract" : "Detect out-of-bounds memory access, use of freed memory, and other potential vulnerabilities.",
  "codeExamples" : [

  ],
  "contentHash" : "477e76a48c3a1fde69b3e9fbc1cec493631664c70779a6410956f1573d794f9b",
  "crawledAt" : "2025-12-02T16:43:12Z",
  "id" : "DDEB4CC9-FC20-4726-BB74-D366EC4A7EA1",
  "kind" : "article",
  "language" : "swift",
  "overview" : "## Overview\n\nPeople’s devices can contain a large amount of sensitive data that an attacker might want to use for malicious purposes. If your app contains any security vulnerabilities, an attacker may exploit the vulnerabilities to access or modify the data in your app, extension, App Clip, or device driver.\n\nAdopt the Enhanced Security capability in your Xcode project to enable a collection of build settings and entitlements designed to mitigate certain common vulnerabilities in your app. Review the behavior of your app with these settings enabled, and fix any problems that Xcode and the system report.\n\nEnhanced Security compiler settings and runtime checks are available for apps and extensions built for iOS, iPadOS, macOS, and visionOS; App Clips in iOS; and DriverKit extensions in iPadOS and macOS. Additionally, you can create Enhanced Security helper extensions on iOS, iPadOS, and macOS to which the system provides further protections; for more information, see [doc:\/\/com.apple.Xcode\/documentation\/Xcode\/creating-enhanced-security-helper-extensions].\n\n### Adopt the Enhanced Security capability\n\nNavigate to the Signing and Capabilities editor for your Xcode target, and click the Add Capability button. From the list of capabilities, select Enhanced Security. Xcode adds the following entitlements to your app’s provisioning profile:\n\nWhen you add the Enhanced Security capability to your target, use the checkboxes in the Enhanced Security capability of the Signing and Capabilities editor to adopt specific hardening features. Additionally, click Enable Build Settings to add security-related build settings to all targets in your project, which turns on certain hardening features.\n\nThe sections below describe the individual entitlements and build settings that comprise Enhanced Security, and the steps you can take to adopt the hardening features in your code. Additionally, the sections describe how you can turn off any individual hardening setting, in case you need to do so while you prepare your code to support the additional protections.\n\n### Prepare your app for pointer authentication\n\nThe Enhanced Security capability includes additional runtime platform restrictions, which Xcode enables by default for your app when you adopt the capability by setting the `ENABLE_POINTER_AUTHENTICATION` build setting to `Yes`. With these additional runtime platform restrictions enabled, Xcode builds your app for the `arm64e` architecture and enables *pointer authentication*.\n\nWhen you enable pointer authentication, the system generates signature metadata for pointers that your app creates by allocating memory or constructing C++ objects. Then the system validates that the signatures are unchanged when your app accesses the memory addressed by those pointers. If the signature for a pointer isn’t valid, the system encounters an exception and crashes your app. Doing so helps to protect against an attacker overwriting memory in your app to compromise the app’s control flow.\n\nTo adopt pointer authentication, use the `__ptrauth` type qualifier to instruct the compiler to generate pointer authentication protection for variables in your code that store data and function pointers.\n\nWhen a variable uses pointer authentication, the system throws an error if you overwrite its value with a raw pointer in your code, or copy its value to another variable that uses a different pointer authentication schema. If your app does either of these, the system encounters an exception and crashes your app. Instead, sign the pointer before storing it, re-signing it for a different use if necessary. For more information, see [doc:\/\/com.apple.documentation\/documentation\/Apple-Silicon\/improving-control-flow-integrity-with-pointer-authentication].\n\nIf you need to turn off pointer authentication for your target, uncheck the Authenticate Pointers checkbox in the Signing and Capabilities editor, or set the `ENABLE_POINTER_AUTHENTICATION` build setting to `No`.\n\n### Adopt typed allocator support\n\nWhen you adopt the Enhanced Security capability, Xcode configures build settings to enable the compiler’s typed allocator in C and C++ code. For more information on the typed allocator and the changes you need to make in your code if you use custom memory-allocator wrapper functions, see [doc:\/\/com.apple.Xcode\/documentation\/Xcode\/adopting-type-aware-memory-allocation].\n\nTo turn off typed allocator support for your target, uncheck the Enable Typed Allocators checkbox in the Signing and Capabilities editor, or set the `CLANG_ENABLE_C_TYPED_ALLOCATOR_SUPPORT` build setting to `No` for C code, and the `CLANG_ENABLE_CPLUSPLUS_TYPED_ALLOCATOR_SUPPORT` build setting to `No` for C++ code.\n\n### Adopt memory integrity enforcement\n\nWhen you enable hardware memory tagging, each new memory allocation and any pointers to that memory include an embedded value called a *tag*. Accessing to memory through a pointer requires that the pointer’s tag matches the allocation’s tag. If the tags don’t match — for example, because of a use-after-free error or out-of-bounds access — the app crashes instead of performing the unsafe access.\n\nTo enable memory tagging, navigate to the Signing and Capabilities editor for your Xcode target. Enable the Enhanced Security capability, then, under Memory Safety, click Enable Hardware Memory Tagging. Xcode adds the [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Entitlements\/com.apple.security.hardened-process.checked-allocations] entitlement to your app.\n\nTo enable additional diagnostics while debugging, navigate to the Scheme Editor and select the Run action, then select the Diagnostics pane and enable Hardware Memory Tagging.\n\nWhen you enable memory tagging in Xcode, it also adds the [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Entitlements\/com.apple.security.hardened-process.checked-allocations.soft-mode] entitlement. This entitlement makes hardware memory tagging operate in *soft mode*, where the system produces a simulated crash instead of terminating the app if a pointer’s tag doesn’t match the memory allocation’s tag. You can review reports from simulated crashes to help you find memory issues and to help validate that your app doesn’t have memory corruption bugs that would result in crashes when soft mode is disabled. After you’re confident in the stability of your app, disable soft mode to protect your users. To disable soft mode, navigate to the Signing and Capabilities editor for your Xcode target, then, under Memory Safety, deselect Enable Soft Mode for Memory Tagging.\n\nYou can also enable the [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Entitlements\/com.apple.security.hardened-process.checked-allocations.enable-pure-data] and [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Entitlements\/com.apple.security.hardened-process.checked-allocations.no-tagged-receive] entitlements.\n\n### Initialize stack variables to zero\n\nWhen you enable the Enhanced Security capability for your target, Xcode sets the `CLANG_ENABLE_STACK_ZERO_INIT` build setting to `Yes`. This build setting configures the compiler to initialize automatic variables in your code with zeroes. Doing so helps to protect against particular types of use-after-free vulnerability, because your app zeroes out previous values in stack memory before it reuses them for other variables.\n\nIf you need to turn off zero-initialization of stack variables for your target, set the `CLANG_ENABLE_STACK_ZERO_INIT` build setting to `No`.\n\n### Address security-related compiler warnings\n\nWhen you enable the Enhanced Security capability for your target, Xcode configures some compiler warnings that help to identify potentially insecure code. These are:\n\nXcode additionally sets the `ENABLE_SECURITY_COMPILER_WARNINGS` target build setting to `Yes`. This turns on a collection of security-related compiler warnings that Xcode reports in the Issues navigator when you build the target. These additional warnings are:\n\nIf you need to turn off the additional compiler warnings that Enhanced Security configures for your target, set the `ENABLE_SECURITY_COMPILER_WARNINGS` build setting to `No`.\n\n### Adopt C++ standard library hardening and compiler bounds checking\n\nWhen you enable the Enhanced Security capability for your target, Xcode sets the `ENABLE_CPLUSPLUS_BOUNDS_SAFE_BUFFERS` target build setting to `YES`. This enables a collection of safety checks in the C++ standard library. Specifically, it enables the *fast* hardening mode.\n\nIn fast mode, the C++ standard library performs the following assertion checks in your code that uses standard library container types:\n\nThe standard library calculates these checks in constant time. If a hardening assertion fails (that is, if the check evaluates to `false`), the system encounters an exception and crashes your app.\n\nTo change the C++ standard library hardening mode for a single file in your project, define the `_LIBCPP_HARDENING_MODE` macro with one of the following values:\n\nIf you define the macro in code, you need to place the definition at the beginning of the file, before you include any standard library headers.\n\nAdditionally, setting `ENABLE_CPLUSPLUS_BOUNDS_SAFE_BUFFERS` to `Yes` adds compiler warnings on unsafe buffer usage in C++, configuring the compiler to treat these warnings as errors. The C++ compiler encounters an error if it detects that your code:\n\nTo turn off C++ standard library hardening and compiler bounds checking for your target, set the `ENABLE_CPLUSPLUS_BOUNDS_SAFE_BUFFERS` build setting to `No`.\n\nFor more information on C++ standard library hardening, see [https:\/\/libcxx.llvm.org\/Hardening.html] in the LLVM documentation.\n\n### Adopt additional run-time restrictions\n\nWhen you enable the Enhanced Security capability for your target, Xcode adds the [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Entitlements\/com.apple.security.hardened-process.platform-restrictions] entitlement to your app. This entitlement informs the system to perform additional checks on dynamic libraries your app or extension loads, and on Mach messages your app or extension receives from other processes.\n\nIf you use [doc:\/\/com.apple.documentation\/documentation\/XPC] for inter-process communication (IPC) and don’t use Mach IPC traps, or don’t have any explicit IPC mechanism in your app or extension, enabling additional run-time restrictions turns on protections that are unlikely to require you to make any code changes.\n\nIn apps and extensions that use Mach IPC traps, additional run-time restrictions turn potentially insecure situations into crashes to avoid giving an attacker privileged access to your process via Mach ports. For information on interpreting these crashes and changes to your code that avoid potentially insecure use of Mach messaging APIs, see [doc:\/\/com.apple.Xcode\/documentation\/Xcode\/conforming-to-mach-ipc-security-restrictions].\n\nTo turn off additional run-time restrictions for your target, uncheck the Enable Additional Runtime Platform Restrictions checkbox in the Signing and Capabilities editor.\n\n### Adopt read-only memory for internal platform state\n\nWhen you enable the Enhanced Security capability for your target, Xcode adds the [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Entitlements\/com.apple.security.hardened-process.dyld-ro] entitlement to your app. This entitlement informs the system to mark regions of memory in your process that the platform uses for its internal state as read-only.\n\nIn most situations, this additional protection doesn’t require you to make any changes. If your app modifies data in the protected regions — for example, it modifies the value of `const` data sections — the system crashes your app when you adopt this entitlement. To fix the crash, remove the code that modifies the read-only memory regions.\n\nIf you need to turn off read-only memory for the dynamic loader, uncheck the Enable Read-Only Platform Memory checkbox in the Signing and Capabilities editor.\n\n### Adopt bounds checking in C\n\nOptionally, enable bounds checking for your target that complements the security features in Enhanced Security.\n\nThe `ENABLE_C_BOUNDS_SAFETY` build setting adds the `-fbounds-safety` flag to the compiler invocation when Xcode compiles C source files. This is an extension to the C programming language that prevents out-of-bounds memory access by enforcing bounds safety.\n\nThe compiler assumes that every pointer in your code that it compiles with the `-fbounds-safety` flag points to a single object, and emits an error if you attempt to perform pointer arithmetic using the pointer, or use a subscript to access an array element based on the pointer. To indicate that a pointer identifies a collection of objects of a given size, use one of these annotations:\n\nIf the pointer can potentially be `NULL`, add the suffix `_or_null` to the annotation name; for example, `__counted_by_or_null(N)`.\n\nTo indicate that a pointer identifies a collection of objects that has a particular sentinel value signifying the end — for example, a null-terminated string — use one of these annotations:\n\nTo indicate that a pointer refers to a value that you haven’t audited for bounds safety, add the `__unsafe_indexable` annotation.\n\nFor more information, see [https:\/\/clang.llvm.org\/docs\/BoundsSafety.html] on the LLVM website.\n\nTo turn off bounds checking in C, set the value of the `ENABLE_C_BOUNDS_SAFETY` build setting to `No`.",
  "rawMarkdown" : "---\nsource: https:\/\/developer.apple.com\/documentation\/Xcode\/enabling-enhanced-security-for-your-app\ncrawled: 2025-12-02T16:43:12Z\n---\n\n# Enabling enhanced security for your app\n\n**Article**\n\nDetect out-of-bounds memory access, use of freed memory, and other potential vulnerabilities.\n\n## Overview\n\nPeople’s devices can contain a large amount of sensitive data that an attacker might want to use for malicious purposes. If your app contains any security vulnerabilities, an attacker may exploit the vulnerabilities to access or modify the data in your app, extension, App Clip, or device driver.\n\nAdopt the Enhanced Security capability in your Xcode project to enable a collection of build settings and entitlements designed to mitigate certain common vulnerabilities in your app. Review the behavior of your app with these settings enabled, and fix any problems that Xcode and the system report.\n\n\n\nEnhanced Security compiler settings and runtime checks are available for apps and extensions built for iOS, iPadOS, macOS, and visionOS; App Clips in iOS; and DriverKit extensions in iPadOS and macOS. Additionally, you can create Enhanced Security helper extensions on iOS, iPadOS, and macOS to which the system provides further protections; for more information, see [doc:\/\/com.apple.Xcode\/documentation\/Xcode\/creating-enhanced-security-helper-extensions].\n\n### Adopt the Enhanced Security capability\n\nNavigate to the Signing and Capabilities editor for your Xcode target, and click the Add Capability button. From the list of capabilities, select Enhanced Security. Xcode adds the following entitlements to your app’s provisioning profile:\n\n- [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Entitlements\/com.apple.security.hardened-process.enhanced-security-version]: Xcode sets the value to `1`.\n- [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Entitlements\/com.apple.security.hardened-process]: Xcode sets the value to `true`.\n- [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Entitlements\/com.apple.security.hardened-process.hardened-heap]: Xcode sets the value to `true`.\n- [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Entitlements\/com.apple.security.hardened-process.platform-restrictions]: Xcode sets the value to `2`.\n- [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Entitlements\/com.apple.security.hardened-process.dyld-ro]: Xcode sets the value to `true`.\n\nWhen you add the Enhanced Security capability to your target, use the checkboxes in the Enhanced Security capability of the Signing and Capabilities editor to adopt specific hardening features. Additionally, click Enable Build Settings to add security-related build settings to all targets in your project, which turns on certain hardening features.\n\nThe sections below describe the individual entitlements and build settings that comprise Enhanced Security, and the steps you can take to adopt the hardening features in your code. Additionally, the sections describe how you can turn off any individual hardening setting, in case you need to do so while you prepare your code to support the additional protections.\n\n### Prepare your app for pointer authentication\n\nThe Enhanced Security capability includes additional runtime platform restrictions, which Xcode enables by default for your app when you adopt the capability by setting the `ENABLE_POINTER_AUTHENTICATION` build setting to `Yes`. With these additional runtime platform restrictions enabled, Xcode builds your app for the `arm64e` architecture and enables *pointer authentication*.\n\nWhen you enable pointer authentication, the system generates signature metadata for pointers that your app creates by allocating memory or constructing C++ objects. Then the system validates that the signatures are unchanged when your app accesses the memory addressed by those pointers. If the signature for a pointer isn’t valid, the system encounters an exception and crashes your app. Doing so helps to protect against an attacker overwriting memory in your app to compromise the app’s control flow.\n\nTo adopt pointer authentication, use the `__ptrauth` type qualifier to instruct the compiler to generate pointer authentication protection for variables in your code that store data and function pointers.\n\nWhen a variable uses pointer authentication, the system throws an error if you overwrite its value with a raw pointer in your code, or copy its value to another variable that uses a different pointer authentication schema. If your app does either of these, the system encounters an exception and crashes your app. Instead, sign the pointer before storing it, re-signing it for a different use if necessary. For more information, see [doc:\/\/com.apple.documentation\/documentation\/Apple-Silicon\/improving-control-flow-integrity-with-pointer-authentication].\n\nIf you need to turn off pointer authentication for your target, uncheck the Authenticate Pointers checkbox in the Signing and Capabilities editor, or set the `ENABLE_POINTER_AUTHENTICATION` build setting to `No`.\n\n### Adopt typed allocator support\n\nWhen you adopt the Enhanced Security capability, Xcode configures build settings to enable the compiler’s typed allocator in C and C++ code. For more information on the typed allocator and the changes you need to make in your code if you use custom memory-allocator wrapper functions, see [doc:\/\/com.apple.Xcode\/documentation\/Xcode\/adopting-type-aware-memory-allocation].\n\nTo turn off typed allocator support for your target, uncheck the Enable Typed Allocators checkbox in the Signing and Capabilities editor, or set the `CLANG_ENABLE_C_TYPED_ALLOCATOR_SUPPORT` build setting to `No` for C code, and the `CLANG_ENABLE_CPLUSPLUS_TYPED_ALLOCATOR_SUPPORT` build setting to `No` for C++ code.\n\n### Adopt memory integrity enforcement\n\nWhen you enable hardware memory tagging, each new memory allocation and any pointers to that memory include an embedded value called a *tag*. Accessing to memory through a pointer requires that the pointer’s tag matches the allocation’s tag. If the tags don’t match — for example, because of a use-after-free error or out-of-bounds access — the app crashes instead of performing the unsafe access.\n\nTo enable memory tagging, navigate to the Signing and Capabilities editor for your Xcode target. Enable the Enhanced Security capability, then, under Memory Safety, click Enable Hardware Memory Tagging. Xcode adds the [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Entitlements\/com.apple.security.hardened-process.checked-allocations] entitlement to your app.\n\nTo enable additional diagnostics while debugging, navigate to the Scheme Editor and select the Run action, then select the Diagnostics pane and enable Hardware Memory Tagging.\n\nWhen you enable memory tagging in Xcode, it also adds the [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Entitlements\/com.apple.security.hardened-process.checked-allocations.soft-mode] entitlement. This entitlement makes hardware memory tagging operate in *soft mode*, where the system produces a simulated crash instead of terminating the app if a pointer’s tag doesn’t match the memory allocation’s tag. You can review reports from simulated crashes to help you find memory issues and to help validate that your app doesn’t have memory corruption bugs that would result in crashes when soft mode is disabled. After you’re confident in the stability of your app, disable soft mode to protect your users. To disable soft mode, navigate to the Signing and Capabilities editor for your Xcode target, then, under Memory Safety, deselect Enable Soft Mode for Memory Tagging.\n\nYou can also enable the [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Entitlements\/com.apple.security.hardened-process.checked-allocations.enable-pure-data] and [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Entitlements\/com.apple.security.hardened-process.checked-allocations.no-tagged-receive] entitlements.\n\n\n\n### Initialize stack variables to zero\n\nWhen you enable the Enhanced Security capability for your target, Xcode sets the `CLANG_ENABLE_STACK_ZERO_INIT` build setting to `Yes`. This build setting configures the compiler to initialize automatic variables in your code with zeroes. Doing so helps to protect against particular types of use-after-free vulnerability, because your app zeroes out previous values in stack memory before it reuses them for other variables.\n\nIf you need to turn off zero-initialization of stack variables for your target, set the `CLANG_ENABLE_STACK_ZERO_INIT` build setting to `No`.\n\n### Address security-related compiler warnings\n\nWhen you enable the Enhanced Security capability for your target, Xcode configures some compiler warnings that help to identify potentially insecure code. These are:\n\n\n\nXcode additionally sets the `ENABLE_SECURITY_COMPILER_WARNINGS` target build setting to `Yes`. This turns on a collection of security-related compiler warnings that Xcode reports in the Issues navigator when you build the target. These additional warnings are:\n\n\n\nIf you need to turn off the additional compiler warnings that Enhanced Security configures for your target, set the `ENABLE_SECURITY_COMPILER_WARNINGS` build setting to `No`.\n\n### Adopt C++ standard library hardening and compiler bounds checking\n\nWhen you enable the Enhanced Security capability for your target, Xcode sets the `ENABLE_CPLUSPLUS_BOUNDS_SAFE_BUFFERS` target build setting to `YES`. This enables a collection of safety checks in the C++ standard library. Specifically, it enables the *fast* hardening mode.\n\nIn fast mode, the C++ standard library performs the following assertion checks in your code that uses standard library container types:\n\n\n\nThe standard library calculates these checks in constant time. If a hardening assertion fails (that is, if the check evaluates to `false`), the system encounters an exception and crashes your app.\n\nTo change the C++ standard library hardening mode for a single file in your project, define the `_LIBCPP_HARDENING_MODE` macro with one of the following values:\n\n\n\nIf you define the macro in code, you need to place the definition at the beginning of the file, before you include any standard library headers.\n\nAdditionally, setting `ENABLE_CPLUSPLUS_BOUNDS_SAFE_BUFFERS` to `Yes` adds compiler warnings on unsafe buffer usage in C++, configuring the compiler to treat these warnings as errors. The C++ compiler encounters an error if it detects that your code:\n\n- Indexes an array, performs pointer arithmetic, or uses an unsafe C standard library function on a raw pointers\n- Calls `operator[]()` on a smart pointer that refers to a list of objects\n- Constructs a `std::span` object using the two-argument (pointer and size) constructor\n\nTo turn off C++ standard library hardening and compiler bounds checking for your target, set the `ENABLE_CPLUSPLUS_BOUNDS_SAFE_BUFFERS` build setting to `No`.\n\nFor more information on C++ standard library hardening, see [https:\/\/libcxx.llvm.org\/Hardening.html] in the LLVM documentation.\n\n### Adopt additional run-time restrictions\n\nWhen you enable the Enhanced Security capability for your target, Xcode adds the [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Entitlements\/com.apple.security.hardened-process.platform-restrictions] entitlement to your app. This entitlement informs the system to perform additional checks on dynamic libraries your app or extension loads, and on Mach messages your app or extension receives from other processes.\n\nIf you use [doc:\/\/com.apple.documentation\/documentation\/XPC] for inter-process communication (IPC) and don’t use Mach IPC traps, or don’t have any explicit IPC mechanism in your app or extension, enabling additional run-time restrictions turns on protections that are unlikely to require you to make any code changes.\n\nIn apps and extensions that use Mach IPC traps, additional run-time restrictions turn potentially insecure situations into crashes to avoid giving an attacker privileged access to your process via Mach ports. For information on interpreting these crashes and changes to your code that avoid potentially insecure use of Mach messaging APIs, see [doc:\/\/com.apple.Xcode\/documentation\/Xcode\/conforming-to-mach-ipc-security-restrictions].\n\nTo turn off additional run-time restrictions for your target, uncheck the Enable Additional Runtime Platform Restrictions checkbox in the Signing and Capabilities editor.\n\n### Adopt read-only memory for internal platform state\n\nWhen you enable the Enhanced Security capability for your target, Xcode adds the [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Entitlements\/com.apple.security.hardened-process.dyld-ro] entitlement to your app. This entitlement informs the system to mark regions of memory in your process that the platform uses for its internal state as read-only.\n\nIn most situations, this additional protection doesn’t require you to make any changes. If your app modifies data in the protected regions — for example, it modifies the value of `const` data sections — the system crashes your app when you adopt this entitlement. To fix the crash, remove the code that modifies the read-only memory regions.\n\nIf you need to turn off read-only memory for the dynamic loader, uncheck the Enable Read-Only Platform Memory checkbox in the Signing and Capabilities editor.\n\n### Adopt bounds checking in C\n\nOptionally, enable bounds checking for your target that complements the security features in Enhanced Security.\n\nThe `ENABLE_C_BOUNDS_SAFETY` build setting adds the `-fbounds-safety` flag to the compiler invocation when Xcode compiles C source files. This is an extension to the C programming language that prevents out-of-bounds memory access by enforcing bounds safety.\n\nThe compiler assumes that every pointer in your code that it compiles with the `-fbounds-safety` flag points to a single object, and emits an error if you attempt to perform pointer arithmetic using the pointer, or use a subscript to access an array element based on the pointer. To indicate that a pointer identifies a collection of objects of a given size, use one of these annotations:\n\n\n\nIf the pointer can potentially be `NULL`, add the suffix `_or_null` to the annotation name; for example, `__counted_by_or_null(N)`.\n\nTo indicate that a pointer identifies a collection of objects that has a particular sentinel value signifying the end — for example, a null-terminated string — use one of these annotations:\n\n\n\nTo indicate that a pointer refers to a value that you haven’t audited for bounds safety, add the `__unsafe_indexable` annotation.\n\nFor more information, see [https:\/\/clang.llvm.org\/docs\/BoundsSafety.html] on the LLVM website.\n\nTo turn off bounds checking in C, set the value of the `ENABLE_C_BOUNDS_SAFETY` build setting to `No`.\n\n## Security and privacy\n\n- **Verifying the origin of your XCFrameworks**: Discover who signed a framework, and take action when that changes.\n- **Creating enhanced security helper extensions**: Reduce opportunities for an attacker to target your app through its extensions.\n- **Adopting type-aware memory allocation**: Reduce the opportunities to treat pointers as data in your code.\n- **Conforming to Mach IPC security restrictions**: Avoid crashes and potentially insecure situations associated with Mach messages.\n\n",
  "sections" : [
    {
      "content" : "",
      "items" : [
        {
          "description" : "Discover who signed a framework, and take action when that changes.",
          "name" : "Verifying the origin of your XCFrameworks",
          "url" : "https:\/\/developer.apple.com\/documentation\/Xcode\/verifying-the-origin-of-your-xcframeworks"
        },
        {
          "description" : "Reduce opportunities for an attacker to target your app through its extensions.",
          "name" : "Creating enhanced security helper extensions",
          "url" : "https:\/\/developer.apple.com\/documentation\/Xcode\/creating-enhanced-security-helper-extensions"
        },
        {
          "description" : "Reduce the opportunities to treat pointers as data in your code.",
          "name" : "Adopting type-aware memory allocation",
          "url" : "https:\/\/developer.apple.com\/documentation\/Xcode\/adopting-type-aware-memory-allocation"
        },
        {
          "description" : "Avoid crashes and potentially insecure situations associated with Mach messages.",
          "name" : "Conforming to Mach IPC security restrictions",
          "url" : "https:\/\/developer.apple.com\/documentation\/Xcode\/conforming-to-mach-ipc-security-restrictions"
        }
      ],
      "title" : "Security and privacy"
    }
  ],
  "source" : "appleJSON",
  "title" : "Enabling enhanced security for your app",
  "url" : "https:\/\/developer.apple.com\/documentation\/Xcode\/enabling-enhanced-security-for-your-app"
}