{
  "abstract" : "Connect Xcode Cloud to Slack to keep your team informed about the latest Xcode Cloud builds.",
  "codeExamples" : [

  ],
  "contentHash" : "eb61e3ef40dac98d862552f757bac05ed145df4b1bf19b23ff4268f9fa0fd92c",
  "crawledAt" : "2025-12-01T09:23:45Z",
  "id" : "5F7F52C3-58A8-497E-AEA4-B525F18A8DB6",
  "kind" : "article",
  "overview" : "## Overview\n\nMany teams use [https:\/\/slack.com] to collaborate and expect other tools to support and integrate with Slack. And because collaboration is an important part of using Xcode Cloud, you can easily connect it to Slack and receive its notifications in your team’s Slack workspace.\n\nBy connecting Xcode Cloud to Slack, you can:\n\nUse Xcode or [htts:\/\/appstoreconnect.apple.com] to connect Xcode Cloud to a single Slack workspace.\n\n### Install the Slack app for Xcode Cloud using Xcode\n\nTo connect Xcode Cloud to Slack, you’ll need to install the Slack app Apple provides into your Slack workspace. The app manages access to your team’s Slack workspace.\n\nTo install the Slack app using Xcode:\n\n### Install the Slack app for Xcode Cloud using App Store Connect\n\nAnother way to configure Xcode Cloud to send notifications to Slack is by setting up that connection in [https:\/\/appstoreconnect.apple.com]. It’s especially convenient if you need to work with your team’s Slack administrator to connect Xcode Cloud to Slack, because they don’t need to be familiar with Xcode.\n\nIf you work with your team’s Slack administrator, add them to your Apple Development team, and assign them one of the following roles: App Manager, Admin, or Account Holder. With the proper role set in App Store Connect, they can connect Xcode Cloud to Slack.\n\nTo connect Xcode Cloud to your team’s Slack workspace in App Store Connect:\n\nYou can also connect Xcode Cloud to Slack by clicking on your account in the top-right corner of the App Store Connect website and choosing Edit Profile. In your profile settings, select the Xcode Cloud tab, then click Connect next to Slack and install the Xcode Cloud app into your Slack workspace.\n\n### Grant Xcode Cloud access to your Slack account\n\nIf you personally connected Xcode Cloud to Slack, you can configure Xcode Cloud to send build status notifications to your team’s Slack channels. You can also choose to receive build status notifications as direct messages. However, someone else may have connected Xcode Cloud to Slack; for example, the administrator of your team’s Slack workspace. In this case, you’ll receive build status notifications in Slack channels that your team member configured, but you need to authorize Xcode Cloud to use your Slack account before you can make changes to a workflow’s Notify post-action.\n\nTo authorize Xcode Cloud to access your Slack account:\n\nAfter authorizing Xcode Cloud to access your Slack account, you can make changes to your workflow’s Notify post-action and configure personal build notifications for Slack.\n\n### Choose a Slack channel\n\nDepending on your project, you can direct all Xcode Cloud notifications to the same Slack channel or to set up different Slack channels to receive the notifications. For example, use a single Slack channel for all Xcode Cloud notifications if you’re a solo developer or your team only works on one app. In contrast, large teams may use one Slack channel per app, or use different Slack channels for builds from pull requests, for workflows that distribute nightly builds, and so on.\n\nTo configure a workflow to send a build notification to a Slack channel:",
  "rawMarkdown" : "---\nsource: https:\/\/developer.apple.com\/documentation\/Xcode\/Connecting-Xcode-Cloud-to-Slack\ncrawled: 2025-12-01T09:23:45Z\n---\n\n# Connecting Xcode Cloud to Slack\n\n**Article**\n\nConnect Xcode Cloud to Slack to keep your team informed about the latest Xcode Cloud builds.\n\n## Overview\n\nMany teams use [https:\/\/slack.com] to collaborate and expect other tools to support and integrate with Slack. And because collaboration is an important part of using Xcode Cloud, you can easily connect it to Slack and receive its notifications in your team’s Slack workspace.\n\nBy connecting Xcode Cloud to Slack, you can:\n\n- Receive Xcode Cloud notifications in Slack that contain a build’s status and links to the build report.\n- Configure Xcode Cloud to send notifications to you as direct messages, or choose a Slack channel for team-level notifications.\n- Use different Slack channels for different workflows.\n\nUse Xcode or [htts:\/\/appstoreconnect.apple.com] to connect Xcode Cloud to a single Slack workspace.\n\n\n\n### Install the Slack app for Xcode Cloud using Xcode\n\nTo connect Xcode Cloud to Slack, you’ll need to install the Slack app Apple provides into your Slack workspace. The app manages access to your team’s Slack workspace.\n\nTo install the Slack app using Xcode:\n\n1. Choose Integrate > Manage Workflows to open the Manage Workflows sheet.\n2. Double-click a workflow to open.\n3. Click the Add button (+) next to Post-Actions and choose Notify to add a post-action for sending notifications.\n\n\n4. Click the Add button in the Slack section of the post-action you added.\n5. Provide the name of your Slack workspace, then click Connect. This opens your team’s Slack workspace in your browser.\n6. Sign in to your Slack workspace if you aren’t signed in already, and then review the permissions that the Slack app for Xcode Cloud requests.\n7. Click Allow to install the app into your Slack workspace. This takes you to Xcode where you can now configure the Notify post-action to send build notifications to your team’s Slack channels as described in [doc:\/\/com.apple.Xcode\/documentation\/Xcode\/Connecting-Xcode-Cloud-to-Slack#Choose-a-Slack-channel].\n\n\n\n### Install the Slack app for Xcode Cloud using App Store Connect\n\nAnother way to configure Xcode Cloud to send notifications to Slack is by setting up that connection in [https:\/\/appstoreconnect.apple.com]. It’s especially convenient if you need to work with your team’s Slack administrator to connect Xcode Cloud to Slack, because they don’t need to be familiar with Xcode.\n\nIf you work with your team’s Slack administrator, add them to your Apple Development team, and assign them one of the following roles: App Manager, Admin, or Account Holder. With the proper role set in App Store Connect, they can connect Xcode Cloud to Slack.\n\nTo connect Xcode Cloud to your team’s Slack workspace in App Store Connect:\n\n1. Navigate to your app’s page in App Store Connect and select the Xcode Cloud tab.\n2. Choose Manage Workflows in the sidebar and open a workflow by clicking its name.\n3. Click the Add button next to Post-Actions and choose Notify to add a post-action for sending notifications.\n4. Click Edit in the Slack section of the post-action you added.\n5. Enter the name of your team’s Slack workspace, then click Connect. This opens your team’s Slack workspace.\n6. Sign in to your Slack workspace if you aren’t signed in already, and then review the permissions that the Slack for Xcode Cloud requests.\n7. Click Allow to install the app into your Slack workspace. This takes you back to your workflow in App Store Connect where you can now configure the Notify post-action to send build notifications to your team’s Slack channels.\n\nYou can also connect Xcode Cloud to Slack by clicking on your account in the top-right corner of the App Store Connect website and choosing Edit Profile. In your profile settings, select the Xcode Cloud tab, then click Connect next to Slack and install the Xcode Cloud app into your Slack workspace.\n\n### Grant Xcode Cloud access to your Slack account\n\nIf you personally connected Xcode Cloud to Slack, you can configure Xcode Cloud to send build status notifications to your team’s Slack channels. You can also choose to receive build status notifications as direct messages. However, someone else may have connected Xcode Cloud to Slack; for example, the administrator of your team’s Slack workspace. In this case, you’ll receive build status notifications in Slack channels that your team member configured, but you need to authorize Xcode Cloud to use your Slack account before you can make changes to a workflow’s Notify post-action.\n\nTo authorize Xcode Cloud to access your Slack account:\n\n1. Open a workflow in Xcode or App Store Connect.\n2. Navigate to the Notify post-action.\n3. Follow the guidance by Xcode or App Store Connect to grand Xcode Cloud access to your Slack account.\n\nAfter authorizing Xcode Cloud to access your Slack account, you can make changes to your workflow’s Notify post-action and configure personal build notifications for Slack.\n\n### Choose a Slack channel\n\nDepending on your project, you can direct all Xcode Cloud notifications to the same Slack channel or to set up different Slack channels to receive the notifications. For example, use a single Slack channel for all Xcode Cloud notifications if you’re a solo developer or your team only works on one app. In contrast, large teams may use one Slack channel per app, or use different Slack channels for builds from pull requests, for workflows that distribute nightly builds, and so on.\n\nTo configure a workflow to send a build notification to a Slack channel:\n\n1. Open a workflow in Xcode or App Store Connect.\n2. Add a post-action by clicking the Add button and choosing Notify, or choose an existing Notify post-action.\n3. Click the Add button in the post-action’s Slack section.\n4. Choose a channel in the popover and click OK. If you’re a member of many Slack channels, filter the channels to find the one you’re looking for.\n5. Configure any notification settings; for example, choose to only receive notifications for build failures, then save your changes.\n\n\n\n## Notifications\n\n- **Configuring webhooks in Xcode Cloud**: Configure webhooks that connect Xcode Cloud to other services and tools.\n- **Xcode Cloud webhook payload reference**: Review details of the webhook payload that Xcode Cloud sends, including the product, workflow, build, actions, results, and SCM metadata associated with it.\n\n",
  "sections" : [
    {
      "content" : "",
      "items" : [
        {
          "description" : "Configure webhooks that connect Xcode Cloud to other services and tools.",
          "name" : "Configuring webhooks in Xcode Cloud",
          "url" : "https:\/\/developer.apple.com\/documentation\/Xcode\/Configuring-Webhooks-in-Xcode-Cloud"
        },
        {
          "description" : "Review details of the webhook payload that Xcode Cloud sends, including the product, workflow, build, actions, results, and SCM metadata associated with it.",
          "name" : "Xcode Cloud webhook payload reference",
          "url" : "https:\/\/developer.apple.com\/documentation\/Xcode\/Webhook-Payload"
        }
      ],
      "title" : "Notifications"
    }
  ],
  "source" : "appleJSON",
  "title" : "Connecting Xcode Cloud to Slack",
  "url" : "https:\/\/developer.apple.com\/documentation\/Xcode\/Connecting-Xcode-Cloud-to-Slack"
}