{
  "abstract" : "Use proven methods to rapidly create and play back performant particle effects.",
  "codeExamples" : [

  ],
  "contentHash" : "e8a763010305a038426da268ae6981c45cb1b6559499538aa5309aee8bf26b41",
  "crawledAt" : "2025-12-08T01:13:58Z",
  "id" : "A256CCCB-0D79-404B-9225-59CED18009A3",
  "kind" : "article",
  "language" : "swift",
  "module" : "SpriteKit",
  "overview" : "## Overview\n\nParticle emitters in SpriteKit are one of the most powerful tools for building visual effects. However, if used incorrectly, particle emitters can be a bottleneck in the design and implementation of your app. Consider the following tips:",
  "rawMarkdown" : "---\nsource: https:\/\/developer.apple.com\/documentation\/SpriteKit\/optimizing-emitter-node-performance\ncrawled: 2025-12-08T01:13:58Z\n---\n\n# Optimizing Emitter Node Performance\n\n**Article**\n\nUse proven methods to rapidly create and play back performant particle effects.\n\n## Overview\n\nParticle emitters in SpriteKit are one of the most powerful tools for building visual effects. However, if used incorrectly, particle emitters can be a bottleneck in the design and implementation of your app. Consider the following tips:\n\n- Use Xcode to create and test your particle effects, then load the archives in your game.\n- Adjust emitter properties sparingly inside your game code. Typically, you do this to specify properties that cannot be specified in the Xcode inspector or to control properties inside your game logic.\n- Try to keep the number of onscreen particles to a minimum by creating particle emitters with a low birth rate, and specifying a short lifetime for particles. For example, instead of creating hundreds or thousands of particles per second, reduce the birth rate and increase the size of the particles slightly. Often, you can create effects with fewer particles but the same net visual appearance.\n- Use actions on particles only when there isn’t another solution. Executing actions on individual particles is potentially very expensive, especially if the particle emitter also has a high birth rate.\n- Assign a target node whenever the particles should be independent of the emitter node after they are spawned. For example, particles should be independent if the emitter node moves or rotates in the scene.\n- Consider removing a particle emitter from the scene when it is not visible onscreen. Add it just before it becomes visible.\n\n",
  "sections" : [

  ],
  "source" : "appleJSON",
  "title" : "Optimizing Emitter Node Performance",
  "url" : "https:\/\/developer.apple.com\/documentation\/SpriteKit\/optimizing-emitter-node-performance"
}