{
  "abstract" : "Metal Performance Shaders  The MPSKernel Class  The MPSKernel Class ArticleThe MPSKernel ClassOverviewThe MPSKernel is the base class for all Metal Performance Shaders kernels. It defines the baseline behavior for all kernels, declaring the device to run the kernel on, some debugging options, and a user-friendly label, should one be required. Derived from this class are the MPSUnaryImageKernel and MPSBinaryImageKernel subclasses, which define shared behavior for most image processing kernels (filters) such as edging modes, clipping, and tiling support for image operations that consume one or two source textures. Neither these nor the MPSKernel class are meant to be used directly. They just provide API abstraction and in some cases may allow some level of polymorphic manipulation of image kernel objects.",
  "codeExamples" : [

  ],
  "contentHash" : "62458d3add30b6058f56a18fdf76bc6c7d7392e998d238fb60c232b202ab37d4",
  "crawledAt" : "2025-12-01T18:00:00Z",
  "id" : "2B58B816-C1B3-4F78-BC23-EEEA7F5B2ED7",
  "kind" : "class",
  "overview" : "Metal Performance Shaders  The MPSKernel Class  The MPSKernel Class ArticleThe MPSKernel ClassOverviewThe MPSKernel is the base class for all Metal Performance Shaders kernels. It defines the baseline behavior for all kernels, declaring the device to run the kernel on, some debugging options, and a user-friendly label, should one be required. Derived from this class are the MPSUnaryImageKernel and MPSBinaryImageKernel subclasses, which define shared behavior for most image processing kernels (filters) such as edging modes, clipping, and tiling support for image operations that consume one or two source textures. Neither these nor the MPSKernel class are meant to be used directly. They just provide API abstraction and in some cases may allow some level of polymorphic manipulation of image kernel objects.\n\nSubclasses of the MPSUnaryImageKernel and MPSBinaryImageKernel classes provide specialized initialization and encoding methods to encode various image processing primitives into a command buffer, and may also provide additional configurable properties on their own. Many such image filters are available, such as:\n\nConvolution filters (Sobel, Gaussian)",
  "rawMarkdown" : "---\nsource: https:\/\/developer.apple.com\/documentation\/metalperformanceshaders\/the_mpskernel_class\ncrawled: 2025-12-01T18:00:00Z\n---\n\n# The MPSKernel Class | Apple Developer Documentation\n\n- [ Metal Performance Shaders ](\/documentation\/metalperformanceshaders)\n\n- [ The MPSKernel Class ](\/documentation\/metalperformanceshaders\/the-mpskernel-class)\n\n-  The MPSKernel Class \n\nArticle# The MPSKernel Class\n\n## [Overview](\/documentation\/metalperformanceshaders\/the-mpskernel-class#Overview)\n\nThe [`MPSKernel`](\/documentation\/metalperformanceshaders\/mpskernel) is the base class for all Metal Performance Shaders kernels. It defines the baseline behavior for all kernels, declaring the device to run the kernel on, some debugging options, and a user-friendly label, should one be required. Derived from this class are the [`MPSUnaryImageKernel`](\/documentation\/metalperformanceshaders\/mpsunaryimagekernel) and [`MPSBinaryImageKernel`](\/documentation\/metalperformanceshaders\/mpsbinaryimagekernel) subclasses, which define shared behavior for most image processing kernels (filters) such as edging modes, clipping, and tiling support for image operations that consume one or two source textures. Neither these nor the [`MPSKernel`](\/documentation\/metalperformanceshaders\/mpskernel) class are meant to be used directly. They just provide API abstraction and in some cases may allow some level of polymorphic manipulation of image kernel objects.\n\nSubclasses of the [`MPSUnaryImageKernel`](\/documentation\/metalperformanceshaders\/mpsunaryimagekernel) and [`MPSBinaryImageKernel`](\/documentation\/metalperformanceshaders\/mpsbinaryimagekernel) classes provide specialized initialization and encoding methods to encode various image processing primitives into a command buffer, and may also provide additional configurable properties on their own. Many such image filters are available, such as:\n\n- Convolution filters (Sobel, Gaussian)\n\n- Morphological operators (dilate, erode)\n\n- Histogram operators (equalization, specification)\n\nAll of these run on the GPU directly on texture and buffer objects.\n\nAs the [`MPSKernel`](\/documentation\/metalperformanceshaders\/mpskernel), [`MPSUnaryImageKernel`](\/documentation\/metalperformanceshaders\/mpsunaryimagekernel), and [`MPSBinaryImageKernel`](\/documentation\/metalperformanceshaders\/mpsbinaryimagekernel) classes serve to unify a diversity of image operations into a simple consistent interface and calling sequence to apply image filters, subclasses implement details that diverge from the norm. For example, some filters may take a small set of parameters (for example, a convolution kernel) to govern how they function. However, the overall sequence for using kernel subclasses remains the same:\n\n- Determine whether the Metal Performance Shaders framework supports your device by querying the [`MPSSupportsMTLDevice(_:)`](\/documentation\/metalperformanceshaders\/mpssupportsmtldevice(_:)) function.\n\n- Allocate the usual Metal objects to drive a Metal compute pipeline: [`MTLDevice`](\/documentation\/Metal\/MTLDevice), [`MTLCommandQueue`](\/documentation\/Metal\/MTLCommandQueue), and [`MTLCommandBuffer`](\/documentation\/Metal\/MTLCommandBuffer). If your app has already written to any command buffers, Metal Performance Shaders can encode onto them inline with your own workload.\n\n- Create an appropriate kernel—for example, a [`MPSImageGaussianBlur`](\/documentation\/metalperformanceshaders\/mpsimagegaussianblur) object if you want to do a Gaussian blur. Kernels are generally lightweight but can be reused to save some setup time. They cannot be used by multiple threads concurrently, so if your app uses Metal from many threads concurrently, make extra kernels. [`MPSKernel`](\/documentation\/metalperformanceshaders\/mpskernel) objects conform to the [`NSCopying`](\/documentation\/Foundation\/NSCopying) protocol.\n\n- Call the kernel’s encoding method. Parameters for the encoding call vary by kernel type, but operate similarly. They create a command encoder, write commands to run the kernel into the command buffer, and then end the command encoder. This means you must call the [`endEncoding()`](\/documentation\/Metal\/MTLCommandEncoder\/endEncoding()) method on your current command encoder before calling a kernel’s encode method. At this point, you can either release the kernel or keep it for later use to save some setup cost.\n\n- If you wish to encode further commands of your own on the command buffer, you must create a new command encoder to do so.\n\n- When you are done with the command buffer, submit it to the device using the [`commit()`](\/documentation\/Metal\/MTLCommandBuffer\/commit()) method. The kernel will then begin running on the GPU. You can either use the [`waitUntilCompleted()`](\/documentation\/Metal\/MTLCommandBuffer\/waitUntilCompleted()) or [`addCompletedHandler(_:)`](\/documentation\/Metal\/MTLCommandBuffer\/addCompletedHandler(_:)) methods to be notified when the work is done.\n\nEach kernel is allocated against a particular device; a single kernel may not be used with multiple devices. This is necessary because the [`init(device:)`](\/documentation\/metalperformanceshaders\/mpskernel\/init(device:)) methods sometimes allocate buffers and textures to hold data passed in as parameters to the initialization method, and a device is required to allocate them. Kernels provide a [`copy(with:device:)`](\/documentation\/metalperformanceshaders\/mpskernel\/copy(with:device:)) method that allows them to be copied for a new device.\n\nNote\n\n Kernel objects are not entirely thread safe. While they may be used in a multithreaded context, you should not attempt to have multiple kernel objects writing to the same command buffer at the same time. They share restrictions with the command encoder in this regard. In limited circumstances, the same kernel can be used to write to multiple command buffers concurrently. However, that only works if the kernel is treated as an immutable object. That is, if subclass properties of a shared kernel are changed, then the change can be reflected on the other thread while the other thread is encoding its work, leading to undefined behavior. It is generally safest to just make copies of kernel objects, one for each thread.\n\n## [See Also](\/documentation\/metalperformanceshaders\/the-mpskernel-class#see-also)\n\n### [Fundamentals](\/documentation\/metalperformanceshaders\/the-mpskernel-class#Fundamentals)\n\n[Tuning Hints](\/documentation\/metalperformanceshaders\/tuning-hints)",
  "sections" : [
    {
      "content" : "",
      "title" : "Overview"
    },
    {
      "content" : "",
      "title" : "See Also"
    }
  ],
  "source" : "appleWebKit",
  "title" : "The MPSKernel Class | Apple Developer Documentation",
  "url" : "https:\/\/developer.apple.com\/documentation\/metalperformanceshaders\/the_mpskernel_class"
}