{
  "abstract" : "Metal Performance Shaders  Tuning Hints  Tuning Hints ArticleTuning HintsOverviewThe Metal Performance Shaders framework has been tuned for excellent performance across a diversity of devices and kernel parameters. The tuning process focuses on minimizing both CPU and GPU latency for back to back calls on the same command buffer. It is possible, however, to inadvertently undo this optimization effort by introducing costly operations into the pipeline around the kernel, leading to disappointing overall results.",
  "codeExamples" : [

  ],
  "contentHash" : "0b5d32f51f435d0ff155f52f5e4d6f2eaf440b0d09065cbbcdc528c7930c4fe5",
  "crawledAt" : "2025-12-04T22:34:16Z",
  "id" : "48F03D9C-4B02-45A8-8F51-FF221B132BF6",
  "kind" : "unknown",
  "overview" : "Metal Performance Shaders  Tuning Hints  Tuning Hints ArticleTuning HintsOverviewThe Metal Performance Shaders framework has been tuned for excellent performance across a diversity of devices and kernel parameters. The tuning process focuses on minimizing both CPU and GPU latency for back to back calls on the same command buffer. It is possible, however, to inadvertently undo this optimization effort by introducing costly operations into the pipeline around the kernel, leading to disappointing overall results.\n\nHere are some elements of good practice to avoid common pitfalls:\n\nDon’t wait for results to complete before enqueuing more work. There can be a significant delay (up to 2.5 ms) just to get an empty command buffer through the pipeline to where the waitUntilCompleted() method returns. Instead, start encoding the next command buffer(s) while you wait for the first one to complete. Enqueue them too, so they can start immediately after the previous one exits the GPU. Don’t wait for the CPU kernel to notice the first command buffer is done, start taking it apart, and eventually make a callback to the app before beginning work on encoding the next one. By allowing the CPU and GPU to work concurrently in this way, throughput can be enhanced by up to a factor of ten.",
  "rawMarkdown" : "---\nsource: https:\/\/developer.apple.com\/documentation\/metalperformanceshaders\/tuning-hints\ncrawled: 2025-12-04T22:34:16Z\n---\n\n# Tuning Hints | Apple Developer Documentation\n\n- [ Metal Performance Shaders ](\/documentation\/metalperformanceshaders)\n\n- [ Tuning Hints ](\/documentation\/metalperformanceshaders\/tuning-hints)\n\n-  Tuning Hints \n\nArticle# Tuning Hints\n\n## [Overview](\/documentation\/metalperformanceshaders\/tuning-hints#Overview)\n\nThe Metal Performance Shaders framework has been tuned for excellent performance across a diversity of devices and kernel parameters. The tuning process focuses on minimizing both CPU and GPU latency for back to back calls on the same command buffer. It is possible, however, to inadvertently undo this optimization effort by introducing costly operations into the pipeline around the kernel, leading to disappointing overall results.\n\nHere are some elements of good practice to avoid common pitfalls:\n\n- Don’t wait for results to complete before enqueuing more work. There can be a significant delay (up to 2.5 ms) just to get an empty command buffer through the pipeline to where the [`waitUntilCompleted()`](\/documentation\/Metal\/MTLCommandBuffer\/waitUntilCompleted()) method returns. Instead, start encoding the next command buffer(s) while you wait for the first one to complete. Enqueue them too, so they can start immediately after the previous one exits the GPU. Don’t wait for the CPU kernel to notice the first command buffer is done, start taking it apart, and eventually make a callback to the app before beginning work on encoding the next one. By allowing the CPU and GPU to work concurrently in this way, throughput can be enhanced by up to a factor of ten.\n\n- There is a large cost to allocating buffers and textures. The cost can swamp the CPU, preventing you from keeping the GPU busy. Try to preallocate and reuse the [`MTLResource`](\/documentation\/Metal\/MTLResource) objects as much as possible.\n\n- There is a cost to switching between render and compute encoders. Each time a new render encoder is used, there can be a substantial GPU mode switch cost that may undermine your throughput. To avoid the cost, try to batch compute work together. Since making a new command buffer forces you to make a new command encoder too, try to do more work with fewer command buffers.\n\n- For some image operations, particularly those involving multiple passes (e.g. chaining multiple image filters together), performance can be improved by up to a factor of two by breaking the work into tiles of ~512 KB in size. Use the [`sourceRegion(destinationSize:)`](\/documentation\/metalperformanceshaders\/mpsunaryimagekernel\/sourceregion(destinationsize:)) method to find the region needed for each tile.\n\n## [See Also](\/documentation\/metalperformanceshaders\/tuning-hints#see-also)\n\n### [Fundamentals](\/documentation\/metalperformanceshaders\/tuning-hints#Fundamentals)\n\n[The MPSKernel Class](\/documentation\/metalperformanceshaders\/the-mpskernel-class)",
  "sections" : [
    {
      "content" : "",
      "title" : "Overview"
    },
    {
      "content" : "",
      "title" : "See Also"
    }
  ],
  "source" : "appleWebKit",
  "title" : "Tuning Hints | Apple Developer Documentation",
  "url" : "https:\/\/developer.apple.com\/documentation\/metalperformanceshaders\/tuning-hints"
}