{
  "abstract" : "Display your app’s content in a convenient, informative widget on various devices.",
  "codeExamples" : [
    {
      "code" : "@main\nstruct GameStatusWidget: Widget {\n    var body: some WidgetConfiguration {\n        StaticConfiguration(\n            kind: \"com.mygame.game-status\",\n            provider: GameStatusProvider(),\n        ) { entry in\n            GameStatusView(entry.gameStatus)\n        }\n        .configurationDisplayName(\"Game Status\")\n        .description(\"Shows an overview of your game status\")\n        .supportedFamilies([.systemSmall])\n    }\n}",
      "language" : "swift"
    },
    {
      "code" : "struct GameStatusEntry: TimelineEntry {\n    var date: Date\n    var gameStatus: String\n}",
      "language" : "swift"
    },
    {
      "code" : "struct GameStatusProvider: TimelineProvider {\n    func getTimeline(in context: Context, completion: @escaping (Timeline<GameStatusEntry>) -> Void) {\n        \/\/ Create a timeline entry for \"now.\"\n        let date = Date()\n        let entry = GameStatusEntry(\n            date: date,\n            gameStatus: gameStatusFromServer\n        )\n\n        \/\/ Create a date that's 15 minutes in the future.\n        let nextUpdateDate = Calendar.current.date(byAdding: .minute, value: 15, to: date)!\n\n        \/\/ Create the timeline with the entry and a reload policy with the date\n        \/\/ for the next update.\n        let timeline = Timeline(\n            entries:[entry],\n            policy: .after(nextUpdateDate)\n        )\n\n        \/\/ Call the completion to pass the timeline to WidgetKit.\n        completion(timeline)\n    }\n}",
      "language" : "swift"
    },
    {
      "code" : "struct GameStatusProvider: TimelineProvider {\n    var hasFetchedGameStatus: Bool\n    var gameStatusFromServer: String\n\n    func getSnapshot(in context: Context, completion: @escaping (Entry) -> Void) {\n        let date = Date()\n        let entry: GameStatusEntry\n\n        if context.isPreview && !hasFetchedGameStatus {\n            entry = GameStatusEntry(date: date, gameStatus: \"—\")\n        } else {\n            entry = GameStatusEntry(date: date, gameStatus: gameStatusFromServer)\n        }\n        completion(entry)\n    }",
      "language" : "swift"
    },
    {
      "code" : "struct GameStatusView : View {\n    @Environment(\\.widgetFamily) var family: WidgetFamily\n    var gameStatus: GameStatus\n    var selectedCharacter: CharacterDetail\n\n    @ViewBuilder\n    var body: some View {\n        switch family {\n        case .systemSmall: GameTurnSummary(gameStatus)\n        default: GameDetailsNotAvailable()\n        }\n    }\n}",
      "language" : "swift"
    },
    {
      "code" : "#Preview(as: .systemMedium, widget: {\n    EmojiRangerWidget()\n}, timeline: {\n    SimpleEntry(date: Date(), relevance: nil, hero: .spouty)\n})",
      "language" : "swift"
    }
  ],
  "contentHash" : "54f784d49823ec1ab0150c7dfaf9242f408bfa17d9f9536ec020b3911d8e7c43",
  "crawledAt" : "2025-12-04T00:19:15Z",
  "id" : "5CD99BB2-983C-465A-84AB-F13FA2D773C5",
  "kind" : "article",
  "language" : "swift",
  "module" : "WidgetKit",
  "overview" : "## Overview\n\nWidgets display relevant, glanceable content that people can quickly access for more details. Your app can provide a variety of widgets, letting people focus on the information that’s most important to them.\n\nA good way to get started with widgets and WidgetKit is by adding a *static* widget to your app. A static widget doesn’t need any configuration by a person. For example, a static widget might show a stock market summary, or the next event on the person’s calendar. The *data* the widget shows is dynamic, but the *type* of data it shows is fixed. Consider the information your app presents, and choose something that people would find useful to see at a glance on their device.\n\nWidgets can display data in many sizes, from small watch complications or Dynamic Island presentations, to extra large iPad and macOS widgets. The example that follows below focuses on a single size widget, the small system size, or [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/WidgetFamily\/systemSmall]. The example widget displays the status of a hypothetical game such as the health level of a character.\n\nYou build widgets using SwiftUI. While there are similarities to how you present views in your app, some aspects are unique to developing widgets. For more information about using SwiftUI, refer to [doc:\/\/com.apple.documentation\/documentation\/SwiftUI]. However, not all SwiftUI views work in widgets. For a list of the views that work in widgets, refer to [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/SwiftUI-Views].\n\n### Add a widget target to your app\n\nThe Widget Extension template provides a starting point for creating your widget. The template creates an extension target that contains a single widget. Later, you can add widgets to the same extension to display different types of information or to support additional widget sizes.\n\n\n\nThe widget extension template provides an initial implementation that conforms to the [doc:\/\/com.apple.documentation\/documentation\/SwiftUI\/Widget] protocol. The widget’s `body` property determines the type of content that the widget presents. Static widgets use a [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/StaticConfiguration] for the `body` property. Other types of widget configurations include:\n\nFor more information about these other widget configurations, refer to [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Making-a-Configurable-Widget], [doc:\/\/com.apple.documentation\/documentation\/ActivityKit\/displaying-live-data-with-live-activities], and [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Widget-Suggestions-In-Smart-Stacks].\n\n### Add configuration details\n\nTo configure a static widget, provide the following information:\n\nUse modifiers to provide additional configuration details, including a display name, a description, and the families the widget supports. The following code shows a widget that provides general status for a game:\n\nThe widget’s provider generates a timeline for the widget, and includes the game-status details in each entry. When the date of each timeline entry arrives, WidgetKit invokes the `content` closure to display the widget’s content. Finally, the modifiers specify the name and description shown in the widget gallery, and the sizes that the widget supports.\n\nNote the usage of the `@main` attribute on this widget. This attribute indicates that the `GameStatusWidget` is the entry point for the widget extension, implying that the extension contains a single widget. To support multiple widgets, refer to the [doc:\/\/com.apple.documentation\/documentation\/SwiftUI\/WidgetBundle].\n\n### Provide timeline entries\n\nThe timeline provider you define generates a sequence of timeline entries. Each specifies the date and time to update the widget’s content, and includes the data your widget needs to render its view. The game-status widget might define its timeline entry to include a string that represents the status of the game, as follows:\n\nWidgetKit calls [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/TimelineProvider\/getTimeline(in:completion:)] to request the timeline from the provider. The timeline consists of one or more timeline entries and a reload policy that informs WidgetKit when to request a subsequent timeline.\n\nThe following example shows how the game-status widget’s provider generates a timeline that consists of a single entry with the current game status from the server, and a reload policy to request a new timeline in 15 minutes:\n\nIn this example, if the widget didn’t have the current status from the server, it could store a reference to the completion, perform an asynchronous request to the server to fetch the game status, and call the completion when that request completes.\n\nFor more information about generating timelines, refer to [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Keeping-a-Widget-Up-To-Date] and [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Widget-Suggestions-In-Smart-Stacks]. For more information about handling network requests, refer to [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Making-network-requests-in-a-widget-extension].\n\n### Generate a preview for the widget gallery\n\nIn order for people to be able to use your widget, it needs to be available in the widget gallery. To show your widget in the widget gallery, WidgetKit asks the provider for a *preview snapshot* that displays generic data. WidgetKit makes this request by calling the provider’s [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/TimelineProvider\/getSnapshot(in:completion:)] method with the `context` parameter’s [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/TimelineProviderContext\/isPreview] property set to `true`.\n\nIn response, you need to create the preview snapshot quickly. If your widget would normally need assets or information that takes time to generate or fetch from a server, use sample data instead.\n\nIn the following code, the game-status widget’s provider implements the snapshot method by showing the game status if it’s available, falling back to an empty status if it doesn’t have the status from its server:\n\n### Display content in your widget\n\nWidgets define their content using a SwiftUI view, commonly by composing other SwiftUI views. As shown in the [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Creating-a-Widget-Extension#Add-configuration-details] section, the widget configuration contains the closure that WidgetKit invokes to render the widget’s content.\n\nWhen people add your widget from the widget gallery, they choose the specific family — for example, small or medium — from the ones your widget supports. The widget’s content closure has to be capable of rendering each family the widget supports. WidgetKit sets the corresponding family and additional properties, such as the color scheme (light or dark), in the SwiftUI environment.\n\nIn the game-status widget’s configuration shown above, the content closure uses a `GameStatusView` to display the status. Because this widget only supports the `.systemSmall` family, it uses a composed `GameTurnSummary` SwiftUI view to display a summary of the game’s current status. For any other family size, it shows the default view, which indicates that game status is unavailable.\n\nIn your widget, as you add more supported families to the widget’s configuration, you would add additional cases in the widget view’s `body` property for each additional family.\n\n### Display a placeholder widget\n\nA placeholder view is similar to a preview snapshot, but instead of showing example data to let people see the type of data the widget displays, it shows a generic visual representation with no specific content. When WidgetKit renders your widget, it may need to render your content as a placeholder, for example, while you load data in the background or if you tell the system that your widget contains sensitive information.\n\n### Hide sensitive content\n\nWidgets and watch complications may show sensitive information and can be highly visible, especially on devices with an Always-On display. When you create your widget or watch complication, review its content and consider hiding sensitive information.\n\nTo let people decide whether a widget should show sensitive data on a locked device, mark views that contain sensitive information using the [doc:\/\/com.apple.documentation\/documentation\/SwiftUI\/View\/privacySensitive(_:)] modifier. In iOS, people can configure whether to show sensitive data on the Lock Screen and during Always On. In Settings, they can deactivate data access for Lock Screen widgets in the ALLOW ACCESS WHEN LOCKED section of Settings > Face ID & Passcode. On Apple Watch, people can configure whether to show sensitive data during Always On by Choosing Settings > Display & Brightness > Always On > Hide Sensitive Complications. They can choose to show redacted content for all or individual complications.\n\nIf a person chooses to hide privacy sensitive content, WidgetKit renders a placeholder or redactions you configure. To configure redactions, implement the [doc:\/\/com.apple.documentation\/documentation\/SwiftUI\/View\/redacted(reason:)] callback, read out the [doc:\/\/com.apple.documentation\/documentation\/SwiftUI\/RedactionReasons\/privacy] property, and provide custom placeholder views. You can also choose to render a view as unredacted with the [doc:\/\/com.apple.documentation\/documentation\/SwiftUI\/View\/unredacted()] view modifier.\n\nAs an alternative to marking individual views as privacy sensitive, for example, if your entire widget content is privacy sensitive, you can add the Data Protection capability to your widget extension. Until a person unlocks their device to match the privacy level you chose, WidgetKit displays a placeholder instead of the widget content. First, enable the Data Protection capability for your widget extension in Xcode, then set the [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Entitlements\/com.apple.developer.default-data-protection] entitlement to the value that fits the level of privacy you want to offer:\n\nIf you choose the `NSFileProtectionCompleteUntilFirstUserAuthentication` or `NSFileProtectionNone` protection level for your widget extension:\n\n### Add dynamic content to your widget\n\nWidgets typically present read-only information and don’t generally support interactive elements such as scrolling lists or text input. Widgets support some interactive elements and animations. For details on adding interactivity to your widgets, refer to [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Adding-interactivity-to-widgets-and-Live-Activities].\n\nFor a list of views that WidgetKit supports, refer to [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/SwiftUI-Views]. WidgetKit ignores other views when it renders the widget’s content.\n\nAlthough the display of a widget is based on a snapshot of your view, you can use various SwiftUI views that continue to update while your widget is visible. For more about providing dynamic content, refer to [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Keeping-a-Widget-Up-To-Date] and [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Displaying-Dynamic-Dates].\n\n### Respond to user interactions\n\nWhen people interact with your widget, beyond interactive elements described above, the system launches your app to handle the request. When the system activates your app, navigate to the details that correspond to the widget’s content. Your widget can specify a URL to inform the app what content to display. To configure custom URLs in your widget:\n\nFor more details about adding links from your widgets to your app, refer to [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Linking-to-specific-app-scenes-from-your-widget-or-Live-Activity].\n\n### Preview widgets in Xcode\n\nXcode allows you to look at previews of your widgets without running your app in Simulator or on a test device. The following example shows the preview code from the Emoji Rangers widget of the [doc:\/\/com.apple.documentation\/documentation\/widgetkit\/building_widgets_using_widgetkit_and_swiftui] sample code project.\n\nAs you support more widget families in your widget, you can add more preview views to see multiple sizes in a single preview.\n\nFor additional information about previewing widgets, refer to [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Previewing-widgets-and-live-activities-in-xcode].\n\n### Expand your widget’s capabilities\n\nTo give people flexible access to your app’s content, you can support additional families, add widget types, make your widgets user-configurable, or add support for Live Activities if your app presents live data. To explore a plan to support additional features, refer to [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Developing-a-WidgetKit-strategy].\n\nTo explore WidgetKit code for the first time, refer to the following sample code projects:\n\n### Create multiple widget extensions\n\nYou can include multiple widget types in your widget extension, although your app can contain multiple extensions. For example, if some of your widgets use location information and others don’t, keep the widgets that use location information in a separate extension. This allows the system to prompt someone for authorization to use location information only for the widgets from the extension that uses location information. For details about bundling multiple widgets in an extension, refer to [doc:\/\/com.apple.documentation\/documentation\/SwiftUI\/WidgetBundle].",
  "rawMarkdown" : "---\nsource: https:\/\/developer.apple.com\/documentation\/widgetkit\/creating-a-widget-extension\ncrawled: 2025-12-04T00:19:15Z\n---\n\n# Creating a widget extension\n\n**Article**\n\nDisplay your app’s content in a convenient, informative widget on various devices.\n\n## Overview\n\nWidgets display relevant, glanceable content that people can quickly access for more details. Your app can provide a variety of widgets, letting people focus on the information that’s most important to them.\n\nA good way to get started with widgets and WidgetKit is by adding a *static* widget to your app. A static widget doesn’t need any configuration by a person. For example, a static widget might show a stock market summary, or the next event on the person’s calendar. The *data* the widget shows is dynamic, but the *type* of data it shows is fixed. Consider the information your app presents, and choose something that people would find useful to see at a glance on their device.\n\nWidgets can display data in many sizes, from small watch complications or Dynamic Island presentations, to extra large iPad and macOS widgets. The example that follows below focuses on a single size widget, the small system size, or [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/WidgetFamily\/systemSmall]. The example widget displays the status of a hypothetical game such as the health level of a character.\n\nYou build widgets using SwiftUI. While there are similarities to how you present views in your app, some aspects are unique to developing widgets. For more information about using SwiftUI, refer to [doc:\/\/com.apple.documentation\/documentation\/SwiftUI]. However, not all SwiftUI views work in widgets. For a list of the views that work in widgets, refer to [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/SwiftUI-Views].\n\n### Add a widget target to your app\n\nThe Widget Extension template provides a starting point for creating your widget. The template creates an extension target that contains a single widget. Later, you can add widgets to the same extension to display different types of information or to support additional widget sizes.\n\n1. Open your app project in Xcode and choose File > New > Target.\n2. From the Application Extension group, select Widget Extension, and then click Next.\n3. Enter the name of your extension.\n4. Deselect the Include Live Activity and Include Configuration App Intent checkboxes, if they’re selected.\n5. Click Finish.\n\n\n\n\n\nThe widget extension template provides an initial implementation that conforms to the [doc:\/\/com.apple.documentation\/documentation\/SwiftUI\/Widget] protocol. The widget’s `body` property determines the type of content that the widget presents. Static widgets use a [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/StaticConfiguration] for the `body` property. Other types of widget configurations include:\n\n- [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/AppIntentConfiguration] that enables user customization, such as a weather widget that needs a zip or postal code for a city, or a package-tracking widget that needs a tracking number.\n- [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/ActivityConfiguration] to present live data, such as scores during a sporting event or a food delivery estimate.\n- [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/RelevanceConfiguration] to provide relevance clues for widgets in watchOS.\n\nFor more information about these other widget configurations, refer to [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Making-a-Configurable-Widget], [doc:\/\/com.apple.documentation\/documentation\/ActivityKit\/displaying-live-data-with-live-activities], and [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Widget-Suggestions-In-Smart-Stacks].\n\n### Add configuration details\n\nTo configure a static widget, provide the following information:\n\n\n\nUse modifiers to provide additional configuration details, including a display name, a description, and the families the widget supports. The following code shows a widget that provides general status for a game:\n\n```swift\n@main\nstruct GameStatusWidget: Widget {\n    var body: some WidgetConfiguration {\n        StaticConfiguration(\n            kind: \"com.mygame.game-status\",\n            provider: GameStatusProvider(),\n        ) { entry in\n            GameStatusView(entry.gameStatus)\n        }\n        .configurationDisplayName(\"Game Status\")\n        .description(\"Shows an overview of your game status\")\n        .supportedFamilies([.systemSmall])\n    }\n}\n```\n\nThe widget’s provider generates a timeline for the widget, and includes the game-status details in each entry. When the date of each timeline entry arrives, WidgetKit invokes the `content` closure to display the widget’s content. Finally, the modifiers specify the name and description shown in the widget gallery, and the sizes that the widget supports.\n\n\n\nNote the usage of the `@main` attribute on this widget. This attribute indicates that the `GameStatusWidget` is the entry point for the widget extension, implying that the extension contains a single widget. To support multiple widgets, refer to the [doc:\/\/com.apple.documentation\/documentation\/SwiftUI\/WidgetBundle].\n\n### Provide timeline entries\n\nThe timeline provider you define generates a sequence of timeline entries. Each specifies the date and time to update the widget’s content, and includes the data your widget needs to render its view. The game-status widget might define its timeline entry to include a string that represents the status of the game, as follows:\n\n```swift\nstruct GameStatusEntry: TimelineEntry {\n    var date: Date\n    var gameStatus: String\n}\n```\n\nWidgetKit calls [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/TimelineProvider\/getTimeline(in:completion:)] to request the timeline from the provider. The timeline consists of one or more timeline entries and a reload policy that informs WidgetKit when to request a subsequent timeline.\n\n\n\nThe following example shows how the game-status widget’s provider generates a timeline that consists of a single entry with the current game status from the server, and a reload policy to request a new timeline in 15 minutes:\n\n```swift\nstruct GameStatusProvider: TimelineProvider {\n    func getTimeline(in context: Context, completion: @escaping (Timeline<GameStatusEntry>) -> Void) {\n        \/\/ Create a timeline entry for \"now.\"\n        let date = Date()\n        let entry = GameStatusEntry(\n            date: date,\n            gameStatus: gameStatusFromServer\n        )\n\n        \/\/ Create a date that's 15 minutes in the future.\n        let nextUpdateDate = Calendar.current.date(byAdding: .minute, value: 15, to: date)!\n\n        \/\/ Create the timeline with the entry and a reload policy with the date\n        \/\/ for the next update.\n        let timeline = Timeline(\n            entries:[entry],\n            policy: .after(nextUpdateDate)\n        )\n\n        \/\/ Call the completion to pass the timeline to WidgetKit.\n        completion(timeline)\n    }\n}\n```\n\nIn this example, if the widget didn’t have the current status from the server, it could store a reference to the completion, perform an asynchronous request to the server to fetch the game status, and call the completion when that request completes.\n\nFor more information about generating timelines, refer to [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Keeping-a-Widget-Up-To-Date] and [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Widget-Suggestions-In-Smart-Stacks]. For more information about handling network requests, refer to [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Making-network-requests-in-a-widget-extension].\n\n### Generate a preview for the widget gallery\n\nIn order for people to be able to use your widget, it needs to be available in the widget gallery. To show your widget in the widget gallery, WidgetKit asks the provider for a *preview snapshot* that displays generic data. WidgetKit makes this request by calling the provider’s [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/TimelineProvider\/getSnapshot(in:completion:)] method with the `context` parameter’s [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/TimelineProviderContext\/isPreview] property set to `true`.\n\nIn response, you need to create the preview snapshot quickly. If your widget would normally need assets or information that takes time to generate or fetch from a server, use sample data instead.\n\nIn the following code, the game-status widget’s provider implements the snapshot method by showing the game status if it’s available, falling back to an empty status if it doesn’t have the status from its server:\n\n```swift\nstruct GameStatusProvider: TimelineProvider {\n    var hasFetchedGameStatus: Bool\n    var gameStatusFromServer: String\n\n    func getSnapshot(in context: Context, completion: @escaping (Entry) -> Void) {\n        let date = Date()\n        let entry: GameStatusEntry\n\n        if context.isPreview && !hasFetchedGameStatus {\n            entry = GameStatusEntry(date: date, gameStatus: \"—\")\n        } else {\n            entry = GameStatusEntry(date: date, gameStatus: gameStatusFromServer)\n        }\n        completion(entry)\n    }\n```\n\n### Display content in your widget\n\nWidgets define their content using a SwiftUI view, commonly by composing other SwiftUI views. As shown in the [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Creating-a-Widget-Extension#Add-configuration-details] section, the widget configuration contains the closure that WidgetKit invokes to render the widget’s content.\n\nWhen people add your widget from the widget gallery, they choose the specific family — for example, small or medium — from the ones your widget supports. The widget’s content closure has to be capable of rendering each family the widget supports. WidgetKit sets the corresponding family and additional properties, such as the color scheme (light or dark), in the SwiftUI environment.\n\nIn the game-status widget’s configuration shown above, the content closure uses a `GameStatusView` to display the status. Because this widget only supports the `.systemSmall` family, it uses a composed `GameTurnSummary` SwiftUI view to display a summary of the game’s current status. For any other family size, it shows the default view, which indicates that game status is unavailable.\n\n```swift\nstruct GameStatusView : View {\n    @Environment(\\.widgetFamily) var family: WidgetFamily\n    var gameStatus: GameStatus\n    var selectedCharacter: CharacterDetail\n\n    @ViewBuilder\n    var body: some View {\n        switch family {\n        case .systemSmall: GameTurnSummary(gameStatus)\n        default: GameDetailsNotAvailable()\n        }\n    }\n}\n```\n\nIn your widget, as you add more supported families to the widget’s configuration, you would add additional cases in the widget view’s `body` property for each additional family.\n\n\n\n### Display a placeholder widget\n\nA placeholder view is similar to a preview snapshot, but instead of showing example data to let people see the type of data the widget displays, it shows a generic visual representation with no specific content. When WidgetKit renders your widget, it may need to render your content as a placeholder, for example, while you load data in the background or if you tell the system that your widget contains sensitive information.\n\n### Hide sensitive content\n\nWidgets and watch complications may show sensitive information and can be highly visible, especially on devices with an Always-On display. When you create your widget or watch complication, review its content and consider hiding sensitive information.\n\nTo let people decide whether a widget should show sensitive data on a locked device, mark views that contain sensitive information using the [doc:\/\/com.apple.documentation\/documentation\/SwiftUI\/View\/privacySensitive(_:)] modifier. In iOS, people can configure whether to show sensitive data on the Lock Screen and during Always On. In Settings, they can deactivate data access for Lock Screen widgets in the ALLOW ACCESS WHEN LOCKED section of Settings > Face ID & Passcode. On Apple Watch, people can configure whether to show sensitive data during Always On by Choosing Settings > Display & Brightness > Always On > Hide Sensitive Complications. They can choose to show redacted content for all or individual complications.\n\nIf a person chooses to hide privacy sensitive content, WidgetKit renders a placeholder or redactions you configure. To configure redactions, implement the [doc:\/\/com.apple.documentation\/documentation\/SwiftUI\/View\/redacted(reason:)] callback, read out the [doc:\/\/com.apple.documentation\/documentation\/SwiftUI\/RedactionReasons\/privacy] property, and provide custom placeholder views. You can also choose to render a view as unredacted with the [doc:\/\/com.apple.documentation\/documentation\/SwiftUI\/View\/unredacted()] view modifier.\n\nAs an alternative to marking individual views as privacy sensitive, for example, if your entire widget content is privacy sensitive, you can add the Data Protection capability to your widget extension. Until a person unlocks their device to match the privacy level you chose, WidgetKit displays a placeholder instead of the widget content. First, enable the Data Protection capability for your widget extension in Xcode, then set the [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Entitlements\/com.apple.developer.default-data-protection] entitlement to the value that fits the level of privacy you want to offer:\n\n\n\nIf you choose the `NSFileProtectionCompleteUntilFirstUserAuthentication` or `NSFileProtectionNone` protection level for your widget extension:\n\n- WidgetKit uses its default behavior and displays a placeholder until a person authenticates after they reboot their device.\n- iOS widgets are available as iPhone widgets on Mac.\n\n### Add dynamic content to your widget\n\nWidgets typically present read-only information and don’t generally support interactive elements such as scrolling lists or text input. Widgets support some interactive elements and animations. For details on adding interactivity to your widgets, refer to [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Adding-interactivity-to-widgets-and-Live-Activities].\n\nFor a list of views that WidgetKit supports, refer to [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/SwiftUI-Views]. WidgetKit ignores other views when it renders the widget’s content.\n\nAlthough the display of a widget is based on a snapshot of your view, you can use various SwiftUI views that continue to update while your widget is visible. For more about providing dynamic content, refer to [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Keeping-a-Widget-Up-To-Date] and [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Displaying-Dynamic-Dates].\n\n### Respond to user interactions\n\nWhen people interact with your widget, beyond interactive elements described above, the system launches your app to handle the request. When the system activates your app, navigate to the details that correspond to the widget’s content. Your widget can specify a URL to inform the app what content to display. To configure custom URLs in your widget:\n\n- For all widgets, add the [doc:\/\/com.apple.documentation\/documentation\/SwiftUI\/View\/widgetURL(_:)] view modifier to a view in your widget’s view hierarchy. If the widget’s view hierarchy includes more than one `widgetURL` modifier, the behavior is undefined.\n- For widgets that use [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/WidgetFamily\/systemMedium], [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/WidgetFamily\/systemLarge], or [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/WidgetFamily\/systemExtraLarge], add one or more [doc:\/\/com.apple.documentation\/documentation\/SwiftUI\/Link] controls to your widget’s view hierarchy. You can use both `widgetURL` and `Link` controls. If the interaction targets a `Link` control, the system uses the URL in that control. For interactions anywhere else in the widget, the system uses the URL specified in the `widgetURL` view modifier.\n\nFor more details about adding links from your widgets to your app, refer to [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Linking-to-specific-app-scenes-from-your-widget-or-Live-Activity].\n\n### Preview widgets in Xcode\n\nXcode allows you to look at previews of your widgets without running your app in Simulator or on a test device. The following example shows the preview code from the Emoji Rangers widget of the [doc:\/\/com.apple.documentation\/documentation\/widgetkit\/building_widgets_using_widgetkit_and_swiftui] sample code project.\n\n```swift\n#Preview(as: .systemMedium, widget: {\n    EmojiRangerWidget()\n}, timeline: {\n    SimpleEntry(date: Date(), relevance: nil, hero: .spouty)\n})\n```\n\nAs you support more widget families in your widget, you can add more preview views to see multiple sizes in a single preview.\n\nFor additional information about previewing widgets, refer to [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Previewing-widgets-and-live-activities-in-xcode].\n\n### Expand your widget’s capabilities\n\nTo give people flexible access to your app’s content, you can support additional families, add widget types, make your widgets user-configurable, or add support for Live Activities if your app presents live data. To explore a plan to support additional features, refer to [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/Developing-a-WidgetKit-strategy].\n\nTo explore WidgetKit code for the first time, refer to the following sample code projects:\n\n- [doc:\/\/com.apple.documentation\/documentation\/widgetkit\/building_widgets_using_widgetkit_and_swiftui] is the sample code project associated with the WWDC20 code-alongs [https:\/\/developer.apple.com\/videos\/play\/wwdc2020\/10034\/], [https:\/\/developer.apple.com\/videos\/play\/wwdc2020\/10035\/], and [https:\/\/developer.apple.com\/videos\/play\/wwdc2020\/10036\/], where you learn how to build your first widget.\n- [doc:\/\/com.apple.WidgetKit\/documentation\/WidgetKit\/emoji-rangers-supporting-live-activities-interactivity-and-animations] expands the Emoji Rangers sample code project to include Lock Screen widgets, Live Activities, interactivity, and animations.\n- [doc:\/\/com.apple.documentation\/documentation\/AppClip\/fruta-building-a-feature-rich-app-with-swiftui] and [doc:\/\/com.apple.documentation\/documentation\/SwiftUI\/Backyard-birds-sample] are sample code projects that support widgets in addition to other technologies like [doc:\/\/com.apple.documentation\/documentation\/AppClip] and [doc:\/\/com.apple.documentation\/documentation\/SwiftData].\n\n### Create multiple widget extensions\n\nYou can include multiple widget types in your widget extension, although your app can contain multiple extensions. For example, if some of your widgets use location information and others don’t, keep the widgets that use location information in a separate extension. This allows the system to prompt someone for authorization to use location information only for the widgets from the extension that uses location information. For details about bundling multiple widgets in an extension, refer to [doc:\/\/com.apple.documentation\/documentation\/SwiftUI\/WidgetBundle].\n\n## Essentials\n\n- **Developing a WidgetKit strategy**: Explore features, tasks, related frameworks, and constraints as you make a plan to implement widgets, controls, watch complications, and Live Activities.\n- **WidgetKit updates**: Learn about important changes in WidgetKit.\n- **Emoji Rangers: Supporting Live Activities, interactivity, and animations**: Offer Live Activities, controls, animate data updates, and add interactivity to widgets.\n- **WidgetBundle**: A container used to expose multiple widgets from a single widget extension.\n\n",
  "sections" : [
    {
      "content" : "",
      "items" : [
        {
          "description" : "Explore features, tasks, related frameworks, and constraints as you make a plan to implement widgets, controls, watch complications, and Live Activities.",
          "name" : "Developing a WidgetKit strategy",
          "url" : "https:\/\/developer.apple.com\/documentation\/WidgetKit\/Developing-a-WidgetKit-strategy"
        },
        {
          "description" : "Learn about important changes in WidgetKit.",
          "name" : "WidgetKit updates",
          "url" : "https:\/\/developer.apple.com\/documentation\/Updates\/WidgetKit"
        },
        {
          "description" : "Offer Live Activities, controls, animate data updates, and add interactivity to widgets.",
          "name" : "Emoji Rangers: Supporting Live Activities, interactivity, and animations",
          "url" : "https:\/\/developer.apple.com\/documentation\/WidgetKit\/emoji-rangers-supporting-live-activities-interactivity-and-animations"
        },
        {
          "description" : "A container used to expose multiple widgets from a single widget extension.",
          "name" : "WidgetBundle",
          "url" : "https:\/\/developer.apple.com\/documentation\/SwiftUI\/WidgetBundle"
        }
      ],
      "title" : "Essentials"
    }
  ],
  "source" : "appleJSON",
  "title" : "Creating a widget extension",
  "url" : "https:\/\/developer.apple.com\/documentation\/widgetkit\/creating-a-widget-extension"
}