{
  "codeExamples" : [

  ],
  "contentHash" : "f725111f29d23683391a5c1ed4c499d2303b476e998fc55ce366ed0a7c7a3bab",
  "crawledAt" : "2025-12-06T22:22:18Z",
  "id" : "DC5B172E-CB15-4DB1-A8C7-320F1B26611D",
  "kind" : "unknown",
  "rawMarkdown" : "---\nsource: https:\/\/developer.apple.com\/documentation\/kernel\/os_log_type_t\ncrawled: 2025-12-06T22:22:18Z\n---\n\n# os_log_type_t | Apple Developer Documentation\n\n- [ Kernel ](\/documentation\/kernel)\n\n- [ Kernel Enumerations ](\/documentation\/kernel\/kernel_enumerations)\n\n- [ os_log_type_t ](\/documentation\/kernel\/os_log_type_t)\n\n- [ Kernel Enumerations ](\/documentation\/kernel\/kernel_enumerations)\n\n-  os_log_type_t \n\nEnumeration# os_log_type_t\n\nmacOS 10.12+\n\n```\ntypedef enum os_log_type_t : uint8_t {\n    ...\n} os_log_type_t;\n```\n\n## [Topics](\/documentation\/kernel\/os_log_type_t#topics)\n\n### [Constants](\/documentation\/kernel\/os_log_type_t#1647609)\n\n[`OS_LOG_TYPE_DEBUG`](\/documentation\/kernel\/os_log_type_t\/os_log_type_debug)Debug-level messages are only captured in memory when debug logging is enabled through a configuration change. They’re purged in accordance with the configuration’s persistence setting. Messages logged at this level contain information that may be useful during development or while troubleshooting a specific problem. Debug logging is intended for use in a development environment and not in shipping software. Logging a message of this type is equivalent to calling the `os_log_debug` function.[`OS_LOG_TYPE_DEFAULT`](\/documentation\/kernel\/os_log_type_t\/os_log_type_default)Default-level messages are initially stored in memory buffers. Without a configuration change, they are compressed and moved to the data store as memory buffers fill. They remain there until a storage quota is exceeded, at which point, the oldest messages are purged. Use this level to capture information about things that *might* result a failure. Logging a message of this type is equivalent to calling the `os_log` function.[`OS_LOG_TYPE_ERROR`](\/documentation\/kernel\/os_log_type_t\/os_log_type_error)Error-level messages are always saved in the data store. They remain there until a storage quota is exceeded, at which point, the oldest messages are purged. Error-level messages are intended for reporting process-level errors. If an activity object exists, logging at this level captures information for the entire process chain. Logging a message of this type is equivalent to calling the `os_log_error` function.[`OS_LOG_TYPE_FAULT`](\/documentation\/kernel\/os_log_type_t\/os_log_type_fault)Fault-level messages are always saved in the data store. They remain there until a storage quota is exceeded, at which point, the oldest messages are purged. Fault-level messages are intended for capturing system-level or multi-process errors only. If an activity object exists, logging at this level captures information for the entire process chain. Logging a message at this level is equivalent to calling the `os_log_fault` function.[`OS_LOG_TYPE_INFO`](\/documentation\/kernel\/os_log_type_t\/os_log_type_info)Info-level messages are initially stored in memory buffers. Without a configuration change, they are not moved to the data store and are purged as memory buffers fill. They are, however, captured in the data store when faults and, optionally, errors occur. When info-level messages are added to the data store, they remain there until a storage quota is exceeded, at which point, the oldest messages are purged. Use this level to capture information that may be helpful, but isn’t essential, for troubleshooting errors. Logging a message of this type is equivalent to calling the `os_log_info` function.",
  "sections" : [
    {
      "content" : "",
      "title" : "Topics"
    }
  ],
  "source" : "appleWebKit",
  "title" : "os_log_type_t | Apple Developer Documentation",
  "url" : "https:\/\/developer.apple.com\/documentation\/kernel\/os_log_type_t"
}