{
  "abstract" : "Initializes and returns a file coordinator object using the specified file presenter.",
  "codeExamples" : [

  ],
  "contentHash" : "44520c4f52f68a142fe07f4c7dd7f13f8db116c7c6ba103ba47c303d761f2a80",
  "crawledAt" : "2025-12-06T01:22:21Z",
  "declaration" : {
    "code" : "init(filePresenter filePresenterOrNil: (any NSFilePresenter)?)",
    "language" : "swift"
  },
  "id" : "277EDA4E-66FB-4A8E-B6A4-27608D27C076",
  "kind" : "unknown",
  "language" : "swift",
  "module" : "Foundation",
  "overview" : "## Return Value\n\nA file coordinator object to use to coordinate file-related operations.\n\n## Discussion\n\nSpecifying a file presenter at initialization time is strongly recommended, especially if the file presenter is initiating the file operation. Otherwise, the file presenter itself would receive notifications when it made changes to the file and would have to compensate for that fact. Receiving such notifications could also deadlock if the file presenter’s code and its notifications run on the same thread.\n\nSpecifically, associating an NSFileCoordinator with an NSFilePresenter accomplishes the following:",
  "platforms" : [
    "iOS",
    "iPadOS",
    "Mac Catalyst",
    "macOS",
    "tvOS",
    "visionOS",
    "watchOS"
  ],
  "rawMarkdown" : "---\nsource: https:\/\/developer.apple.com\/documentation\/Foundation\/NSFileCoordinator\/init(filePresenter:)\ncrawled: 2025-12-06T01:22:21Z\n---\n\n# init(filePresenter:)\n\n**Initializer**\n\nInitializes and returns a file coordinator object using the specified file presenter.\n\n## Declaration\n\n```swift\ninit(filePresenter filePresenterOrNil: (any NSFilePresenter)?)\n```\n\n## Parameters\n\n- **filePresenterOrNil**: The file presenter object that is initiating some action on its file or directory. This object is assumed to be performing the relevant file or directory operations and therefore does not receive notifications about those operations from the returned file coordinator object. This parameter may be `nil`.\n\n## Return Value\n\nA file coordinator object to use to coordinate file-related operations.\n\n## Discussion\n\nSpecifying a file presenter at initialization time is strongly recommended, especially if the file presenter is initiating the file operation. Otherwise, the file presenter itself would receive notifications when it made changes to the file and would have to compensate for that fact. Receiving such notifications could also deadlock if the file presenter’s code and its notifications run on the same thread.\n\nSpecifically, associating an NSFileCoordinator with an NSFilePresenter accomplishes the following:\n\n- Prevents the file coordinator from sending messages to the file presenter. This means that the file presenter won’t receive notifications about its own file operations. There is one exception: Messages about versions of the presented item being added, remove, or resolved during coordinated writing are sent to every relevant file presenter.\n- Prevents deadlocks that could occur when the file presenter performs a coordinated write operation in response to a [doc:\/\/com.apple.foundation\/documentation\/Foundation\/NSFilePresenter\/savePresentedItemChanges(completionHandler:)] message. Usually, coordinated writes must wait for all the coordinated read operations on the same file or directory. However, when a coordinated read forces a file presenter to write its contents, the write operation must proceed before the read operation can finish.\n- Prevents race conditions that could occur when the file presenter is sent a [doc:\/\/com.apple.foundation\/documentation\/Foundation\/NSFilePresenter\/presentedItemDidMove(to:)] message and at the same time—but before this message is dequeued—the file presenter enqueues an operation using the old URL on a different queue. For the file coordinators to work effectively, however, the coordinator must be initialized on the same operation queue that the file presenter uses to receive its messages.\n- Allows the file coordination mechanism to gracefully handle file presenters that initially contain `nil` in the [doc:\/\/com.apple.foundation\/documentation\/Foundation\/NSFilePresenter\/presentedItemURL] property, but that can later contain a non-`nil` value after creating the item using a coordinated write operation. For example, AppKit uses this feature to instantiate new [doc:\/\/com.apple.documentation\/documentation\/AppKit\/NSDocument] objects immediately, instead of waiting until after the user saves the document.\n\n",
  "sections" : [

  ],
  "source" : "appleJSON",
  "title" : "init(filePresenter:)",
  "url" : "https:\/\/developer.apple.com\/documentation\/Foundation\/NSFileCoordinator\/init(filePresenter:)"
}