{
  "abstract" : "Make remote files available in macOS and iOS, and synchronize their states by using file provider extensions.",
  "codeExamples" : [
    {
      "code" : "func addDomain(displayName: String, accountIdentifier: String) {\n    \n    let domain = NSFileProviderDomain(identifier: NSFileProviderDomainIdentifier(rawValue: accountIdentifier), displayName: displayName)\n    NSFileProviderManager.add(domain) { _ in }\n}",
      "language" : "swift"
    },
    {
      "code" : "class ItemEnumerator: NSObject, NSFileProviderEnumerator",
      "language" : "swift"
    },
    {
      "code" : "public func modifyItem(_ item: NSFileProviderItem, baseVersion version: NSFileProviderItemVersion, changedFields: NSFileProviderItemFields,\n                       contents newContents: URL?, options: NSFileProviderModifyItemOptions = [], request: NSFileProviderRequest,\n                       completionHandler: @escaping (NSFileProviderItem?, NSFileProviderItemFields, Bool, Error?) -> Void) -> Progress",
      "language" : "swift"
    },
    {
      "code" : "public func fetchContents(for itemIdentifier: NSFileProviderItemIdentifier,\n                          version requestedVersion: NSFileProviderItemVersion?,\n                          request: NSFileProviderRequest,\n                          completionHandler: @escaping (URL?, NSFileProviderItem?, Error?) -> Void) -> Progress",
      "language" : "swift"
    },
    {
      "code" : "public func fetchPartialContents(for itemIdentifier: NSFileProviderItemIdentifier,\n                                 version requestedVersion: NSFileProviderItemVersion,\n                                 request: NSFileProviderRequest,\n                                 minimalRange range: NSRange,\n                                 aligningTo alignment: Int,\n                                 options: NSFileProviderFetchContentsOptions,\n                                 completionHandler:\n                                 @escaping (URL?, NSFileProviderItem?, NSRange,\n                                            NSFileProviderMaterializationFlags,\n                                            Error?) -> Void) -> Progress",
      "language" : "swift"
    },
    {
      "code" : "var decorations: [NSFileProviderItemDecorationIdentifier]?",
      "language" : "swift"
    },
    {
      "code" : "public func performAction(identifier actionIdentifier: NSFileProviderExtensionActionIdentifier,\n                          onItemsWithIdentifiers itemIdentifiers: [NSFileProviderItemIdentifier],\n                          completionHandler: @escaping (Error?) -> Void) -> Progress",
      "language" : "swift"
    },
    {
      "code" : "public override func prepare(forError error: Error) {\n    prepare(AuthenticationViewController())\n}",
      "language" : "swift"
    },
    {
      "code" : "try await manager.signalErrorResolved(NSFileProviderError(.notAuthenticated))",
      "language" : "swift"
    }
  ],
  "contentHash" : "3083fd75e126ac8507eda52a6b3ceec9a8b8926d3dc94af82a7f11f6449ae8e2",
  "crawledAt" : "2025-12-02T15:29:06Z",
  "id" : "2CF6A8DB-7003-4C9D-8FF1-E7EA3AD62AC3",
  "kind" : "unknown",
  "language" : "swift",
  "module" : "File Provider",
  "overview" : "## Overview\n\nMore and more people use cloud storage to store and share digital assets. Developers can seamlessly integrate their cloud storage service with macOS and iOS by creating file provider extensions to expose items on their server as files or folders in macOS and iOS, and synchronize their states.\n\nThis sample code project implements file provider extensions that sync content between a file storage server and both macOS and iOS, so the files on the server are available on the local system and accessible through user interactions and system-provided APIs. It also demonstrates how to synchronize the states of the file provider items between the server and the systems, and how to enhance the user experience using decorations and custom actions. It includes a macOS app and an iOS app that implement a management interface for users to log in to the server and try out other features. The macOS app implements a simplified file storage server with HTTP-based communication to act as the backend of the file provider extensions.\n\n### Configure the sample code project\n\nTo build the sample app, perform the following steps in Xcode:\n\nTo try out the macOS app:\n\nTo try out the sample app in iOS:\n\n### Understand the targets of the sample project\n\nThis sample project consists of the following targets:\n\n### Manage file provider domains\n\nA file provider domain ([doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderDomain]) represents a location on the sidebar of Finder (macOS) or Files (iOS). A file provider extension can have multiple domains to provide different item sets and apply per-domain account authentication. macOS and iOS create one extension instance for each domain, so all the domains work independently.\n\nA file provider extension by default doesn’t have a domain, and so doesn’t show up in the location list of Finder or Files before users add one. In the sample, users add a domain by tapping the Add button (+) in `FruitBasket-iOS.app` (or Add Domain in `FruitBasket.app`), which triggers the following code:\n\nThe domain name needs to be unique. Adding a domain with a name that conflicts with an existing domain triggers an NSFileWriteFileExistsError error.\n\nUsers can delete a domain by selecting it and tapping the Remove Domain button, which eventually triggers [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderManager\/remove(_:completionHandler:)] or [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderManager\/remove(_:mode:completionHandler:)]. In iOS, deleting a domain deletes all the files. In macOS, apps can keep downloaded files or files that contain unsynchronized local changes by specifying a removal mode ([doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderManager\/DomainRemovalMode]).\n\n### Enumerate file provider items\n\nAfter users add a domain, the system immediately asks the file provider extension for an enumerator (an object that implements [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderEnumerator]) by calling [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderEnumerating\/enumerator(for:request:)], and then triggers enumerations to request the items.\n\nFile provider extensions need to implement `enumerator(for:request:)` to provide the enumerator the system requests based on the `containerItemIdentifier` parameter, which can be [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderItemIdentifier\/rootContainer], [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderItemIdentifier\/workingSet], [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderItemIdentifier\/trashContainer], or a provider-supplied item identifier. All the enumerators need to support the initial enumeration by implementing [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderEnumerator\/enumerateItems(for:startingAt:)], which reports the appropriate items based on the starting page (`startingAt`). Working set enumerators need to support change enumeration by implementing [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderEnumerator\/enumerateChanges(for:from:)], which reports the appropriate changes based on the sync anchor (`syncAnchor`). If the system queries the working set enumerator with a sync anchor that’s already aged out, the enumerator needs to report [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderError\/Code\/syncAnchorExpired] so the system restarts the sync operation from the beginning.\n\nThe system can request an enumerator and trigger an enumeration whenever necessary. For example, when a user browses a folder for the first time, the system requests an enumerator with the folder’s item identifier and triggers an enumeration for the folder. When getting a `PushKit` notification, it requests an enumerator with `.workingSet` (if there isn’t a cached one) and triggers a working set enumeration.\n\nThis sample implements the enumeration logic in the following class:\n\nFile provider extensions need to define a working set that contains the items of particular interest to the users. See [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/defining-your-file-provider-s-content] for more information. The system indexes the items the working set enumerator provides so they are searchable.\n\nIn this sample, the working set is the same as the item set in the root container (which includes every item under the root container, recursively). The extensions don’t maintain a local copy of the working set. When the system requests items, the extensions make a JSON call to retrieve the relevant information from the server, and pass the result to the system. Real-world file provider extensions can define a working set smaller than the root container item set, and use a different enumerator for the working set enumeration, if desired.\n\nThis sample doesn’t track the materialized items in the local system. Real-world file provider extensions can do that and report the items to the server so the server can maintain the materialized item set and avoid pushing the changes on items irrelevant to the devices. See [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/synchronizing-the-file-provider-extension] for more details.\n\n### Synchronize files between the device and the server\n\nThe state of a file provider item can change on both the device side and the server side. When that happens, the file provider extension needs to synchronize the state.\n\nWhen a change happens on the device side, the system notifies the file provider extension by calling the [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderReplicatedExtension] methods with the changes, and the extension passes the changes to the server to synchronize the states. Because of the involvement of networking requests, all the methods are asynchronous, have a `completionHandler`, and return a [doc:\/\/com.apple.documentation\/documentation\/Foundation\/Progress] object to the system for progress tracking or cancellation. The extension needs to call the completion handler to report the result back to the system. For more information about syncing files, see [https:\/\/developer.apple.com\/videos\/play\/wwdc2021\/10182\/] and [https:\/\/developer.apple.com\/videos\/play\/tech-talks\/10067].\n\nThis sample implements all the `NSFileProviderReplicatedExtension` methods in `Extension.swift`. The following code example shows the method that the system calls to notify the file provider about the changes on an item’s content or metadata from the device:\n\nThe method makes a JSON call to pass the changes to the server. If the server can’t fulfill all the changes, this method reports the fields associated with the unsynchronized changes back to the system using the `remainingFields`. If the item content changes on the server side, it asks the system to refetch the content by setting `shouldFetchContent` to `true`.\n\nWhen users or system APIs access a dataless item (a file that has the metadata only), the system calls the method in the code example below to tell the file provider to fetch the file content:\n\nThis method similarly makes a JSON call to download the file content, and returns a `Progress` object with a `cancellationHandler` that calls the `completionHandler`.\n\nTo work with the `POSIX` read operations that read only part of a file, the file provider extensions in this sample support partial download by implementing the following [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderPartialContentFetching] method:\n\nWhen changes happen on the server side, there are two ways to notify the file provider extensions:\n\nIn this sample, the server doesn’t implement the `PushKit` support (to reduce the complexity of the sample code configuration). It posts an `.itemsChanged` notification using [doc:\/\/com.apple.documentation\/documentation\/Foundation\/DistributedNotificationCenter] when changes happen. The macOS app, which runs on the same computer as the server, observes the notification, and triggers an enumeration when getting one. The iOS app provides the Signal domain button in the domain detail view for users to trigger an enumeration manually.\n\n### Enhance file providers with decorations, custom actions, and file provider UI extensions\n\nFile provider extensions can provide decorations and custom actions for an item. Finder and Files display the decorations on the item, and present the custom actions as contextual menu items when users Control-click or long press the item.\n\nTo provide decorations for a file provider item, the file provider extensions in this sample do the following:\n\nThe following code example returns the appropriate decorations based on the item state:\n\nSimilarly, the file provider extensions do the following to provide custom actions:\n\nThe following code example performs the actions:\n\nWhen performing an action, file provider extensions don’t present any additional UI elements. If necessary, apps can present the UI when users trigger a custom action by creating a file provider UI extension. See [doc:\/\/com.apple.documentation\/documentation\/FileProviderUI\/adding-actions-to-the-context-menu] for more details.\n\nThis sample implements a file provider UI extension to handle document conflicts and account authentication. For conflict handling, the file provider UI extension creates a custom action named *Other versions* (see the `NSExtension` > `NSExtensionFileProviderActions` entry in the `Info.plist` file in the `Action` target), and presents the conflict view controller (`ConflictViewController.swift`) when users trigger the action.\n\nThe system automatically presents the principal view controller ([doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Information-Property-List\/NSExtension\/NSExtensionPrincipalClass]) of the file provider UI extension for the [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderError\/notAuthenticated] error. When that happens, the file provider UI extension in this sample presents the account authentication view controller (`AuthenticationViewController`), as the following code example shows:\n\n### Handle errors elegantly\n\nThe File Provider framework defines the common errors in [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderError\/Code]. If an error happens when running a method that the system calls, file provider extensions need to report that by passing the error to the completion handler.\n\nAmong the predefined errors, the following four are resolvable: [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderError\/notAuthenticated], [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderError\/Code\/serverUnreachable], [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderError\/Code\/insufficientQuota], [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderError\/Code\/cannotSynchronize].\n\nWhen encountering a resolvable error, the system throttles the operation until something (most likely the app or extension) calls [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderManager\/signalErrorResolved(_:completionHandler:)] to signal that the user or the server resolves the error. Any other error, including crashes of the extension process, is transient, and causes the system to retry the modification.\n\nThe file provider UI extension in this sample calls the method with `.notAuthenticated` when the user resolves the authentication issue.",
  "rawMarkdown" : "---\nsource: https:\/\/developer.apple.com\/documentation\/FileProvider\/synchronizing-files-using-file-provider-extensions\ncrawled: 2025-12-02T15:29:06Z\n---\n\n# Synchronizing files using file provider extensions\n\n**Sample Code**\n\nMake remote files available in macOS and iOS, and synchronize their states by using file provider extensions.\n\n## Overview\n\nMore and more people use cloud storage to store and share digital assets. Developers can seamlessly integrate their cloud storage service with macOS and iOS by creating file provider extensions to expose items on their server as files or folders in macOS and iOS, and synchronize their states.\n\nThis sample code project implements file provider extensions that sync content between a file storage server and both macOS and iOS, so the files on the server are available on the local system and accessible through user interactions and system-provided APIs. It also demonstrates how to synchronize the states of the file provider items between the server and the systems, and how to enhance the user experience using decorations and custom actions. It includes a macOS app and an iOS app that implement a management interface for users to log in to the server and try out other features. The macOS app implements a simplified file storage server with HTTP-based communication to act as the backend of the file provider extensions.\n\n### Configure the sample code project\n\nTo build the sample app, perform the following steps in Xcode:\n\n1. Set the developer team for all targets to let Xcode automatically manage the provisioning profile. See [https:\/\/help.apple.com\/xcode\/mac\/current\/#\/dev23aab79b4] for details.\n2. Replace the App Group container identifier `group.com.example.apple-samplecode.FruitBasket` with one specific to your team for the entire project. The identifier points to an App Group container that the apps and extensions use to share data. It occurs in the entitlements for the `FruitBasket`, `Provider`, `Action`, and `FruitBasket-iOS` targets, and in `Defaults.swift` and `StandaloneServer.swift`. You can search `group.com.example.apple-samplecode.FruitBasket` in Xcode’s Find navigator and change all the occurrences (except the ones in this Readme file). See [doc:\/\/com.apple.documentation\/documentation\/Xcode\/configuring-app-groups] for more details.\n\nTo try out the macOS app:\n\n1. Run the `FruitBasket` target on your Mac.\n2. Add a domain by clicking Add Domain in `FruitBasket.app`, giving it a name, and clicking Save.\n3. Find the domain from the sidebar of Finder, and start to use it by dragging a file onto the location.\n\nTo try out the sample app in iOS:\n\n1. Launch the macOS app first. The macOS app includes a server, which the iOS app requires to function.\n2. Run the `FruitBasket-iOS` target on your iOS device.\n3. Tap the Settings button (the gear icon) in the iOS app, and select the macOS server. The macOS and iOS devices need to be on the same network for the app to find the server.\n4. Tap the Add button (+) to add a domain. A new domain is in a disabled state by default.\n5. Launch the Files app, find the domain in the list of locations, and then tap to enable it.\n\n### Understand the targets of the sample project\n\nThis sample project consists of the following targets:\n\n- `FruitBasket` is the macOS app target. Users use the app to create a file provider domain and log in to the remote server from a Mac. Running the app launches the standalone file storage server that acts as the backend of the file provider extension. To be functional, both the macOS and the iOS file provider extensions require the server to be running on the same network.\n- `FruitBasket-iOS` is the iOS app target. Users use the app to create a file provider domain and log in to the remote server for an iOS device.\n- `Provider` is the file provider extension target. It uses `Provider.entitlement` when building with the macOS app, and uses `Provider-iOS.entitlement` with the iOS app. The apps embed the extension using the Embed Without Signing setting. The target contains only an empty `main.swift`, which acts as the entry point for the file provider extensions. The concrete implementation of the file provider extensions is in the `Extension` target. Separating the implementation into a different target allows unit testing. Developers can’t run unit tests against an app extension directly.\n- `Extension` creates `extension.framework`, which implements all the file provider extension logics, and works in both macOS and iOS.\n- `Action` creates a macOS file provider UI extension that handles document conflicts and account authentication.\n- `Server` creates a simplified file storage server that acts as the backend of the file provider extensions.\n- `Common` creates `common.framework`, which provides some utilities for the entire project.\n\n### Manage file provider domains\n\nA file provider domain ([doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderDomain]) represents a location on the sidebar of Finder (macOS) or Files (iOS). A file provider extension can have multiple domains to provide different item sets and apply per-domain account authentication. macOS and iOS create one extension instance for each domain, so all the domains work independently.\n\nA file provider extension by default doesn’t have a domain, and so doesn’t show up in the location list of Finder or Files before users add one. In the sample, users add a domain by tapping the Add button (+) in `FruitBasket-iOS.app` (or Add Domain in `FruitBasket.app`), which triggers the following code:\n\n```swift\nfunc addDomain(displayName: String, accountIdentifier: String) {\n    \n    let domain = NSFileProviderDomain(identifier: NSFileProviderDomainIdentifier(rawValue: accountIdentifier), displayName: displayName)\n    NSFileProviderManager.add(domain) { _ in }\n}\n```\n\nThe domain name needs to be unique. Adding a domain with a name that conflicts with an existing domain triggers an NSFileWriteFileExistsError error.\n\nUsers can delete a domain by selecting it and tapping the Remove Domain button, which eventually triggers [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderManager\/remove(_:completionHandler:)] or [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderManager\/remove(_:mode:completionHandler:)]. In iOS, deleting a domain deletes all the files. In macOS, apps can keep downloaded files or files that contain unsynchronized local changes by specifying a removal mode ([doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderManager\/DomainRemovalMode]).\n\n### Enumerate file provider items\n\nAfter users add a domain, the system immediately asks the file provider extension for an enumerator (an object that implements [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderEnumerator]) by calling [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderEnumerating\/enumerator(for:request:)], and then triggers enumerations to request the items.\n\nFile provider extensions need to implement `enumerator(for:request:)` to provide the enumerator the system requests based on the `containerItemIdentifier` parameter, which can be [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderItemIdentifier\/rootContainer], [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderItemIdentifier\/workingSet], [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderItemIdentifier\/trashContainer], or a provider-supplied item identifier. All the enumerators need to support the initial enumeration by implementing [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderEnumerator\/enumerateItems(for:startingAt:)], which reports the appropriate items based on the starting page (`startingAt`). Working set enumerators need to support change enumeration by implementing [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderEnumerator\/enumerateChanges(for:from:)], which reports the appropriate changes based on the sync anchor (`syncAnchor`). If the system queries the working set enumerator with a sync anchor that’s already aged out, the enumerator needs to report [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderError\/Code\/syncAnchorExpired] so the system restarts the sync operation from the beginning.\n\nThe system can request an enumerator and trigger an enumeration whenever necessary. For example, when a user browses a folder for the first time, the system requests an enumerator with the folder’s item identifier and triggers an enumeration for the folder. When getting a `PushKit` notification, it requests an enumerator with `.workingSet` (if there isn’t a cached one) and triggers a working set enumeration.\n\nThis sample implements the enumeration logic in the following class:\n\n```swift\nclass ItemEnumerator: NSObject, NSFileProviderEnumerator\n```\n\nFile provider extensions need to define a working set that contains the items of particular interest to the users. See [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/defining-your-file-provider-s-content] for more information. The system indexes the items the working set enumerator provides so they are searchable.\n\nIn this sample, the working set is the same as the item set in the root container (which includes every item under the root container, recursively). The extensions don’t maintain a local copy of the working set. When the system requests items, the extensions make a JSON call to retrieve the relevant information from the server, and pass the result to the system. Real-world file provider extensions can define a working set smaller than the root container item set, and use a different enumerator for the working set enumeration, if desired.\n\nThis sample doesn’t track the materialized items in the local system. Real-world file provider extensions can do that and report the items to the server so the server can maintain the materialized item set and avoid pushing the changes on items irrelevant to the devices. See [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/synchronizing-the-file-provider-extension] for more details.\n\n### Synchronize files between the device and the server\n\nThe state of a file provider item can change on both the device side and the server side. When that happens, the file provider extension needs to synchronize the state.\n\nWhen a change happens on the device side, the system notifies the file provider extension by calling the [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderReplicatedExtension] methods with the changes, and the extension passes the changes to the server to synchronize the states. Because of the involvement of networking requests, all the methods are asynchronous, have a `completionHandler`, and return a [doc:\/\/com.apple.documentation\/documentation\/Foundation\/Progress] object to the system for progress tracking or cancellation. The extension needs to call the completion handler to report the result back to the system. For more information about syncing files, see [https:\/\/developer.apple.com\/videos\/play\/wwdc2021\/10182\/] and [https:\/\/developer.apple.com\/videos\/play\/tech-talks\/10067].\n\nThis sample implements all the `NSFileProviderReplicatedExtension` methods in `Extension.swift`. The following code example shows the method that the system calls to notify the file provider about the changes on an item’s content or metadata from the device:\n\n```swift\npublic func modifyItem(_ item: NSFileProviderItem, baseVersion version: NSFileProviderItemVersion, changedFields: NSFileProviderItemFields,\n                       contents newContents: URL?, options: NSFileProviderModifyItemOptions = [], request: NSFileProviderRequest,\n                       completionHandler: @escaping (NSFileProviderItem?, NSFileProviderItemFields, Bool, Error?) -> Void) -> Progress\n```\n\nThe method makes a JSON call to pass the changes to the server. If the server can’t fulfill all the changes, this method reports the fields associated with the unsynchronized changes back to the system using the `remainingFields`. If the item content changes on the server side, it asks the system to refetch the content by setting `shouldFetchContent` to `true`.\n\nWhen users or system APIs access a dataless item (a file that has the metadata only), the system calls the method in the code example below to tell the file provider to fetch the file content:\n\n```swift\npublic func fetchContents(for itemIdentifier: NSFileProviderItemIdentifier,\n                          version requestedVersion: NSFileProviderItemVersion?,\n                          request: NSFileProviderRequest,\n                          completionHandler: @escaping (URL?, NSFileProviderItem?, Error?) -> Void) -> Progress\n```\n\nThis method similarly makes a JSON call to download the file content, and returns a `Progress` object with a `cancellationHandler` that calls the `completionHandler`.\n\nTo work with the `POSIX` read operations that read only part of a file, the file provider extensions in this sample support partial download by implementing the following [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderPartialContentFetching] method:\n\n```swift\npublic func fetchPartialContents(for itemIdentifier: NSFileProviderItemIdentifier,\n                                 version requestedVersion: NSFileProviderItemVersion,\n                                 request: NSFileProviderRequest,\n                                 minimalRange range: NSRange,\n                                 aligningTo alignment: Int,\n                                 options: NSFileProviderFetchContentsOptions,\n                                 completionHandler:\n                                 @escaping (URL?, NSFileProviderItem?, NSRange,\n                                            NSFileProviderMaterializationFlags,\n                                            Error?) -> Void) -> Progress\n```\n\nWhen changes happen on the server side, there are two ways to notify the file provider extensions:\n\n- The server sends a [doc:\/\/com.apple.documentation\/documentation\/PushKit] notification of `fileProvider` push type with the item identifier. (The only valid container in a push payload is “`NSFileProviderWorkingSetContainerItemIdentifier`”.) When receiving the notification, the local system (macOS or iOS) triggers an enumeration so the file provider extensions can fetch the changes from the server. See [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/using-push-notifications-to-signal-changes] and [doc:\/\/com.apple.documentation\/documentation\/UserNotifications\/sending-push-notifications-using-command-line-tools] for more information.\n- The app detects that there are pending server-side changes (by using remote push notifications or polling, for example), and triggers an enumeration by calling [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderManager\/signalEnumerator(for:completionHandler:)]. See [doc:\/\/com.apple.documentation\/documentation\/UserNotifications\/setting-up-a-remote-notification-server] for more information.\n\nIn this sample, the server doesn’t implement the `PushKit` support (to reduce the complexity of the sample code configuration). It posts an `.itemsChanged` notification using [doc:\/\/com.apple.documentation\/documentation\/Foundation\/DistributedNotificationCenter] when changes happen. The macOS app, which runs on the same computer as the server, observes the notification, and triggers an enumeration when getting one. The iOS app provides the Signal domain button in the domain detail view for users to trigger an enumeration manually.\n\n### Enhance file providers with decorations, custom actions, and file provider UI extensions\n\nFile provider extensions can provide decorations and custom actions for an item. Finder and Files display the decorations on the item, and present the custom actions as contextual menu items when users Control-click or long press the item.\n\nTo provide decorations for a file provider item, the file provider extensions in this sample do the following:\n\n- Declare the item decorations using the `NSExtension` > `NSFileProviderDecorations` entry in the `Info.plist` file in the `Provider` target, which includes adding the `Identifier`, `Label`, `Category`, and `BadgeImageType` keys for each decoration.\n- Implement [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderItemDecorating] in the file provider item class [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderItem-swift.typealias] to return the decoration identifiers ([doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderItemDecorationIdentifier]) of the current item.\n\nThe following code example returns the appropriate decorations based on the item state:\n\n```swift\nvar decorations: [NSFileProviderItemDecorationIdentifier]?\n```\n\nSimilarly, the file provider extensions do the following to provide custom actions:\n\n- Declare the custom actions using the `NSExtension` > `NSExtensionFileProviderActions` entry in the `Info.plist` file in the `Provider` target, which includes adding the [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Information-Property-List\/NSExtension\/NSExtensionFileProviderActions\/NSExtensionFileProviderActionIdentifier], [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Information-Property-List\/NSExtension\/NSExtensionFileProviderActions\/NSExtensionFileProviderActionName], [doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Information-Property-List\/NSExtension\/NSExtensionFileProviderActions\/NSExtensionFileProviderActionActivationRule], and `Comment` keys for each action. See [doc:\/\/com.apple.documentation\/documentation\/FileProviderUI\/adding-actions-to-the-context-menu] for information about using `NSExtensionFileProviderActionActivationRule` to enable or disable a custom action based on the current context.\n- Implement [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderCustomAction] in the file provider extension class to perform the actions when users select the contextual menu items.\n\nThe following code example performs the actions:\n\n```swift\npublic func performAction(identifier actionIdentifier: NSFileProviderExtensionActionIdentifier,\n                          onItemsWithIdentifiers itemIdentifiers: [NSFileProviderItemIdentifier],\n                          completionHandler: @escaping (Error?) -> Void) -> Progress\n```\n\nWhen performing an action, file provider extensions don’t present any additional UI elements. If necessary, apps can present the UI when users trigger a custom action by creating a file provider UI extension. See [doc:\/\/com.apple.documentation\/documentation\/FileProviderUI\/adding-actions-to-the-context-menu] for more details.\n\nThis sample implements a file provider UI extension to handle document conflicts and account authentication. For conflict handling, the file provider UI extension creates a custom action named *Other versions* (see the `NSExtension` > `NSExtensionFileProviderActions` entry in the `Info.plist` file in the `Action` target), and presents the conflict view controller (`ConflictViewController.swift`) when users trigger the action.\n\nThe system automatically presents the principal view controller ([doc:\/\/com.apple.documentation\/documentation\/BundleResources\/Information-Property-List\/NSExtension\/NSExtensionPrincipalClass]) of the file provider UI extension for the [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderError\/notAuthenticated] error. When that happens, the file provider UI extension in this sample presents the account authentication view controller (`AuthenticationViewController`), as the following code example shows:\n\n```swift\npublic override func prepare(forError error: Error) {\n    prepare(AuthenticationViewController())\n}\n```\n\n### Handle errors elegantly\n\nThe File Provider framework defines the common errors in [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderError\/Code]. If an error happens when running a method that the system calls, file provider extensions need to report that by passing the error to the completion handler.\n\nAmong the predefined errors, the following four are resolvable: [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderError\/notAuthenticated], [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderError\/Code\/serverUnreachable], [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderError\/Code\/insufficientQuota], [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderError\/Code\/cannotSynchronize].\n\nWhen encountering a resolvable error, the system throttles the operation until something (most likely the app or extension) calls [doc:\/\/com.apple.documentation\/documentation\/FileProvider\/NSFileProviderManager\/signalErrorResolved(_:completionHandler:)] to signal that the user or the server resolves the error. Any other error, including crashes of the extension process, is transient, and causes the system to retry the modification.\n\nThe file provider UI extension in this sample calls the method with `.notAuthenticated` when the user resolves the authentication issue.\n\n```swift\ntry await manager.signalErrorResolved(NSFileProviderError(.notAuthenticated))\n```\n\n## Essentials\n\n- **Synchronizing the File Provider Extension**: Keep the local and remote copies of your File Provider extension’s content in sync.\n- **Setting the Finder Sidebar Icon**: Specify a standard or custom symbol as a sidebar icon.\n\n",
  "sections" : [
    {
      "content" : "",
      "items" : [
        {
          "description" : "Keep the local and remote copies of your File Provider extension’s content in sync.",
          "name" : "Synchronizing the File Provider Extension",
          "url" : "https:\/\/developer.apple.com\/documentation\/FileProvider\/synchronizing-the-file-provider-extension"
        },
        {
          "description" : "Specify a standard or custom symbol as a sidebar icon.",
          "name" : "Setting the Finder Sidebar Icon",
          "url" : "https:\/\/developer.apple.com\/documentation\/FileProvider\/setting-the-finder-sidebar-icon"
        }
      ],
      "title" : "Essentials"
    }
  ],
  "source" : "appleJSON",
  "title" : "Synchronizing files using file provider extensions",
  "url" : "https:\/\/developer.apple.com\/documentation\/FileProvider\/synchronizing-files-using-file-provider-extensions"
}