{
  "abstract" : "Browse the latest sample code, articles, tutorials, and API reference.",
  "codeExamples" : [

  ],
  "contentHash" : "cfd37a07759f8a3d2b31d7d07bc35af35dc920d3066b2483fc838e2cf8a27483",
  "crawledAt" : "2025-12-02T15:26:29Z",
  "id" : "2C538969-BE2D-4420-AD24-5237B90EE937",
  "kind" : "unknown",
  "overview" : "Apple Developer DocumentationBrowse the latest sample code, articles, tutorials, and API reference.\n\nNew overview  Explore the new design principles Learn how to design and develop beautiful interfaces that leverage Liquid Glass. Read overview  New article  Adopting Liquid Glass Find out how to bring the new material to your app. Read article  New sample  Landmarks: Building an app with Liquid Glass Enhance your app experience with system-provided and custom Liquid Glass. View sample code Get a running start with AI New article  Writing code with intelligence in Xcode Generate code, fix bugs fast, and learn as you go with intelligence built directly into Xcode. View article  New article  Improving the safety of generative model output Create generative experiences that appropriately handle sensitive inputs and respect people. View article  New article  Generating content and performing tasks with Foundation Models Enhance the experience in your app by prompting an on-device large language model. View article Stay informed about what's newUpdates and release notesView major documentation updates and highlights from WWDC, browse ongoing updates from frameworks over time, and jump to the latest release notes.View collection\n\nExplore hundreds of samplesSample code libraryExpand your knowledge of Apple technologies by exploring the full library of sample code projects.View samples",
  "rawMarkdown" : "---\nsource: https:\/\/developer.apple.com\/documentation\ncrawled: 2025-12-02T15:26:28Z\n---\n\n# Featured | Apple Developer Documentation\n\n# Apple Developer Documentation\n\nBrowse the latest sample code, articles, tutorials, and API reference.\n\n## Dive into WWDC25\n\n[ New overview  Explore the new design principles Learn how to design and develop beautiful interfaces that leverage Liquid Glass. Read overview ](\/documentation\/TechnologyOverviews\/liquid-glass)[ New article  Adopting Liquid Glass Find out how to bring the new material to your app. Read article ](\/documentation\/TechnologyOverviews\/adopting-liquid-glass)[ New sample  Landmarks: Building an app with Liquid Glass Enhance your app experience with system-provided and custom Liquid Glass. View sample code ](\/documentation\/SwiftUI\/Landmarks-Building-an-app-with-Liquid-Glass)## Get a running start with AI\n\n[ New article  Writing code with intelligence in Xcode Generate code, fix bugs fast, and learn as you go with intelligence built directly into Xcode. View article ](\/documentation\/Xcode\/writing-code-with-intelligence-in-xcode)[ New article  Improving the safety of generative model output Create generative experiences that appropriately handle sensitive inputs and respect people. View article ](\/documentation\/FoundationModels\/improving-the-safety-of-generative-model-output)[ New article  Generating content and performing tasks with Foundation Models Enhance the experience in your app by prompting an on-device large language model. View article ](\/documentation\/FoundationModels\/generating-content-and-performing-tasks-with-foundation-models)## Stay informed about what's new\n\n- ### Updates and release notes\n\nView major documentation updates and highlights from WWDC, browse ongoing updates from frameworks over time, and jump to the latest release notes.[View collection ](\/documentation\/Updates)\n\n## Explore hundreds of samples\n\n- ### Sample code library\n\nExpand your knowledge of Apple technologies by exploring the full library of sample code projects.[View samples ](\/documentation\/SampleCode)\n\n## Learn about features in Swift and Xcode\n\n[ Creating your app icon using Icon Composer ](\/documentation\/Xcode\/creating-your-app-icon-using-icon-composer)[ Launching your app from a Live Activity ](\/documentation\/ActivityKit\/launching-your-app-from-a-live-activity)[ Observing playback state in SwiftUI ](\/documentation\/AVFoundation\/observing-playback-state-in-swiftui)[ Adopting inheritance in SwiftData ](\/documentation\/SwiftData\/Adopting-inheritance-in-SwiftData)[ Performing long-running tasks on iOS and iPadOS ](\/documentation\/BackgroundTasks\/performing-long-running-tasks-on-ios-and-ipados)[ Recording UI automation for testing ](\/documentation\/XCUIAutomation\/recording-ui-automation-for-testing)[ Running code snippets using the playground macro ](\/documentation\/Xcode\/running-code-snippets-using-the-playground-macro)[ Managing your app’s information property list values ](\/documentation\/BundleResources\/managing-your-app-s-information-property-list)## Discover Apple Intelligence and ML\n\n[ Technology overview  Apple Intelligence and machine learning Add intelligent features with Apple Intelligence, machine learning, and related technologies. View technology overview ](\/documentation\/TechnologyOverviews\/ai-machine-learning)[ Design guidance  Machine learning Design models that enable apps and games to learn from data and usage patterns, improving existing experiences and creating engaging new ones. View design guidance ](\/design\/Human-Interface-Guidelines\/machine-learning)[ Foundation Models ](\/documentation\/FoundationModels)[ Loading and using a custom adapter with Foundation Models ](\/documentation\/FoundationModels\/loading-and-using-a-custom-adapter-with-foundation-models)[ Displaying static and interactive snippets ](\/documentation\/AppIntents\/displaying-static-and-interactive-snippets)[ Integrating your app with visual intelligence ](\/documentation\/VisualIntelligence\/integrating-your-app-with-visual-intelligence)## Level up your app's interface\n\n[ Immersive Media Support ](\/documentation\/ImmersiveMediaSupport)[ The menu bar ](\/design\/Human-Interface-Guidelines\/the-menu-bar)[ Creating engaging challenges from leaderboards ](\/documentation\/GameKit\/creating-engaging-challenges-from-leaderboards)[ Understanding the Metal 4 core API ](\/documentation\/Metal\/understanding-the-metal-4-core-api)[ Discovering and tracking spatial game controllers and styli ](\/documentation\/GameController\/discovering-and-tracking-spatial-game-controllers-and-styli)[ Building your macOS game remotely from your PC ](\/documentation\/TechnologyOverviews\/building-your-macos-game-remotely-from-your-pc)[ Signing people in to their media accounts automatically ](\/documentation\/VideoSubscriberAccount\/signing-people-in-to-media-apps-automatically)[ Building and customizing the menu bar with SwiftUI ](\/documentation\/SwiftUI\/Building-and-customizing-the-menu-bar-with-SwiftUI)## Development essentials\n\n[ Development guides  Technology overviews Learn about the wide range of technologies you use to develop software for Apple platforms. View technology overviews ](\/documentation\/TechnologyOverviews)[ Design guidance  Human Interface Guidelines Design a great experience for any Apple platform. View design guidance ](\/design\/human-interface-guidelines)[ SwiftUI Declare the user interface and behavior for your app on every platform. View API collection ](\/documentation\/SwiftUI)[ View fundamentals Define the visual elements of your app using a hierarchy of views. Read article ](\/documentation\/SwiftUI\/View-fundamentals)[ Supporting multiple languages in your app Internationalize your app’s strings, images, and other resource types to prepare for the translation process. Read article ](\/documentation\/Xcode\/supporting-multiple-languages-in-your-app)[ Accessibility Make your apps accessible to everyone who uses Apple devices. View API collection ](\/documentation\/Accessibility)[ Creating your first visionOS app Build a new visionOS app using SwiftUI and add platform-specific features. Read article ](\/documentation\/visionOS\/creating-your-first-visionos-app)[ Developing a WidgetKit strategy Explore features, tasks, related frameworks, and constraints as you make a plan to implement widgets, controls, watch complications, and Live Activities. Read article ](\/documentation\/WidgetKit\/Developing-a-WidgetKit-strategy)\n- [Downloads\n\nGet the latest SDKs and beta operating systems for all Apple platforms. Download resources ](https:\/\/developer.apple.com\/download)\n\n- [Documentation Archive\n\nAccess archived documentation and sample code that’s no longer updated. Visit archive ](https:\/\/developer.apple.com\/library\/archive\/navigation)\n\n- [Videos\n\nLearn about the latest technologies presented at Apple developer events. Watch videos ](https:\/\/developer.apple.com\/videos)\n\n- [Discussion Forums\n\nAsk questions and discuss development with Apple engineers and other developers. View forums ](https:\/\/developer.apple.com\/devforums)",
  "sections" : [
    {
      "content" : "",
      "title" : "Dive into WWDC25"
    },
    {
      "content" : "",
      "title" : "Get a running start with AI"
    },
    {
      "content" : "",
      "title" : "Stay informed about what's new"
    },
    {
      "content" : "",
      "title" : "Explore hundreds of samples"
    },
    {
      "content" : "",
      "title" : "Learn about features in Swift and Xcode"
    },
    {
      "content" : "",
      "title" : "Discover Apple Intelligence and ML"
    },
    {
      "content" : "",
      "title" : "Level up your app's interface"
    },
    {
      "content" : "",
      "title" : "Development essentials"
    }
  ],
  "source" : "appleWebKit",
  "title" : "Featured | Apple Developer Documentation",
  "url" : "https:\/\/developer.apple.com\/documentation"
}